{"identifier":"me.big.tuwien.ac.at/EAModelSet/id-c13ef8e7a7b04b1c8fdc0c4550b89bb9","archimateId":"id-c13ef8e7a7b04b1c8fdc0c4550b89bb9","name":"Metamodel (jak se co kreslí) EGdílna","documentation":"","availableFormats":["JSON","XML","ARCHIMATE","CSV"],"source":"GitHub","sourceFile":"raw-data/github/archimate/metamodel_znalostni_architektury_jaksecokresli.archimate","sourceFormat":"ARCHIMATE","timestamp":"25-06-2023 05:33:20","tags":[],"duplicates":[],"language":"","elements":[{"id":"metamodelschopnost","name":"Schopnost","type":"Capability","layer":"strategy","documentation":"Komplexní schopnost, zejména u schopností úřadu. Znamená společnou schopnost v úřadě, která se vykonává jednotně napříč celým úřadem a má i jednotné metodiky a jednotný rámec, ať už se dotýká jakékoliv agendy (v agendách může být pochopitelně parametricky přizpůsobena). Schopnost lze na byznysové vrstvě nejlépe rozpadnout na elementy typu [Služba] a [Proces], důležité jsou také [Role] zejména uvnitř úřadu. Na aplikační vrstvě se nesmí zapomínat zejména na [Informační systém veřejné správy] a [Informační systém], díky kterým můžeme schopnost realizovat. Schopnost plyne z nějakého byznysového prvku, a tedy zejména z typů [Povinnost]."},{"id":"metamodelpovinnost","name":"Povinnost","type":"BusinessObject","layer":"business","documentation":"Povinnost definovaná právním předpisem, je ve skutečnosti základem kontraktu zúčastněných stran, přičemž pro stranu poskytovatele povinnosti je povinnou."},{"id":"metamodelzakon","name":"Zákon","type":"Contract","layer":"business","documentation":"Jeden zákon, identifikací je označení zákona."},{"id":"metamodelikovs","name":"Informační koncepce úřadu","type":"Contract","layer":"business","documentation":"Informační koncepce zpracovaná podle zákona o ISVS a vyhlášky o dlouhodobém řízení je jediným legálním závazným koncepčním rámcem úřadu."},{"id":"metamodelorganizace","name":"Organizace","type":"BusinessActor","layer":"business","documentation":"Organizace jako aktér v rámci architektury"},{"id":"metamodelsluzbavs","name":"Služba veřejné správy","type":"BusinessService","layer":"business","documentation":"Služba poskytovaná OVM ať už podle zákona o PDS nebo jinou formou výkonu působnosti"},{"id":"ikcr","name":"Informační koncepce ČR","type":"Contract","layer":"business","documentation":"Informační koncepce ČR je závazným koncepčním dokumentem stanovujícím principy a zásady a cíle pro rozvoj veřejné správy a eGovernmentu. OVM a OVS se podle ní musejí řídit, stanoví to § 5 a § 5a, zákona 365/2000. / https://archi.gov.cz/ikcr-dokument:ikcr"},{"id":"metamodelrole","name":"Role","type":"BusinessRole","layer":"business","documentation":"Určitá byznysová role. Jsme vždy schopni k dané roli přiřadit někoho a role vykonává činnosti či pracuje s dalšími objekty. I role je klíčovým elementem v modelu architektury EG."},{"id":"metamodelagenda","name":"Agenda veřejné správy","type":"BusinessFunction","layer":"business","documentation":"Agenda podle zákona 111/2009. agendou se rozumí ucelená oblast působení orgánu veřejné moci nebo ucelená oblast působení "},{"id":"metamodelvnitrnipredpis","name":"Závazný předpis","type":"Contract","layer":"business","documentation":"Vydaný předpis s určitou platností, vydává jej vždy někdo na základě něčeho a může být prováděním jiného předpisu. Je do určité míry závazný, většinou pro organizaci vydavatele."},{"id":"metamodelposkytovanasluzba","name":"Poskytovaná služba","type":"BusinessService","layer":"business","documentation":"Byznysová služba poskytovaná někým pro někoho, ať už jde o konkrétní poskytnutí jednomu příjemci, nebo o komplexní službu. Její specializací jsou pak služby veřejné správy, jež OVM poskytují uživatelům. Služba je to na byznysové úrovni."},{"id":"metamodelramcovasluzba","name":"Rámcová služba","type":"BusinessService","layer":"business","documentation":"Jedná se o byznysovou službu, která je rámcová ve smyslu, že díky ní se pak poskytují konkrétní služby."},{"id":"metamodelitstrategie","name":"Strategie rozvoje IT","type":"Contract","layer":"business","documentation":"Základní závazný vnitřní dokument s koncepčním strategickým rámcem pro fungování a rozvoj ICT a aplikací a systémů v organizaci. Mimo jiné, zhodnocuje aktuální stav a jeho problémy, definuje cíle rozvoje IT a principy a zásady pro správu a rozvoj ICT v organizaci a určuje podmínky k jejich realizaci. Zatímco úřad si povinně zpracovává jako tento dokument Informační koncepci, toto je dobrovolný, ale nezbytný dokument jiné organizace, jež není úřadem."},{"id":"metamodelproces","name":"Proces","type":"BusinessProcess","layer":"business","documentation":"Identifikovaný a popsaný proces"},{"id":"metamodelvyhlaska","name":"Vyhláška","type":"Contract","layer":"business","documentation":"Jedna vyhláška nebo nařízení vlády, je prováděcím předpisem zákona (většinou) a lze ji najít také ve sbírce."},{"id":"ovm","name":"Orgán veřejné moci","type":"BusinessActor","layer":"business","documentation":"Subjekt, který je orgánem veřejné moci. Definuje se proto, že díky jeho OVMství má nějaké role, povinnosti a práva."},{"id":"metamodelvnitrnirole","name":"Role osoby nebo útvaru v organizaci","type":"BusinessRole","layer":"business","documentation":"Osoba či útvar nebo organizační jednotka má jednu či více rolí. Vnitřní rolí se rozumí role vykonávající určité procesy, nebo je zodpovědná za určitou oblast nebo činnosti. Jednotlivé vazby se pak vazbí právě na tuto roli, nikoliv na konkrétní útvar."},{"id":"metamodelbyzstrategie","name":"Strategie organizace","type":"Contract","layer":"business","documentation":"Základní závazný vnitřní dokument organizace určující její obecné strategické směřování a podrobnosti k jejímu fungování a stanovující strategické cíle a jejich realizaci."},{"id":"metamodelps","name":"Poskytovaná služba","type":"BusinessService","layer":"business","documentation":"Jde o konkrétní poskytovanou byznysovou službu s jasným poskytovateleme a zodpovědným útvarem v úřadu, poskytovaná služba je konkrétnější a může být závislá na službě veřejné správy či na rámcové službě."},{"id":"metamodelrs","name":"Rámcová služba","type":"BusinessService","layer":"business","documentation":"Jde o byznysovou obecnou službu, jež někdo poskytuje a někdo využívá a je spíše obecnější, může pak sloužit jako služba na jejímž základě se poskytují konkrétnější tzv. Poskytované služby"},{"id":"metamodelaplikacnirozhrani","name":"Rozhraní informačního systému ","type":"ApplicationInterface","layer":"application","documentation":"Technické rozhraní mezi aplikacemi, či uživatelské rozhraní. Je důležitým prvkem pro modelování integrací informačních systémů zejména na sdílené služby."},{"id":"metamodelaplikacniproces","name":"Proces realizovaný v systému ","type":"ApplicationProcess","layer":"application","documentation":"Proces nebo funkční postup, který je uživatelem vyvolán a realizován kroky v příslušné komponentě informačního systému nebo v aplikaci."},{"id":"metamodelkomponentais","name":"Komponenta systému","type":"ApplicationComponent","layer":"application","documentation":"Fyzická komponenta systému, se kterou se na vývojové větvi pracuje či dá pracovat samostatně. Může se jednat o fyzické komponenty i s různými dodavateli, což je dobrý způsob oddělení komponent v architektuře."},{"id":"metamodeludaje","name":"Údaje a soubory údajů","type":"DataObject","layer":"application","documentation":"Údaje nebo soubory údajů, jsou někde evidovány a někdo za ně zodpovídá, dané soubory údajů jsou skupinami, nikoliv datovými soubory."},{"id":"isvs","name":"Informační systém veřejné správy","type":"ApplicationComponent","layer":"application","documentation":"Informační systém veřejné správy, na který dopadají povinnosti podle zákona 365/2000."},{"id":"metamodelaplikacnisluzba","name":"Aplikační služba jako funkcionalita","type":"ApplicationService","layer":"application","documentation":"Aplikační služba pro alespoň rámcový rozpis toho, co dělá aplikace či systém."},{"id":"metamodelplatformnisw","name":"Platformní software","type":"SystemSoftware","layer":"technology","documentation":"Technologický platformní software, který slouží jako platforma pro aplikace a systémy."},{"id":"metamodelcilprojektu","name":"Projektový cíl","type":"Goal","layer":"motivation","documentation":"Definovaný a stanovený cíl projektu nebo aktivity, lze jej sledovat a vyhodnocovat a tím vyhodnotit i postup celého projektu. Není rozvojovým obecným cílem jež je realizován projetkem, ale naopak projekt zahrnuje svoje projektové cíle."},{"id":"metamodelpozadavek","name":"Požadavek","type":"Requirement","layer":"motivation","documentation":"Požadavek se zakresluje na motivační vrstvě a ve veřejné správě má více významů. Je to něco, co někdo požaduje a někdo to má zajistit. Může se jednat o vnitřní požadavek, ale také o požadavek v souvislosti s veřejnými zakázkami."},{"id":"metamodelstakeholder","name":"Stakeholder jako zainteresovaný účastník","type":"Stakeholder","layer":"motivation","documentation":"Osoba, nebo tým či organizace, jež jsou zainteresovány v nějaké věci, využívá se na motivační vrstvě architektury pro modelování potřeb a cílů a motivací."},{"id":"metamodelitcil","name":"Cíl rozvoje IT","type":"Goal","layer":"motivation","documentation":"Cíl klíčový pro efektivitu nákladů a přínosů ICT prostředků a správný rozvoj ICT v organizaci."},{"id":"metamodelpotreba","name":"Potřeba nebo důvod motivace","type":"Driver","layer":"motivation","documentation":"Pojmenovaný důvod nebo potřeba, na základě které jsme motivováni k přípravě a realizaci něčeho. Kupříkladu potřeba je motivací pro nějaký projekt nebo pro nějaký vnitřní předpis."},{"id":"metamodelbyzstratcil","name":"Strategický cíl organizace","type":"Goal","layer":"motivation","documentation":"Cíl klíčový pro naplnění poslání organizace a pro efektivitu jejího strategického rozvoje a fungování."},{"id":"metamodelzasada","name":"Zásada řízení","type":"Principle","layer":"motivation","documentation":"Definovaná zásada uplatňovaná při řízení rozvoje ICT, je závazná pro jakýkoliv aspekt rozvoje ICT, jehož se týká. Je povinně dodržována."},{"id":"metamodelprincip","name":"Architektonický princip","type":"Principle","layer":"motivation","documentation":"Definovaný princip uplatňování nejen v rámci rozvoje architektury, ale především při její realizaci a vynucování a při rozvoji ICT. Je vždy povinně dodržován."},{"id":"metamodelpostup","name":"Pracovní postup","type":"WorkPackage","layer":"implementation_migration","documentation":"Definovatelný postup práce skládající se z jednotlivých kroků."},{"id":"metamodelprojekt","name":"Projekt","type":"WorkPackage","layer":"implementation_migration","documentation":"Interní projekt organizace, nebo formálně pojatý projekt či aktivita"},{"id":"metamodelkrok","name":"Pracovní krok","type":"WorkPackage","layer":"implementation_migration","documentation":"Definovatelný krok, co se musí udělat jako součást většího pracovního celku."},{"id":"metamodelprogram","name":"Program","type":"WorkPackage","layer":"implementation_migration","documentation":"Projektový program respektive program rozdělený do více projektů. Je nadřazenou skupinou práce pro jednotlivé projekty"}],"relationships":[{"id":"metamodelprojektmetamodelcilprojektu","sourceId":"metamodelprojekt","targetId":"metamodelcilprojektu","type":"AssociationRelationship","name":"zahrnuje","documentation":"Projekt lze rozdělit do definovaných cílů, ty by se měly shodovat s projektovým záměrem a s projektovou dokumentací."},{"id":"metamodelprojektmetamodelitcil","sourceId":"metamodelprojekt","targetId":"metamodelitcil","type":"RealizationRelationship","name":"realizuje","documentation":"Každý interní projekt ICT musí realizovat alespoň jeden cíl rozvoje, čím více cílů, tím lépe. Realizace cílů se popíše v obsahovém rámci projektu a realizace těchto cílů je také důvodem pro projekt."},{"id":"metamodelitstrategiemetamodelitcil","sourceId":"metamodelitstrategie","targetId":"metamodelitcil","type":"RealizationRelationship","name":"definuje","documentation":"Cíle jsou v rámci vyhodnocování plnění strategie sledovány a jsou připravovány takové projekty, které by tyto cíle naplňovaly, respektive, realizovaly. Vyhodnocuje se tak jejich obecný pokrok."},{"id":"metamodelprojektmetamodelzasada","sourceId":"metamodelprojekt","targetId":"metamodelzasada","type":"RealizationRelationship","name":"naplňuje","documentation":"Každý připravovaný a realizovaný projekt musí respektovat naše zásady uvedené ve strategii a být s nimi v souladu. To se uvede i v obsahovém záměru a projektové dokumentaci. V případě výjimky se toto řádně odůvodní a postupuje se dle obvyklého procesu schvalování výjimky."},{"id":"metamodelprincipmetamodelstakeholder","sourceId":"metamodelprincip","targetId":"metamodelstakeholder","type":"AssociationRelationship","name":"má význam pro","documentation":"Definujeme a zakreslujeme to pro to, protože to souvisí se stakeholderem a je to pro něj důležité. Budeme tedy sledovat nejen samotné naplnění, ale i pozitivní dopad na stakeholdery."},{"id":"metamodelagendaisvs","sourceId":"metamodelagenda","targetId":"isvs","type":"AssociationRelationship","name":"je podporována systémem","documentation":"Informační systém slouží především pro podporu výkonu agend či agendy, to se týká jak jeho funkcí a podporovaných procesů úřadů, tak ale také evidovaných a spravovaných údajů, a to včetně využívání a poskytování údajů v dané agendě. Je nezbytné znát vazbu mezi systémem a agendami. A taková souvislost se pak také ohlašuje v rámci RPP správcem systému, respektive, ohlašovatelem agendy."},{"id":"metamodelzakonmetamodelvyhlaska","sourceId":"metamodelzakon","targetId":"metamodelvyhlaska","type":"AggregationRelationship","name":"je prováděn předpisem","documentation":"Vyhláška je podřízený předpis zákonu a zakreslí se jako jeho prováděcí předpis, aby byla jasná vazba mezi zákonem a jeho vyhláškami."},{"id":"metamodelitcilmetamodelstakeholder","sourceId":"metamodelitcil","targetId":"metamodelstakeholder","type":"AssociationRelationship","name":"má význam pro","documentation":"Definujeme a zakreslujeme to pro to, protože to souvisí se stakeholderem a je to pro něj důležité. Budeme tedy sledovat nejen samotné naplnění, ale i pozitivní dopad na stakeholdery."},{"id":"metamodelitstrategiemetamodelikovs","sourceId":"metamodelitstrategie","targetId":"metamodelikovs","type":"SpecializationRelationship","name":"má specializaci","documentation":"Úřady podle zákona 365/2000 o ISVS a jeho prováděcích předpisů a rámce Národní architektury musí vydat a aktualizovat a realizovat informační koncepci podle jasné struktury a s jasnými náležitostmi. Není to tedy dobrovolné a zcela volné, naopak."},{"id":"metamodelpotrebametamodelprojekt","sourceId":"metamodelpotreba","targetId":"metamodelprojekt","type":"AssociationRelationship","name":"je motivací pro","documentation":"Do motivační architektury projektu zaneseme, na co reaguje, které má důvody či potřeby, které jsou dále navázány na stakeholdery."},{"id":"ovmmetamodelpozadavek","sourceId":"ovm","targetId":"metamodelpozadavek","type":"AssociationRelationship","name":"naplňuje","documentation":"Zapsání toho, že někdo (ať už subjekt či OVM) naplňuje (tedy musí závazně naplňovat) určitou povinnost souladu plynoucí mu z nějakého rámce. A veřejná správa obecně naplňuje povinnost souladu, nezaměňovat za naplnění obecné povinnosti"},{"id":"metamodelzasadametamodelstakeholder","sourceId":"metamodelzasada","targetId":"metamodelstakeholder","type":"AssociationRelationship","name":"má význam pro","documentation":"Definujeme a zakreslujeme to pro to, protože to souvisí se stakeholderem a je to pro něj důležité. Budeme tedy sledovat nejen samotné naplnění, ale i pozitivní dopad na stakeholdery."},{"id":"isvsmetamodelkomponentais","sourceId":"isvs","targetId":"metamodelkomponentais","type":"CompositionRelationship","name":"obsahuje součást","documentation":"Základní vazba aplikační kompozice systému, nejen pro ISVS jako takové. Systém je rozdělen na komponenty a funguje správně jako celek jen, když  fungují-li tyto komponenty a spolupracují-li správně. Aplikační kompozice je součástí povinné registrace ISVS do RPP."},{"id":"metamodelorganizacemetamodelitstrategie","sourceId":"metamodelorganizace","targetId":"metamodelitstrategie","type":"AssociationRelationship","name":"vydává","documentation":"Jde o základní závazný vnitřní dokument s koncepčním strategickým rámcem pro fungování a rozvoj ICT a aplikací a systémů v organizaci. Mimo jiné zhodnocuje aktuální stav a jeho problémy, definuje cíle rozvoje IT a principy a zásady pro správu a rozvoj ICT v organizaci a určuje podmínky k jejich realizaci. Zatímco úřad si povinně zpracovává jako tento dokument informační koncepci, toto je dobrovolný, ale nezbytný dokument jiné organizace, jež není úřadem."},{"id":"metamodelitstrategiemetamodelprincip","sourceId":"metamodelitstrategie","targetId":"metamodelprincip","type":"RealizationRelationship","name":"určuje závazně","documentation":"Stanovené principy se dodržují a sleduje se jejich naplňování a v případě potřeby se aktualizují. Projekty jsou s nimi v souladu, nebo je jim z některých udělena výjimka, provozní aktivity a rozvoj jsou s nimi také v souladu."},{"id":"ovmmetamodelsluzbavs","sourceId":"ovm","targetId":"metamodelsluzbavs","type":"RealizationRelationship","name":"poskytuje službu","documentation":"Orgán veřejné moci buď poskytuje nebo užívá službu, obojí se zakresluje s odlišným NAME parametrem vazby."},{"id":"metamodelitstrategiemetamodelzasada","sourceId":"metamodelitstrategie","targetId":"metamodelzasada","type":"AssociationRelationship","name":"určuje závazně","documentation":"Stanovené zásady se dodržují a IT se jimi při svých činnostech řídí a sleduje se jejich dodržování a v případě potřeby se aktualizují. Projekty jsou s nimi v souladu, nebo je jim z některých udělena výjimka, provozní aktivity a rozvoj jsou s nimi také v souladu."},{"id":"isvsisvs","sourceId":"isvs","targetId":"isvs","type":"ServingRelationship","name":"přistupuje ke službám systému","documentation":"Integrace mezi dvěma informačními systémy, a to zejména mezi dvěma ISVS, respektive, AIS se zakresluje jako vazba mezi dvěma systémy, přičemž na vrcholové úrovni se ignoruje přístup k rozhraní."},{"id":"ikcrmetamodelikovs","sourceId":"ikcr","targetId":"metamodelikovs","type":"AggregationRelationship","name":"je prováděn předpisem","documentation":"Orgán veřejné správy si tvoří povinně svoji informační koncepci. Ta je vlastně lokální specializací národní koncepce, ovšem pochopitelně s daleko širším a podrobnějším obsahem."},{"id":"metamodelzakonmetamodelagenda","sourceId":"metamodelzakon","targetId":"metamodelagenda","type":"AssociationRelationship","name":"definuje agendu","documentation":"Každá agenda je definována legislativním rámcem, tedy především zákony. Existuje tedy klíčová vazba mezi zákonem a agendou a naopak. Legislativní rámec je ohlášen také v RPP v rámci dané agendy."},{"id":"metamodelkomponentaismetamodelsluzbavs","sourceId":"metamodelkomponentais","targetId":"metamodelsluzbavs","type":"ServingRelationship","name":"poskytuje službu","documentation":""},{"id":"metamodelorganizacemetamodelvnitrnipredpis","sourceId":"metamodelorganizace","targetId":"metamodelvnitrnipredpis","type":"AccessRelationship","name":"vydává","documentation":""},{"id":"isvsmetamodelaplikacnirozhrani","sourceId":"isvs","targetId":"metamodelaplikacnirozhrani","type":"AssociationRelationship","name":"obsahuje součást","documentation":"Pokud chcete zakreslit vazbu rozhraní na systém, tedy, že systém obsahuje i rozhraní, je to trochu složitější. Neboť v tomto případě jiný systém nepřistupuje k rozhraní, ale naopak rozhraní je součástí logického celku systému, proto zde musíme využít prostou asociaci a účel vazby vyjádřit stereotypem vazby."},{"id":"metamodelkomponentaismetamodelaplikacnisluzba","sourceId":"metamodelkomponentais","targetId":"metamodelaplikacnisluzba","type":"ServingRelationship","name":"poskytuje službu","documentation":""},{"id":"metamodelbyzstrategiemetamodelbyzstratcil","sourceId":"metamodelbyzstrategie","targetId":"metamodelbyzstratcil","type":"RealizationRelationship","name":"definuje","documentation":"Z těchto základních strategických cílů pak mimo jiné vychází strategie rozvoje IT, kde se určí specifické cíle pro ICT. Realizované projekty vždy musejí naplňovat také strategické cíle či k nim přispívat."},{"id":"ovmmetamodelagenda","sourceId":"ovm","targetId":"metamodelagenda","type":"ServingRelationship","name":"ohlašuje agendu","documentation":"Každá agenda má svého ohlašovatele jako gestora za výkon a za údaje vedené v RPP. Ohlašovatel agendy má řadu povinností a ostatní mají povinnost vůči ohlašovateli vznášet reklamace nepravd v RPP. Ohlašovatel mimo jiné stanovuje i ISVS oprávněné k podpoře agendy a také matici sdílení údajů s ostatními agendami."},{"id":"metamodelramcovasluzbametamodelposkytovanasluzba","sourceId":"metamodelramcovasluzba","targetId":"metamodelposkytovanasluzba","type":"ServingRelationship","name":"slouží pro","documentation":"Díky definované rámcové službě mohou být na jejím základě poskytovány konkrétní služby. Třeba díky rámcové službě podepisování může být poskytována služba vytavení a odeslání rozhodnutí, apod."},{"id":"metamodelorganizacemetamodelbyzstrategie","sourceId":"metamodelorganizace","targetId":"metamodelbyzstrategie","type":"AssociationRelationship","name":"vydává","documentation":"Jde o Základní závazný vnitřní dokument organizace určující její obecné strategické směřování a podrobnosti k jejímu fungování a stanovující strategické cíle a jejich realizaci."},{"id":"metamodelprojektmetamodelprincip","sourceId":"metamodelprojekt","targetId":"metamodelprincip","type":"RealizationRelationship","name":"naplňuje","documentation":"Každý připravovaný a realizovaný projekt musí respektovat naše architektonické principy uvedené ve strategii a být s nimi v souladu. To se uvede i v obsahovém záměru a projektové dokumentaci. V případě výjimky se toto řádně odůvodní a postupuje se dle obvyklého procesu schvalování výjimky."},{"id":"metamodelzakonmetamodelrole","sourceId":"metamodelzakon","targetId":"metamodelrole","type":"AssociationRelationship","name":"definuje roli","documentation":""},{"id":"metamodelprocesmetamodelschopnost","sourceId":"metamodelproces","targetId":"metamodelschopnost","type":"RealizationRelationship","name":"je součástí schopnosti","documentation":""},{"id":"metamodelzakonmetamodelpovinnost","sourceId":"metamodelzakon","targetId":"metamodelpovinnost","type":"AggregationRelationship","name":"určuje povinnost","documentation":"Zákon nebo nějaký předpis obecně určuje povinnost jako byznysový základ pro nějaké fungování či činnost. Je také základní vazbou určení povinnosti v Mapě povinností. Platí, že každá povinnost by měla být určena nějakým předpisem."},{"id":"metamodelzakonmetamodelsluzbavs","sourceId":"metamodelzakon","targetId":"metamodelsluzbavs","type":"AssociationRelationship","name":"definuje službu","documentation":"Každá obecná služba má mít svůj zdroj, v případě služeb jež vykonává veřejná správa je to vždy zákon (pozor, nikoliv prováděcí vyhláška, ta jen definuje podrobnosti)"},{"id":"isvsmetamodeludaje","sourceId":"isvs","targetId":"metamodeludaje","type":"AccessRelationship","name":"je evidencí pro","documentation":""},{"id":"metamodelstakeholdermetamodelbyzstratcil","sourceId":"metamodelstakeholder","targetId":"metamodelbyzstratcil","type":"AssociationRelationship","name":"naplňuje","documentation":""},{"id":"ovmmetamodelrole","sourceId":"ovm","targetId":"metamodelrole","type":"AssignmentRelationship","name":"je v roli","documentation":"Organizace, kupříkladu OVM nebo jakýkoliv jiný subjekt je v určitých rolích. Role jsou definovány na obecné rovině legislativou, to se týká třeba stereotypu Role OVM nebo Role organizace. Podle příslušného zákona je pak organizace v takových rolích, což je jeden ze základů byznysové architektury nejen úřadu."},{"id":"metamodelvnitrnirolemetamodelkomponentais","sourceId":"metamodelvnitrnirole","targetId":"metamodelkomponentais","type":"AssociationRelationship","name":"užívá systém","documentation":""},{"id":"metamodelikovsmetamodelzasada","sourceId":"metamodelikovs","targetId":"metamodelzasada","type":"RealizationRelationship","name":"určuje princip","documentation":""},{"id":"metamodelplatformniswisvs","sourceId":"metamodelplatformnisw","targetId":"isvs","type":"ServingRelationship","name":"slouží pro","documentation":""},{"id":"metamodelvnitrnirolemetamodelvnitrnipredpis","sourceId":"metamodelvnitrnirole","targetId":"metamodelvnitrnipredpis","type":"AssociationRelationship","name":"zodpovídá za","documentation":""},{"id":"metamodelprojektmetamodelkrok","sourceId":"metamodelprojekt","targetId":"metamodelkrok","type":"AggregationRelationship","name":"zahrnuje","documentation":""},{"id":"metamodelitstrategiemetamodelprojekt","sourceId":"metamodelitstrategie","targetId":"metamodelprojekt","type":"AssociationRelationship","name":"má realizační projekt","documentation":""},{"id":"metamodelprogrammetamodelprojekt","sourceId":"metamodelprogram","targetId":"metamodelprojekt","type":"CompositionRelationship","name":"obsahuje","documentation":"Program je z ekonomického a řídícho hlediska nadřazenou skupinou projektů. Program pak obsahuje jednotlivé projekty, které jsou jeho součástí."},{"id":"metamodelikovsmetamodelprojekt","sourceId":"metamodelikovs","targetId":"metamodelprojekt","type":"AssociationRelationship","name":"má realizační projekt","documentation":""},{"id":"metamodelikovsmetamodelprincip","sourceId":"metamodelikovs","targetId":"metamodelprincip","type":"RealizationRelationship","name":"určuje princip","documentation":""},{"id":"metamodelrolemetamodelstakeholder","sourceId":"metamodelrole","targetId":"metamodelstakeholder","type":"AssignmentRelationship","name":"je","documentation":""},{"id":"metamodelrsmetamodelps","sourceId":"metamodelrs","targetId":"metamodelps","type":"ServingRelationship","name":"slouží pro","documentation":"Rámcová služba je službou, díky níž lze poskytovat konkrétnější podrobně definovanou službu."},{"id":"metamodelikovsovm","sourceId":"metamodelikovs","targetId":"ovm","type":"AssociationRelationship","name":"je závazným rámcem jímž se řídí","documentation":""},{"id":"metamodelorganizacemetamodelrole","sourceId":"metamodelorganizace","targetId":"metamodelrole","type":"AssignmentRelationship","name":"je v roli","documentation":""},{"id":"ovmisvs","sourceId":"ovm","targetId":"isvs","type":"ServingRelationship","name":"je správcem systému","documentation":""},{"id":"metamodelvnitrnirolemetamodelschopnost","sourceId":"metamodelvnitrnirole","targetId":"metamodelschopnost","type":"AssociationRelationship","name":"zodpovídá za","documentation":""},{"id":"metamodelstakeholdermetamodelprincip","sourceId":"metamodelstakeholder","targetId":"metamodelprincip","type":"AssociationRelationship","name":"naplňuje","documentation":""},{"id":"metamodelkomponentaismetamodelaplikacniproces","sourceId":"metamodelkomponentais","targetId":"metamodelaplikacniproces","type":"AssignmentRelationship","name":"slouží pro","documentation":""},{"id":"metamodelpostupmetamodelkrok","sourceId":"metamodelpostup","targetId":"metamodelkrok","type":"CompositionRelationship","name":"zahrnuje","documentation":""},{"id":"isvsovm","sourceId":"isvs","targetId":"ovm","type":"ServingRelationship","name":"je užíván subjektem","documentation":""}],"views":[]}