{"identifier":"me.big.tuwien.ac.at/EAModelSet/3586dd56-a7ec-496a-a1c0-4633ed13b319","archimateId":"3586dd56-a7ec-496a-a1c0-4633ed13b319","name":"ESDC Principles Catalog","documentation":"","availableFormats":["JSON","XML","ARCHIMATE","CSV"],"source":"GitHub","sourceFile":"raw-data/github/archimate/ESDC Principles Catalog.archimate","sourceFormat":"ARCHIMATE","timestamp":"25-06-2023 05:36:17","tags":[],"duplicates":[],"language":"","elements":[{"id":"id-e915f5cd24aa4a08843ae6624f70b21b","name":"GC Enterprise Architecture Framework - Business Architecture Guide","type":"Resource","layer":"strategy","documentation":"Business Architecture\r\n\r\nBusiness architecture is a critical aspect for the successful implementation of the GC Enterprise Ecosystem Target Architecture. The architectural strategy advocates whole‑of‑government approach where IT is aligned to business services and solutions are based on re‑useable components implementing business capabilities in order to deliver a cohesive user experience. As such, it is essential that business services, stakeholder needs, opportunities to improve cohesion and opportunities for reuse across government be clearly understood. In the past these elements have not been a priority. It is expected that the IT culture and practices will have to change to make business architecture, in general, and these elements a primary focus.\r\nDesign services digitally from end‑to‑end to meet the Government of Canada users and other stakeholders’ needs\r\nClearly identify internal and external users and other stakeholders and their needs for each policy, program and business service\r\nIn order to ensure that a service will be able to meet the users and stakeholders' needs, it needs to understand what needs it is trying to provide service for, who their users and stakeholders are, both internal and external.\r\nOnce the needs, the users and stakeholders are defined, then a service provider can proceed to create a stakeholder mapping to further understand the relationship between the service and the users & stakeholders, ie. how a change in one component impacts the other.\r\nFrom there, the service provider can conduct need analysis of its users and stakeholder to develop a program, a policy or a service that meets their needs (this practice may also be known as stakeholder requirements or value mapping).\r\nThis exercise can also help define the limitation/scope of the program/policy/service to better manage the expectation of their users/stakeholders.\r\n\r\n   How to demonstrate that the project fulfils this framework:\r\n    * summarize the needs and outcome of each key external and internal stakeholders in scope of the architecture\r\n    * demonstrate how the architecture is focused on the needs and outcomes of internal and external stakeholders\r\n   Tools:\r\n    * Business Case\r\n    * Stakeholder (Actors, Roles, Organizational Units) Mapping & Stakeholder requirements \r\n    * Outcomes\r\n    * Business Process Map\r\n    * Value Stream and Value Mapping\r\n\r\ninclude policy requirement applying to specific users and other stakeholder groups, such as accessibility, gender-based plus analysis, and official languages in the creation of the service\r\nTo ensure that a service can be used by all its users, it is important to note the specific requirements for specific users and to that extent, it is important to take note and apply the policy that governs the service standards when providing service to the specific user groups.\r\nThis will in turn enable the service to be far-reaching and more inclusive to all its users.\r\n\r\n   How to demonstrate that the project fulfils this framework:\r\n    * Outline what policies constrain the architecture\r\n    * Outline positive and negative impact the policy has on the architecture to meet the needs of the stakeholder\r\n    * Outline how architecture supports full spectrum of service design and user experience\r\n   Tools:\r\n    * User Interface Design Principles\r\n\r\nperform Algorithmic Impact Assessment (AIA) to support risk mitigation activities when deploying an automated decision system as per Directive on Automated Decision-Making\r\nWhen a service has an in-system developed automation for decision making, it is essential that the service perform AIA, to ensure that the result of this decision making is impartial and fair, and the impact of that decision would be the same as if the decision is made manually, only faster.\r\nThe use of this type of system must closely follow the Directive on Automated Decision-Making.\r\n\r\n   How to demonstrate that the project fulfils this framework:\r\n    * Provide the impact level based on the completion of the conceptual AIA\r\n    * Describe how the architecture will address the recommendations coming from the AIA\r\n    * Describe how the architecture meets the directive's requirements for the impact level\r\n   Tools:\r\n    * AIA Results (Conceptual)\r\n\r\nModel end-to-end business service delivery to provide quality, maximize effectiveness and optimize efficiencies across all channels (for example, lean process)\r\nWhen creating a service, make sure the service delivery is modeled end-to-end to make sure the intended end users can actually reap the benefit of the service being offered.\r\nGo through the business process map step-by-step to ensure all points/nodes within the process behaves expectedly resulting in an intended outcome.\r\nEnsure all points/nodes within the process is optimized.\r\nCreate all possible positive and negative scenarios that can possibly occur.\r\nThen go through different possible scenarios to ensure the service is still being delivered correctly, effectively and efficiently.\r\n   How to demonstrate that the project fulfils this framework:\r\n    * Summarize the delivery of value to customer across the architecture’s  business ecosystem  and the contribution of each stakeholder to the value\r\n   Tools:\r\n    * Business Process Map\r\n    * Business Impact Assessment\r\n    * Value Stream and Value Mapping\r\n\r\nArchitect to be outcome‑driven and strategically aligned to the department and to the Government of Canada\r\nidentify which departmental/GC business services, outcomes and strategies will be addressed\r\nTo ensure that the Government of Canada provide the best service to its citizen, the services provided needs to be cohesive, ie. the work conducted by each department needs to complement each other to avoid overlap and to ensure continuance of service from one department to another.\r\nIn order for a service to be meaningful, it needs to be tied into the driver of why the service is required and the outcome expected from a departmental mandate. The service can affect the mandate directly/indirectly, however, one needs to justify the needs of the service in relation to the actual mandate of the department.\r\n\r\n   How to demonstrate that the project fulfils this framework:\r\n    * Outline the GC/Departmental Strategies the architect aligns and/or implements\r\n    * Describe the architecture's contribution to realizing the appropriate outcomes of the strategy\r\n   Artifacts:\r\n    * Drivers\r\n    * Outcomes (intimidate and ultimate)\r\n    * Business services (External)\r\n\r\nestablish metrics for identified business outcomes throughout the life cycle of an investment\r\nOnce we know which outcome that a service is tied into, and whether or not it is directly affecting the outcome expected, we need to be able to justify the effort required to build the service vs. the outcome exerted by the service.\r\nWe need a way to quantify the impact of this service / establish a metrics for this service.\r\nThis is an important step to ensure that we can prioritize the effort correctly to identify and build the right service that is of high priority with the budget assigned.\r\n   How to demonstrate that the project fulfils this framework:\r\n    * What are the metrics used to ensure that the outcomes are being realized\r\n    * What data is required for the metrics and identify how any gaps in the data will be addressed.\r\n   Tools:\r\n    * Value Stream (Measure KPI linked to benefits outcomes and objectives)\r\n\r\ntranslate business outcomes and strategy into business capability implications in the GC Business Capability Model to establish a common vocabulary between business, development, and operation\r\nOnce we understood the outcomes and strategy to achieve the outcome, we need to translate it into business capability implications. Historically, the Business Capability Model is a common vocabulary between business, development and operation.\r\nWhen the plan conveyed is understood by the development and operation, it would be easier to obtain the system required.\r\nHaving an open communication between the various teams also helps in getting the right solution that closely match the business requirement.\r\n   How to demonstrate that the project fulfils this framework:\r\n    * Outline the business capabilities involved in achieving each outcome\r\n   Tools:\r\n    * Business Impact Assessment\r\n    * Departmental BCM\r\n    * GC BCM (mapping to D BCM)\r\n    * Value Stream\r\nPromote horizontal enablement of the enterprise\r\nidentify opportunities to enable business services horizontally across the GC enterprise and to provide cohesive experience to users and other stakeholders\r\nIn creating any service, we always need to go back to think about the users/stakeholders. Put ourselves in the users'/stakeholders' shoes. If we are at the receiving end of the service, what kind of experience do we get when we are trying to get the service. Does the user need to know where to get related services, or can we provide them with a seamless service, a cohesive service ? How do we provide a good experience to the users / stakeholders ?\r\nWe need to start thinking more of an enterprise level, starting at the departmental level first. How can we enable this service across the department ? Is there any opportunity to reuse what we have in other areas of the department ? What do we need to do to leverage this process ?\r\nWe need to plug in to community of practices, network of expertise or other working groups in order to exchange information, understand the various obstacles experienced by others, get lessons learned from others' experiences, share lessons learned, learn from others how they overcome similar obstacles in their work, share your solutions to others.\r\n   How to demonstrate that the project fulfils this framework:\r\n    * Summarize the departmental / GC opportunities where the architecture could be reused\r\n    * Summarize departmental/GC architectures that impact or influence the ability of the user having a cohesive experience\r\n       (what are the plans to ensure user has a cohesive experience across these architectures and the ecosystem)\r\n   Tools:\r\n    * Business Capability\r\n    * Departmental Value Stream model\r\n    * Projects to Value Stream Script\r\n\r\nreuse common business capabilities, processes and enterprise solutions from across government and private sector\r\nIf there is a business capabilities, processes or enterprise solution that can be utilized in creating the service, eg. perhaps during the exchange of information from working groups, community of practices, workshops or even from working with private sectors, that are proven to work, we should consider using it prior to inventing our own.\r\nThis will optimize the time required to build the approach or the solution. Rather than having to proof the concept or solution actually works, use the ones that have a proven record.\r\n   How to demonstrate that the project fulfils this framework:\r\n    * Describe the plan and approach to standardize the realization of the business capability so it can be reused within the department and GC\r\n   Tools:\r\n    * Projects to value Stream Script\r\n    * Business Capability Heat map\r\n\r\npublish in the open all reusable common business capabilities, processes and enterprise solutions for others to develop and leverage cohesive horizontal enterprise services\r\nGoing back to the previous point on thinking at an enterprise level, one of the ways to enable a service that we build across the GC is by having it published in the open for other departments to see and re-use. Then and only we can create a cohesive horizontal enterprise services to create a cohesive experience to the users / stakeholders.\r\n   How to demonstrate that the project fulfils this framework:\r\n    * Outline the plan to allow other public sector organizations to reuse the common capability\r\n   Tools:\r\n    * Business Capability Heat Map\r\n    * Projects to Value Stream Script"},{"id":"id-2ccab90e065740b28b0bd1da735d097e","name":"GC Enterprise Architecture Framework - Information Architecture Guide","type":"Resource","layer":"strategy","documentation":"Information Architecture\r\n\r\nInformation architecture includes both structured and unstructured data. The best practices and principles aim to support the needs of a business service and business capability orientation. To facilitate effective sharing of data and information across government, information architectures should be designed to reflect a consistent approach to data, such as the adoption of federal and international standards. Information architecture should also reflect responsible data management, information management and governance practices, including the source, quality, interoperability, and associated legal and policy obligations related to the data assets. Information architectures should also distinguish between personal and non‑personal data and information as the collection, use, sharing (disclosure), and management of personal information must respect the requirements of the Privacy Act and its related policies.\r\n\r\nCollect data to address the needs of the users and other stakeholders\r\nassess data requirements‑based program objectives, as well users, business and stakeholder needs\r\n  How to achieve:\r\n    * Summarize how the architecture meets the data needs of the users and other key stakeholders including:\r\n        * How does the data asset contribute to outcomes/needs of the user and other stakeholders\r\n        * Gaps in the existing data assets to meet the needs of the users and other stakeholders and how the architecture addresses these gaps\r\n        * Gaps in data collection and analysis  and how the architecture is addressing it so that department can ensure that we are serving the members of our society \r\n        * Alignment to the data foundation of the departmental information/data architecture practice\r\n        * Alignment to the theoretical foundation of the departmental information/data architecture practice\r\n   Tools:\r\n    * For Data Foundation – Implement:\r\n         * Data Catalogue\r\n         * Benefits Knowledge hub\r\n         * Data Lake (growth)\r\n         * Data Science and Machine Platform\r\n    * Stakeholder Requirements\r\n    * Solution Requirements\r\ncollect only the minimum set of data needed to support a policy, program, or service\r\n   How to achieve:\r\n    * Summarize how the architecture aligns to “collect with a purpose”  including:\r\n         * What is necessary (as opposed to what is sufficient) to meet the stakeholder need\r\n         * Supporting Performance Information Profiles (PIPs) used to assess a progress towards target and broader objectives\r\n  Tools:\r\n    * Value Stream (Value Item and Value Proposition – Context on What we measure)\r\n    * KPI  Linked to benefits outcomes and objectives\r\nreuse existing data assets where permissible and only acquire new data if required\r\n   How to achieve:\r\n    * Summarize  reusability of the architecture’s  data assets given:\r\n        * Context of data assets and user and stakeholder needs\r\n        * Data quality and fit for purpose\r\n        * Privacy and Security  Regulatory Framework\r\n   Tools: \r\n    * Legislative / Regulations\r\nensure data collected, including from third-party sources, are of high quality\r\n   How to achieve:\r\n    * Summarize how the architecture meets the data quality requirements of third-party sources:\r\n        * Data quality meets  fit for purpose\r\n        * Data quality dimensions including:\r\n             * Relevance,\r\n             * Timeliness\r\n             * Consistency,\r\n             * Reliability,\r\n             * Interpretability,\r\n             * Usability\r\n        * Data quality mechanism \r\n   Tools: \r\n    * Data Foundation – Implement (Leverage the  standard definition)\r\n       * Data Catalogue\r\n       * Benefits Knowledge hub\r\n       * Data Lake (growth)\r\n       * Data Science and Machine Platform\r\nManage and reuse data strategically and responsibly\r\ndefine and establish clear roles, responsibilities, and accountabilities for data management\r\n  How to achieve:\r\n    * Summarize how the architecture assists in  defining  key data management roles  and their responsibilities to ensure data is correct, consistent, and complete including:\r\n       * Identifies the data steward responsibilities;\r\n       * Identifies the data consumer responsibilities, and;\r\n       * Identifies the data custodian responsibilities.\r\n   Tools: \r\n    * Stakeholders\r\n    * Business Process Model\r\n    * Functional Requirements\r\n    * Business Glossary\r\nidentify and document the lineage of data assets\r\n  How to achieve:\r\n   * Summarize how the architecture’s data assets demonstrate alignment with department's data governance and strategy including:\r\n       * Alignment to the data foundation of the ESDC information/data architecture practice\r\n       * Alignment to the theoretical foundation of the ESDC information/data architecture practice\r\n  Tools:\r\n   * Target state (solution data elements)\r\n   * Data Foundation – Implement (Leverage the  standard definition)\r\n      * Data Catalogue\r\n      * Benefits Knowledge hub\r\n      * Data Lake (growth)\r\n      * Data Science and Machine Platform\r\n   * Theoretical Foundation\r\n      * EDRM (Conceptual and Logical)\r\n      * Business Glossary\r\n      * Departmental Data Strategy\r\ndefine retention and disposition schedules in accordance with business value as well as applicable privacy and security policy and legislation\r\n  How to achieve:\r\n   * Summarize  for each key data assets:\r\n      * Retention and disposition schedules\r\n      * Disposition process \r\n  Tools:\r\n   * Target state (solution data elements)\r\n   * Non Functional Requirements\r\n   * IM Best Practices and Standards\r\nensure data are managed to enable interoperability, reuse and sharing to the greatest extent possible within and across departments in government to avoid duplication and maximize utility, while respecting security and privacy requirements\r\n  How to achieve:\r\n   * Summarize how the architecture enables interoperability, reuse and sharing to the greatest extent possible within and across departments\r\n   * Summarize how the architecture avoids data duplication \r\n  Tools:\r\n   * Target State\r\n   * Data Foundation – Implement (Leverage the  standard definition)\r\n       * Data Catalogue\r\n       * Benefits Knowledge hub\r\n       * Data Lake (growth)\r\ncontribute to and align with enterprise and international data taxonomy and classification structures to manage, store, search and retrieve data\r\n  How to achieve:\r\n   * Summarize the  alignment to departmental/GC:\r\n      * Data taxonomy structure\r\n      * Data classification structure\r\n  Tools:\r\n   * Data Foundation – Implement (Leverage the  standard definition)\r\n       * Data Catalogue\r\n   * Theoretical Foundation\r\n       * EDRM (Conceptual and Logical)\r\n       * Business Glossary\r\nUse and share data openly in an ethical and secure manner\r\nshare data openly by default as per the Directive on Open Government and Digital Standards, while respecting security and privacy requirements; data shared should adhere to existing enterprise and international standards, including on data quality and ethics\r\n  How to achieve:\r\n   * Summarize how the architecture supports sharing data openly by default as per Directive on Open Government and Digital Standards given:\r\n       * Existing departmental and GC data standards and policies\r\n       * International data standards;  and the Privacy Act, \r\n       * Fitness for purpose\r\n       * Ethics \r\n  Tools:\r\n   * Data Foundation – Implement (Leverage the  standard definition)\r\n       * Data Catalogue\r\n       * Benefits Knowledge Hub\r\n       * Data Lake (growth)\r\n       * Data Science and Machine Platform\r\n   * Theoretical Foundation\r\n       * EDRM (Conceptual and Logical)\r\n       * Business Glossary\r\n       * Departmental Data Strategy\r\nensure data formatting aligns to existing enterprise and international standards on interoperability; where none exist, develop data standards in the open with key subject matter experts\r\n  How to achieve:\r\n   * Summarize how the architecture  utilises existing enterprise and international data standards\r\n   * Summarize how the architecture has developed any data standards through open collaboration with key subject matter experts and the Enterprise Data Community of Practice.\r\n  Tools:\r\n   * Data Standards\r\n       * NIEM\r\n       * OpenData \r\n       * National Address Register\r\n       * Reference Data Repository\r\nensure that combined data does not risk identification or re‑identification of sensitive or personal information\r\n  How to achieve:\r\n   * Summarize how the architecture ensures the aggregation and combing of data does not pose a risk to  information  sensitivity or personal information \r\n\r\nDesign with privacy in mind for the collection, use and management of personal Information\r\nensure alignment with guidance from appropriate institutional ATIP Office with respect to interpretation and application of the Privacy Act and related policy instruments\r\n  How to achieve:\r\n   * Describe how the architecture aligns to guidance of the ATIP Office around  personal information  regulatory  framework; policy framework; and consent directives\r\nassess initiatives to determine if personal information will be collected, used, disclosed, retained, shared, and disposed\r\n  How to achieve:\r\n   * Has the initiative assessed  if personal information will be collected, used, disclosed, retained, shared, and disposed\r\nonly collect personal information if it directly relates to the operation of the programs or activities\r\n  How to achieve:\r\n   * Summarize how the architecture ensures  the  personal information collected is directly required to the operational of the programs or activities\r\nnotify individuals of the purpose for collection at the point of collection by including a privacy notice\r\n  How to achieve:\r\n   * Does the solution’s privacy notice provide the purpose for collecting this personal information\r\n   * Does the solution provide a privacy notice at the point of personal information collection \r\npersonal information should be, wherever possible, collected directly from individuals but can be from other sources where permitted by the Privacy Act\r\n  How to achieve:\r\n   * Does the architecture collect personal information directly from the individual\r\n   * If no, what personal information is collect form other sources  and does it comply with the Privacy Act and the consent directive of the source \r\n  Tools:\r\n   * Target State Architecture\r\n   * Interim State Architecture\r\npersonal information must be available to facilitate Canadians’ right of access to and correction of government records\r\n  How to achieve:\r\n   * Summarize how the architecture facilitates Canadian's right to access their personal information records\r\n   * Summarize how the architecture facilitates Canadian's right to correct their personal information records\r\n  Tools:\r\n   * Target State Architecture\r\n   * Interim State Architecture\r\ndesign access controls into all processes and across all architectural layers from the earliest stages of design to limit the use and disclosure of personal information\r\n  How to achieve:\r\n   * Summarize how the architecture limits the use and disclosure of personal information in accordance to the privacy legislative; policy frameworks and consent directives\r\ndesign processes so personal information remains accurate, up‑to‑date and as complete as possible, and can be corrected if required\r\n  How to achieve:\r\n   * Summarize how the  architecture ensures personal information remains accurate\r\n   * Summarize how the architecture ensures personal information remains up-to-date\r\n   * Summarize how the architecture ensures personal information remains complete as possible\r\n   * Summarize how the architecture ensures personal information can be corrected if required\r\n  Tools:\r\n   * Non Functional Requirements\r\n   * FUnctional Requirements\r\nde‑identification techniques should be considered prior to sharing personal information\r\n  How to achieve:\r\n   * Outline the de-identification techniques used by the architecture in sharing personal information\r\nin collaboration with appropriate institutional ATIP Office, determine if a Privacy Impact Assessment (PIA) is required to identify and mitigate privacy risks for new or substantially modified programs that impact the privacy of individuals\r\n  How to achieve:\r\n   * Describe how the architecture addresses the recommendations of the PIA\r\n   * If not all recommendations of the PIA are being addressed,  outline how the business will address any residual risks of the PIA\r\n\r\nestablish procedures to identify and address privacy breaches so they can be reported quickly and responded to efficiently to appropriate institutional ATIP Office\r\n  How to achieve:\r\n   * Are procedures established to identify and address privacy breaches\r\n   * Summarize how the architecture enables/supports these procedures\r\n  Tools:\r\n   * Business Process Model"},{"id":"id-0f0d3bc67555416c95f7ca0591a213fc","name":"GC Enterprise Architecture Framework - Application Architecture Guide","type":"Resource","layer":"strategy","documentation":"Application architecture\r\nApplication architecture practices must evolve significantly for the successful implementation of the GC Enterprise Ecosystem Target Architecture. Transitioning from legacy systems based on monolithic architectures to architectures that oriented around business services and based on re‑useable components implementing business capabilities, is a major shift. Interoperability becomes a key element, and the number of stakeholders that must be considered increases.\r\n\r\nUse open source solutions hosted in public cloud\r\nselect existing solutions that can be reused over custom built\r\n   How to achieve:\r\n    * Summarize how the architecture  leverages and reuses existing solutions, components, and processes including:\r\n       * Existing processes being reused or leveraged;\r\n       * Existing solutions  being reused or leverage, and;\r\n       * Existing components being reused or leveraged.\r\n   Tools:\r\n       * Target State Architecture\r\n       * Interim State Architecture\r\n       * EA Assessment \r\n\r\ncontribute all improvements back to the communities\r\n   How to achieve:\r\n    * Summarize how the team will align to the TBS Guidance on Open Source Publishing to support the production of better solutions\r\n    * Summarize how the team will leverage/has leverage the Open Source community\r\n   Tools:\r\n       * Target State Architecture\r\n       * Interim State Architecture\r\nregister open source software to the Open Resource Exchange\r\n   How to achieve:\r\n    * Summarize how the architecture will leverage the Open Resource Exchange.\r\n    * Summarize how the architecture will utilize APIs to support Open Data feeds\r\n   Tools:\r\n       * Target State Architecture\r\n       * Interim State Architecture\r\nUse software as a service (SaaS) hosted in public cloud\r\nchoose SaaS that best fit for purpose based on alignment with SaaS capabilities\r\n   How to achieve:\r\n    * Summarize how the recommended SaaS is the best fit for purpose based on alignment with SaaS capabilities of  SaaS provider and Dept/SSC\r\n   Tools:\r\n       * Option analysis\r\nchoose a SaaS solution that is extendable\r\n   How to achieve:\r\n    * Summarize how the recommended SaaS is extendable\r\n   Tools:\r\n       * Option analysis\r\n       * EA Assessment\r\nconfigure SaaS and if customization is necessary extend as open source modules\r\n   How to achieve:\r\n    * Summarize how the recommended SaaS can be customized through Open Source modules.\r\n\r\n   Tools:\r\n       * Option analysis\r\n       * EA Assessment\r\nDesign for Interoperability\r\ndesign systems as highly modular and loosely coupled services\r\n   How to achieve:\r\n    * Summarize how the architecture supports the implementation through:\r\n       * Simple independent functions\r\n       * Highly modular\r\n       * Loosely coupled\r\n       * Deployed into a container that has just a single application with  the ability to build the smallest image \r\n   Tools:\r\n       * Target State Architecture\r\n       * Interim State Architecture\r\nexpose services, including existing ones, through APIs\r\n   How to achieve:\r\n    * Summarize how the architecture exposes functionality as services and these services are accessible through common methodologies\r\n    * Summarize how the architectures aligns to the Government of Canada Standards on APIs\r\n   Tools:\r\n       * Target State Architecture\r\n       * Interim State Architecture\r\nmake the APIs discoverable to the appropriate stakeholders\r\n   How to achieve:\r\n    * Summarize which APIs will be published to the ESDC API  store\r\n    * Summarize which APIs will be published to the   GC API store \r\n    * Summarize the rational for not publishing APIs to an API store\r\n   Tools:\r\n       * Target State Architecture\r\n       * Interim State Architecture\r\nDesign for Interoperability, Proposed amendment Jan 8, 2021\r\ndesign systems as highly modular and loosely coupled services\r\n   How to achieve:\r\n    * \r\nmake all services available through a well-defined interface, such as an application programming interface (API)\r\n   How to achieve:\r\n    * \r\nall APIs with potential for cross-departmental, inter-jurisdictional, or public consumption must be published to the GC API Store\r\n   How to achieve:\r\n    * \r\nuse the Canadian Digital Exchange Platform (CDXP) for data exchange where suitable (e.g., GC Event Broker for asynchronous messaging)"},{"id":"id-cac3da86e3cc4be4852680c6b80bc6d5","name":"GC Enterprise Architecture Framework - Technology Architecture Guide","type":"Resource","layer":"strategy","documentation":"Technology architecture\r\nTechnology architecture is an important enabler of highly available and adaptable solutions that must be aligned with the chosen application architecture. Cloud adoption provides many potential advantages by mitigating the logistical constraints that often negatively impacted legacy solutions hosted “on premises.” However, the application architecture must be able to enable these advantages.\r\n\r\nUse cloud first\r\nadopt the use of the GC Accelerators to ensure proper security and access controls\r\n   How to achieve:\r\n    * Summarize which cloud usage profile  does the architecture align to and why\r\n    * Summarize which cloud connection pattern does the architecture align to and why\r\n   Tools:\r\n    * Cloud Reference Architecture\r\n    * Cloud Assessment Framework\r\n    * Summary of Cloud Access Scenarios and Usage Profiles\r\n\r\nenforce this order of preference: software as a service (SaaS) first, then platform as a service (PaaS), and lastly infrastructure as a service (IaaS)\r\n   How to achieve:\r\n    * Summarize how the architecture, based on the TBS Right Cloud Assessment Tool, allows for cloud service model of how:\r\n       * The architecture can be implemented using a GC SaaS environment, which has been identified as a possible fit, or\r\n       * The architecture can be implemented using a Public SaaS environment, which has been identified as a possible fit, or\r\n       * The architecture can be implemented using a GC PaaS environment, which has been identified as a possible fit, or:\r\n       * The architecture can be implemented using Public PaaS environment, which  has been identified as a possible fit.\r\n   Tools:\r\n    * Cloud Reference Architecture\r\n    * Cloud Assessment Framework\r\n\r\nfulfill cloud services through SSC Cloud‑Brokering Services\r\n   How to achieve:\r\n    * Confirm the Team is acquiring cloud services through SSC Cloud Brokering Services. Please include the SSC Request number\r\n   Tools:\r\n    * Contact Cloud COE\r\n\r\nenforce this order of preference: public cloud first, then hybrid cloud, then private cloud, and lastly non‑cloud (on‑premises) solutions\r\n   How to achieve:\r\n    * Summarize how the architecture, based on the TBS Right Cloud Assessment Tool, allows for public cloud, including:\r\n       * The data, being managed by the architecture, is PBMM or lower, and stakeholders have not raised concerns about deployment to the public cloud.\r\n       * A costing model / budget that is available to support an Operational Expense Model. The costs will rise and fall with the consumption of resources.\r\n       * The implementation of application(s), which can operate in a cloud environment and any required virtualized or dedicated hardware, is available in a cloud environment.\r\n       * The implementation of application(s) which can operate on the standardized offerings and SLAs of public cloud.\r\n       * The implementation of applications are not susceptible to latency issues, which may arise due to traffic moving through an additional circuit.\r\n       * The implementation of applications, which do not have voluminous transactions with an on-premises database or application.\r\n   Tools:\r\n    * Cloud Reference Architecture\r\n    * Cloud Assessment Framework\r\n\r\ndesign for cloud mobility and develop an exit strategy to avoid vendor lock‑in\r\n   How to achieve:\r\n    * Summary  how the architecture allows for the execution of an exit strategy to off-board from that vendor\r\n   Tools:\r\n    * Solution Architecture\r\n    * Refer YDG GC EARB \r\n\r\nDesign for performance, availability and scalability\r\nensure response times meet user needs, and critical services are highly available\r\n   How to achieve:\r\n    * Summarize how the architecture is able to meet the user response time requirements, and achieve the user response time objectives, including:\r\n       * The ability to trace how the response time requirements and objectives will be met.\r\n       * The capacity requirements (e.g. expected normal traffic, peak traffic, expected traffic grow, etc.) that the architecture needs to meet.\r\n       * The ability to trace how the availability requirements and objectives will be met.\r\n   Tools:\r\n    * non-functional requirements\r\n\r\nsupport zero‑downtime deployments for planned and unplanned maintenance\r\n   How to achieve:\r\n    * Summarize how the architecture is able to support zero-downtime deployments for planned and unplanned maintenance, including:\r\n       * The planned Windows maintenance for the solution to support backups and length of Windows maintenance.\r\n       * The procedure for planning, scheduling and executing the planned downtime.\r\n       * The ability to be deployed in a manner that minimizes or limits service disruption, and which is known as zero downtime deployments.\r\n       * The acceptable measures for unplanned downtime.\r\n   Tools:\r\n    * non-functional requirements\r\n\r\nuse distributed architectures, assume failure will happen, handle errors gracefully, and monitor performance and behaviour actively\r\n   How to achieve:\r\n    * Summarize how the architecture utilizes distributed architectures, which assume that a failure will happen, handle errors gracefully and monitor actively, including:\r\n        * The ability to trace how the recoverability requirements and objectives will be met; and,\r\n        * The ability to be deployed in a distributed environment.\r\n   Tools:\r\n    * non-functional requirements\r\n\r\nestablish architectures that supports new technology insertion with minimal disruption to existing programs and services\r\n   How to achieve:\r\n    * Summarize how the architecture allows the insertion of new technology  with minimal disruption \r\n   Tools:\r\n    * non-functional requirements\r\n\r\ncontrol technical diversity; design systems based on modern technologies and platforms already in use\r\n   How to achieve:\r\n    * Summarize the technology standards’  state (emerging, baseline, containment or retirement) of the products  required/recommended  to implement the architecture.  For those products in the containment or retired state please provide rational for selecting those products\r\n    * Identify new technology standards required by the architecture\r\n   Tools:\r\n    * non-functional requirements\r\n\r\nFollow DevSecOps principles\r\nuse continuous integration and continuous deployments\r\n   How to achieve:\r\n    * Summarize how the architecture can be deployed following a continuous integration approach\r\n    * Summarize how the architecture can be deployed following a continuous deployment approach.\r\n   Tools:\r\n    * CICP mesh\r\n\r\nensure automated testing occurs for security and functionality\r\n   How to achieve:\r\n    * Summarize the automated security and functionality testing that will be/has been executed on the solution. \r\n\r\ninclude your users and other stakeholders as part of the DevSecOps process, which refers to the concept of making software security a core part of the overall software delivery process\r\n   How to achieve:\r\n    * Summarize the role and responsibilities  users and other stakeholders have in DevSecOps processes. \r\n   Tools:\r\n    * Project Charter"},{"id":"id-b7f46e95259842168e25e4d39b07f811","name":"GC Enterprise Architecture Framework - Security Architecture Guide","type":"Resource","layer":"strategy","documentation":"Security architecture\r\nThe GC Enterprise Security Architecture program is a government‑wide initiative to provide a standardized approach to developing IT security architecture, ensuring that basic security blocks are implemented across the enterprise as the infrastructure is being renewed.\r\n\r\nBuild security into the system life cycle across all architectural layers\r\nidentify and categorize information based on the degree of injury that could be expected to result from a compromise of its confidentiality, integrity and availability\r\nHow to achieve:\r\nSummarize how the architecture ensures the confidentiality of the information based on its categorization and degree of injury\r\nSummarize how the architecture ensures the integrity of the information based on its categorization and degree of injury\r\nSummarize how the architecture ensures the availability of the information based on its categorization and degree of injury\r\n\r\nimplement a continuous security approach, in alignment with Centre for Cyber Security’s IT Security Risk Management Framework; perform threat modelling to minimize the attack surface by limiting services exposed and information exchanged to the minimum necessary\r\nHow to achieve:\r\nSummarize how the architecture aligns with the Centre of Cyber Security’s IT Security Risk Management Framework\r\n\r\napply proportionate security measures that address business and user needs while adequately protecting data at rest and data in transit\r\nHow to achieve:\r\nDescribe the security measures that protect the data at rest while meeting business and users needs\r\nDescribe the security measures that protect the data in transit while meeting business and users needs\r\ndesign systems to be resilient and available in order to support service continuity\r\nHow to achieve:\r\nOutline the architecture’s resilient characteristics support service continuity objectives\r\nOutline the architecture’s availability characteristics support service continuity objectives\r\nTools:\r\nNon-functional Requirements\r\nEnsure secure access to systems and services\r\nidentify and authenticate individuals, processes or devices to an appropriate level of assurance, based on clearly defined roles, before granting access to information and services; leverage enterprise services such as Government of Canada trusted digital identity solutions that are supported by the Pan‑Canadian Trust Framework \r\nHow to achieve:\r\nSummarize how the architectures identifies and authenticates:\r\nIndividuals\r\nProcesses\r\nDevices\r\nSummarize the enterprise security services leverage by the architecture\r\nSummarize how the architecture aligns to the Pan-Canadian Trust Framework\r\nTools:\r\nTarget State Architecture\r\nInterim State Architecture\r\nconstrain service interfaces to authorized entities (users and devices), with clearly defined roles; segment and separate information based on sensitivity of information, in alignment with ITSG‑22 and ITSG‑38. Management interfaces may require increased levels of protection\r\nHow to achieve:\r\nSummarize how the architecture constrains service interfaces to authorized entities in compliance to:\r\nITSG-22, and;\r\nITSG-38.\r\nimplement HTTPS for secure web connections and Domain-based Message Authentication, Reporting and Conformance (DMARC) for enhanced email security\r\nHow to achieve:\r\nDoes the architecture use HTTPS for secure web connections\r\nDoes the architecture use and Domain-based Message Authentication, Reporting and Conformance (DMARC) for enhanced email security\r\n\r\nestablish secure interconnections between systems through secure APIs or leveraging centrally managed hybrid IT connectivity services\r\nHow to achieve:\r\nOutline what (APIs or centrally managed hybrid IT connectivity services )the architectures established secure interconnections between systems\r\nTools:\r\nTarget State Architecture\r\nInterim State Architecture\r\nMaintain secure operations\r\nestablish processes to maintain visibility of assets and ensure the prompt application of security‑related patches and updates in order to reduce exposure to vulnerabilities, in accordance with GC Patch Management Guidance\r\nHow to achieve:\r\nHave processes been established to ensure the prompt application of security related patches and updates?\r\nSummarize how the architecture supports these processes\r\n\r\nenable event logging, in accordance with GC Event Logging Guidance, and perform monitoring of systems and services in order to detect, prevent, and respond to attacks\r\nHow to achieve:\r\nSummarize how event logging within the architecture aligns to GC Event Logging Guidance in the areas of:\r\nAttack detection\r\nAttack prevention\r\nAttack respond\r\nestablish an incident management plan in alignment with the GC Cyber Security Event Management Plan (GC CSEMP) and report incidents to the Canadian Centre for Cyber Security\r\nHow to achieve:\r\nDescribe how incident management plan aligns to GC Cyber Security Event Management\r\nDescribe how incidents are reported to the Canadian Centre for Cyber Security (CCSB)"},{"id":"id-95f0896e98f34df6b11d65b8928d157c","name":"Enterprise Plans","type":"CourseOfAction","layer":"strategy","documentation":"Appendix B: Development of EA Principles\r\n\r\nThe development of architecture principles is typically influenced by the following :\r\n•\tEnterprise mission and plans: The mission, plans, and organizational infrastructure of the enterprise."},{"id":"id-88d8dd71dfde4c9bbbb5b2541c02b625","name":"Enterprise Strategic Initiatives","type":"CourseOfAction","layer":"strategy","documentation":"Appendix B: Development of EA Principles\r\nThe development of architecture principles is typically influenced by the following :\r\n•\tEnterprise strategic initiatives: The characteristics of the enterprise; its strengths, weaknesses, opportunities, threats, and its current enterprise-wide initiatives (such as process improvement and quality management). \r\n"},{"id":"8e4291ac-c9db-4b22-b510-ed9444955f13","name":"Architecture Standards","type":"BusinessObject","layer":"business","documentation":""},{"id":"id-23f28335374f49208cf1a2fa3299b78a","name":"BDM Architecture Playbook","type":"BusinessObject","layer":"business","documentation":"BDM Architecture Guidance and Standards Playbook - v0.3.pptx\r\nhttps://014gc.sharepoint.com/sites/BDMArchitectureTouchpoint-StaffandConsultants/Shared%20Documents/General/04%20-%20Architectural%20Governance%20and%20Enabling%20Services/BDM%20Architecture%20Playbook/BDM%20Architecture%20Guidance%20and%20Standards%20Playbook%20-%20v0.3.pptx"},{"id":"id-188e3622221947c092815ed926d19826","name":"Business Architecture","type":"BusinessRole","layer":"business","documentation":""},{"id":"id-c45b8163560b4bcc9acbe0968e5ce4cb","name":"Technology Architecture","type":"BusinessRole","layer":"business","documentation":""},{"id":"id-45ea0f3890e04c2398d3eee18e53aba6","name":"Security Architecture","type":"BusinessRole","layer":"business","documentation":""},{"id":"id-763269bca5ac49e28ac0293f553e4ae9","name":"Data Architecture","type":"BusinessRole","layer":"business","documentation":""},{"id":"id-7e5571c0735943e8968c58563b5f52ed","name":"Enterprise Architecture","type":"BusinessRole","layer":"business","documentation":""},{"id":"id-1ef66617b47244399aa8ba2505327641","name":"Chief Architect","type":"BusinessActor","layer":"business","documentation":""},{"id":"id-13b1ac42338649c4b5468d6b6d2c5699","name":"Application Architecture","type":"BusinessRole","layer":"business","documentation":""},{"id":"id-9222444fa604417f99a6e4c9c111ecdb","name":"Development of EA Principles","type":"BusinessFunction","layer":"business","documentation":"Appendix B: Development of EA Principles\r\n\r\nThe development of architecture principles is typically influenced by the following :\r\n•\tEnterprise mission and plans: The mission, plans, and organizational infrastructure of the enterprise. \r\n•\tEnterprise strategic initiatives: The characteristics of the enterprise; its strengths, weaknesses, opportunities, threats, and its current enterprise-wide initiatives (such as process improvement and quality management). \r\n•\tExternal constraints: Market factors (time-to-market imperatives, customer expectations, etc.); existing and potential legislation. \r\n•\tCurrent systems and technology: The set of information resources deployed within the enterprise, including systems documentation, equipment inventories, network configuration diagrams, policies, and procedures. \r\n•\tEmerging industry trends: Predictions about economic, political, technical, and market factors that influence the enterprise environment. \r\n\r\nThe EA Principles are developed by following a systematic process to create, socialize, approve and communicate them to ensure that they will have the desired effect. This process involves the following five key steps :\r\n\r\n\tStep 1- Identification of the EA Principles: The EA Principles identified in this document were mostly derived from previous EA Principle documents. The following main sources were consulted and leveraged: \r\n•\tThe Open Group Architecture Framework (TOGAF) defined Architecture Principles;\r\n•\tCanada Border Services Agency (CBSA) defined Architecture Principles;\r\n•\tTreasury Board defined Architecture Principles;\r\n•\t(Draft) DFO-MPO Enterprise Architecture Principles;\r\n•\tCorrectional Service Canada (CSC) defined Architecture Principles.\r\n\r\n\tStep 2- Definition of the EA Principles: Once identified, the principles are further defined along the following five criteria and properly documented to fit ESDC’s business needs. EA Principles should be few in number and future-oriented.\r\n•\tUnderstandable: The intention of the principle is clear and unambiguous so that it can be quickly grasped and understood by individuals throughout the organization.\r\n•\tRobust: The principle will enable good quality decisions about architectures and plans to be made and enforceable policies and standards to be created. Each principle should be sufficiently definitive and precise to support consistent decision-making in complex, potentially controversial situations.\r\n•\tComplete: Every potentially important principle governing the management of information and technology for the organization is defined. The principles cover every situation perceived.\r\n•\tConsistent: Strict adherence to one principle may require a loose interpretation of another principle. The set of principles must be expressed in a way that allows a balance of interpretations. \r\n•\tStable: Principles should be enduring, yet able to accommodate change. An amendment process should be established for adding, removing, or altering principles after they are initially ratified.\r\n\r\n\tStep 3 – Revision of EA Principles: Architects within EA/IM Directorate are initially engaged to review and revise the proposed EA Principles. Following that initial revision, some additional key stakeholders could also be engaged in the revision as required. \r\n\r\n\tStep 4 – Governance and Communication: Once the revision is completed and the EA Principles are agreed upon, they will be governed, endorsed and communicated within ESDC. Senior management will then champion the EA Principles. \r\n\r\n\tStep 5 – Leveraging the EA principles: The EA Principles will be used as an important tool for Departmental governance within the Gating process of any technology projects. They provide a firm foundation for making architecture and planning decisions, framing policies, procedures and standards, and supporting resolution of contradictory situations."},{"id":"id-e19ec68d8c614e3aa5212bd96e89e094","name":"Enterprise Mission","type":"Product","layer":"business","documentation":"Appendix B: Development of EA Principles\r\n\r\nThe development of architecture principles is typically influenced by the following :\r\n•\tEnterprise mission and plans: The mission, plans, and organizational infrastructure of the enterprise. "},{"id":"id-69e63f25daf74c9e8cb83cbb7da7ecf2","name":"Quality Management","type":"BusinessFunction","layer":"business","documentation":"Appendix B: Development of EA Principles\r\n\r\nThe development of architecture principles is typically influenced by the following :\r\n•\tEnterprise strategic initiatives: The characteristics of the enterprise; its strengths, weaknesses, opportunities, threats, and its current enterprise-wide initiatives (such as process improvement and quality management).\r\n"},{"id":"id-19c79bed868a48b789e45ef17958e442","name":"Step 1- Identification of the EA Principles","type":"BusinessProcess","layer":"business","documentation":"The EA Principles are developed by following a systematic process to create, socialize, approve and communicate them to ensure that they will have the desired effect. This process involves the following five key steps :\r\n\r\n\tStep 1- Identification of the EA Principles: The EA Principles identified in this document were mostly derived from previous EA Principle documents. The following main sources were consulted and leveraged: \r\n•\tThe Open Group Architecture Framework (TOGAF) defined Architecture Principles;\r\n•\tCanada Border Services Agency (CBSA) defined Architecture Principles;\r\n•\tTreasury Board defined Architecture Principles;\r\n•\t(Draft) DFO-MPO Enterprise Architecture Principles;\r\n•\tCorrectional Service Canada (CSC) defined Architecture Principles."},{"id":"id-a8783cd314384e48bce244fab6ffa8cb","name":"Step 2- Definition of the EA Principles","type":"BusinessProcess","layer":"business","documentation":"Step 2- Definition of the EA Principles: Once identified, the principles are further defined along the following five criteria and properly documented to fit ESDC’s business needs. EA Principles should be few in number and future-oriented.\r\n•\tUnderstandable: The intention of the principle is clear and unambiguous so that it can be quickly grasped and understood by individuals throughout the organization.\r\n•\tRobust: The principle will enable good quality decisions about architectures and plans to be made and enforceable policies and standards to be created. Each principle should be sufficiently definitive and precise to support consistent decision-making in complex, potentially controversial situations.\r\n•\tComplete: Every potentially important principle governing the management of information and technology for the organization is defined. The principles cover every situation perceived.\r\n•\tConsistent: Strict adherence to one principle may require a loose interpretation of another principle. The set of principles must be expressed in a way that allows a balance of interpretations. \r\n•\tStable: Principles should be enduring, yet able to accommodate change. An amendment process should be established for adding, removing, or altering principles after they are initially ratified."},{"id":"id-fb4eb87d52e54e24a7546cc2b2eb3ed0","name":"Step 3 - Revision of EA Principles","type":"BusinessProcess","layer":"business","documentation":"Step 3 – Revision of EA Principles: Architects within EA/IM Directorate are initially engaged to review and revise the proposed EA Principles. Following that initial revision, some additional key stakeholders could also be engaged in the revision as required. "},{"id":"id-8fc938c6350b4087bc1d405c90ba7a36","name":"Step 4 - Govern and Communicate EA Principles","type":"BusinessProcess","layer":"business","documentation":"Step 4 – Governance and Communication: Once the revision is completed and the EA Principles are agreed upon, they will be governed, endorsed and communicated within ESDC. Senior management will then champion the EA Principles. "},{"id":"id-ed938b7d676547adb2fb90c24bac8201","name":"Agreement of Revisions","type":"BusinessProcess","layer":"business","documentation":"\tStep 4 – Governance and Communication: Once the revision is completed and the EA Principles are agreed upon, they will be governed, endorsed and communicated within ESDC. Senior management will then champion the EA Principles. "},{"id":"id-4dc0b07fa02243208634a5295a11cb64","name":"Govern Revisions","type":"BusinessProcess","layer":"business","documentation":"\tStep 4 – Governance and Communication: Once the revision is completed and the EA Principles are agreed upon, they will be governed, endorsed and communicated within ESDC. Senior management will then champion the EA Principles. "},{"id":"id-3eea7b58671546f6b37d99d022ccb87f","name":"Endorse Revisions","type":"BusinessProcess","layer":"business","documentation":"Step 4 – Governance and Communication: Once the revision is completed and the EA Principles are agreed upon, they will be governed, endorsed and communicated within ESDC. Senior management will then champion the EA Principles. "},{"id":"id-3e0d95a2ce4a41c695a7fb4824ddd258","name":"Communicate Revisions","type":"BusinessProcess","layer":"business","documentation":"Step 4 – Governance and Communication: Once the revision is completed and the EA Principles are agreed upon, they will be governed, endorsed and communicated within ESDC. Senior management will then champion the EA Principles. "},{"id":"id-bdc6adf323a94ac8ae5a137b0e866ec5","name":"Champion EA Principles","type":"BusinessProcess","layer":"business","documentation":"Step 4 – Governance and Communication: Once the revision is completed and the EA Principles are agreed upon, they will be governed, endorsed and communicated within ESDC. Senior management will then champion the EA Principles. "},{"id":"id-333c926e45e34fe49d9ba1db658d0942","name":"Step 5 - Leverage EA Principles","type":"BusinessProcess","layer":"business","documentation":"Step 5 – Leveraging the EA principles: The EA Principles will be used as an important tool for Departmental governance within the Gating process of any technology projects. They provide a firm foundation for making architecture and planning decisions, framing policies, procedures and standards, and supporting resolution of contradictory situations."},{"id":"id-3b8fe32b5f3f4f598f4ea6866f4dd7e0","name":"Additional Key Stakeholders","type":"BusinessRole","layer":"business","documentation":""},{"id":"id-0d9a152a37f5437e90ae37e053041abe","name":"Senior Management","type":"BusinessRole","layer":"business","documentation":"Step 4 – Governance and Communication: Once the revision is completed and the EA Principles are agreed upon, they will be governed, endorsed and communicated within ESDC. Senior management will then champion the EA Principles. "},{"id":"id-857118552d8846969357a679223e1623","name":"Enterprise Architecture Review Board (EARB)","type":"BusinessCollaboration","layer":"business","documentation":"1.4.\tAudience and Key Stakeholders of the EA Principles\r\nThe audience and key stakeholders of the EA Principles are: \r\n•\tEnterprise Architecture Review Board (EARB), Architecture Review Committee (ARC), and other governance bodies involved in making decisions and providing recommendations;"},{"id":"id-aebeda2e21ff4771bfe73784d7890099","name":"Architecture Review Committee (ARC)","type":"BusinessCollaboration","layer":"business","documentation":"1.4.\tAudience and Key Stakeholders of the EA Principles\r\nThe audience and key stakeholders of the EA Principles are: \r\n•\tEnterprise Architecture Review Board (EARB), Architecture Review Committee (ARC), and other governance bodies involved in making decisions and providing recommendations;"},{"id":"id-1226fc8504184a09afba9780a2f617ac","name":"Architecture Practitioner","type":"BusinessRole","layer":"business","documentation":"1.4.\tAudience and Key Stakeholders of the EA Principles\r\nThe audience and key stakeholders of the EA Principles are: \r\n•\tEnterprise Architects, Domain Architects, Architecture Practitioners and Solution Designers for use in defining standards, architectures, designs, plans and roadmaps."},{"id":"id-45718a16878240ed8b9d88520815109f","name":"Solution Designer","type":"BusinessRole","layer":"business","documentation":"1.4.\tAudience and Key Stakeholders of the EA Principles\r\nThe audience and key stakeholders of the EA Principles are: \r\n•\tEnterprise Architects, Domain Architects, Architecture Practitioners and Solution Designers for use in defining standards, architectures, designs, plans and roadmaps."},{"id":"id-39a336dedad94299afeb7eaf5e0d7496","name":"Principles Catalog","type":"Principle","layer":"motivation","documentation":"The Principles catalog captures principles of the Business and Architecture Principles that describe what a \"good\" solution or architecture should look like. Principles are used to evaluate and agree an outcome for architecture decision points. Principles are also used as a tool to assist in architectural governance of change initiatives https://pubs.opengroup.org/architecture/togaf9-doc/arch/chap31.html"},{"id":"id-15329c2ec0984676a5d31dc62094deb6","name":"GC EA Framework","type":"Principle","layer":"motivation","documentation":"v1.34 [2021-02-24] Office of the Chief Information Officer of Canada, Treasury Board of Canada Secretariat, Government of Canada\r\nhttps://wiki.gccollab.ca/GC_Enterprise_Architecture/Framework\r\n\r\nEnterprise Architecture Framework\r\nThe Enterprise Architecture Framework is the criteria used by the Government of Canada enterprise architecture review board and departmental architecture review boards when reviewing digital initiatives to ensure their alignment with enterprise architectures across business, information, application, technology and security domains to support strategic outcomes. The EA Framework came into effect on December 1, 2020 and is a replacement of Appendix A, Mandatory Procedures for Enterprise Architecture Assessment from the Directive on Service and Digital.\r\n\r\nThe Enterprise Architecture Framework provide details on the requirements set out in the following sections of the Policy and Directive on Service and Digital.\r\n\r\n4.1.2.3 of the Policy on Service and Digital. The Chief Information Officer (CIO) of Canada is responsible for: Prescribing expectations with regard to enterprise architecture.\r\n\r\n4.1.2.4 of the Policy on Service and Digital. The Chief Information Officer (CIO) of Canada is responsible for: Establishing and chairing an enterprise architecture review board that is mandated to define current and target architecture standards for the Government of Canada and review departmental proposals for alignment.\r\n\r\n4.1.1.1 of the Directive on Service and Digital. The departmental Chief Information Officer (CIO) is responsible for: Chairing a departmental architecture review board that is mandated to review and approve the architecture of all departmental digital initiatives and ensure their alignment with enterprise architectures.\r\n\r\nThe Enterprise Architecture Framework will be published on Canada.ca. Until then here is the EA Framework."},{"id":"id-4dfbaa51425b4292aa82a79082e876f8","name":"Build Security Into System life Cycle, All Architectural Layers","type":"Principle","layer":"motivation","documentation":"Build security into the system life cycle across all architectural layers\r\n - identify and categorize information based on the degree of injury that could be expected to result from a compromise of its confidentiality, integrity and availability\r\n - implement a continuous security approach, in alignment with Centre for Cyber Security’s IT Security Risk Management Framework; perform threat modelling to minimize the attack surface by limiting services exposed and information exchanged to the minimum necessary\r\n - apply proportionate security measures that address business and user needs while adequately protecting data at rest and data in transit\r\n - design systems to be resilient and available in order to support service continuity"},{"id":"id-089b9283fcfe4f9dab49a52f87988ef0","name":"Ensure Secure Access To Systems & Services","type":"Principle","layer":"motivation","documentation":"Ensure secure access to systems and services\r\n - identify and authenticate individuals, processes or devices to an appropriate level of assurance, based on clearly defined roles, before granting access to information and services; leverage enterprise services such as Government of Canada trusted digital identity solutions that are supported by the Pan‑Canadian Trust Framework\r\n - constrain service interfaces to authorized entities (users and devices), with clearly defined roles; segment and separate information based on sensitivity of information, in alignment with ITSG‑22 and ITSG‑38. Management interfaces may require increased levels of protection\r\n - implement HTTPS for secure web connections and Domain-based Message Authentication, Reporting and Conformance (DMARC) for enhanced email security\r\n - establish secure interconnections between systems through secure APIs or leveraging centrally managed hybrid IT connectivity services"},{"id":"id-8f35913fa62c46aa95b3db6bb1d31137","name":"Maintain Secure Operations","type":"Principle","layer":"motivation","documentation":"Maintain secure operations\r\n - establish processes to maintain visibility of assets and ensure the prompt application of security‑related patches and updates in order to reduce exposure to vulnerabilities, in accordance with GC Patch Management Guidance\r\n - enable event logging, in accordance with GC Event Logging Guidance, and perform monitoring of systems and services in order to detect, prevent, and respond to attacks\r\n - establish an incident management plan in alignment with the GC Cyber Security Event Management Plan (GC CSEMP) and report incidents to the Canadian Centre for Cyber Security"},{"id":"id-697a63e3dff4496d8a7f303b67a8b45a","name":"Design End-to-End Services Digitally To Meet Needs","type":"Principle","layer":"motivation","documentation":"Design services digitally from end‑to‑end to meet the Government of Canada users and other stakeholders’ needs\r\n - clearly identify internal and external users and other stakeholders and their needs for each policy, program and business service\r\n - include policy requirement applying to specific users and other stakeholder groups, such as accessibility, gender-based plus analysis, and official languages in the creation of the service\r\n - perform Algorithmic Impact Assessment (AIA) to support risk mitigation activities when deploying an automated decision system as per Directive on Automated Decision-Making\r\n - Model end-to-end business service delivery to provide quality, maximize effectiveness and optimize efficiencies across all channels"},{"id":"id-404d349f65534e898d039ad0853d5074","name":"Outcome-Driven Architecture & Strategic Alignment","type":"Principle","layer":"motivation","documentation":"Architect to be outcome‑driven and strategically aligned to the department and to the Government of Canada\r\n - identify which departmental/GC business services, outcomes and strategies will be addressed\r\n - establish metrics for identified business outcomes throughout the life cycle of an investment\r\n - translate business outcomes and strategy into business capability implications in the GC Business Capability Model to establish a common vocabulary between business, development, and operation"},{"id":"id-67af2a04d9de44e4b0b4eae0de6c8fce","name":"Promote Enterprise Horizontal Enablement","type":"Principle","layer":"motivation","documentation":"Promote horizontal enablement of the enterprise\r\n - identify opportunities to enable business services horizontally across the GC enterprise and to provide cohesive experience to users and other stakeholders\r\n - reuse common business capabilities, processes and enterprise solutions from across government and private sector\r\n - publish in the open all reusable common business capabilities, processes and enterprise solutions for others to develop and leverage cohesive horizontal enterprise services"},{"id":"id-448c2aa782304118898fef8e8479abc7","name":"Collect Data to Address Needs","type":"Principle","layer":"motivation","documentation":"Collect data to address the needs of the users and other stakeholders\r\n - assess data requirements‑based program objectives, as well users, business and stakeholder needs\r\n - collect only the minimum set of data needed to support a policy, program, or service\r\n - reuse existing data assets where permissible and only acquire new data if required\r\n - ensure data collected, including from third-party sources, are of high quality"},{"id":"id-91e8c32f2d474d42b3970b0ef865893d","name":"Manage & Reuse Data Strategically, Responsibly","type":"Principle","layer":"motivation","documentation":"Manage and reuse data strategically and responsibly\r\n - define and establish clear roles, responsibilities, and accountabilities for data management\r\n - identify and document the lineage of data assets\r\n - define retention and disposition schedules in accordance with business value as well as applicable privacy and security policy and legislation\r\n - ensure data are managed to enable interoperability, reuse and sharing to the greatest extent possible within and across departments in government to avoid duplication and maximize utility, while respecting security and privacy requirements\r\n - contribute to and align with enterprise and international data taxonomy and classification structures to manage, store, search and retrieve data"},{"id":"id-727fb42a8f964adb909878b2629c3f51","name":"Use & Share Data Openly, Ethically, Securely","type":"Principle","layer":"motivation","documentation":"Use and share data openly in an ethical and secure manner\r\n - share data openly by default as per the Directive on Open Government and Digital Standards, while respecting security and privacy requirements; data shared should adhere to existing enterprise and international standards, including on data quality and ethics\r\n - ensure data formatting aligns to existing enterprise and international standards on interoperability; where none exist, develop data standards in the open with key subject matter experts\r\n - ensure that combined data does not risk identification or re‑identification of sensitive or personal information"},{"id":"id-dbe7b737cdc545ee8b6ccc9069654bf2","name":"Design With Privacy In Mind","type":"Principle","layer":"motivation","documentation":"Design with privacy in mind for the collection, use and management of personal Information\r\n - ensure alignment with guidance from appropriate institutional ATIP Office with respect to interpretation and application of the Privacy Act and related policy instruments\r\n - assess initiatives to determine if personal information will be collected, used, disclosed, retained, shared, and disposed\r\n - only collect personal information if it directly relates to the operation of the programs or activities\r\n - notify individuals of the purpose for collection at the point of collection by including a privacy notice\r\n - personal information should be, wherever possible, collected directly from individuals but can be from other sources where permitted by the Privacy Act\r\n - personal information must be available to facilitate Canadians’ right of access to and correction of government records\r\n - design access controls into all processes and across all architectural layers from the earliest stages of design to limit the use and disclosure of personal information\r\n - design processes so personal information remains accurate, up‑to‑date and as complete as possible, and can be corrected if required\r\n - de‑identification techniques should be considered prior to sharing personal information\r\n - in collaboration with appropriate institutional ATIP Office, determine if a Privacy Impact Assessment (PIA) is required to identify and mitigate privacy risks for new or substantially modified programs that impact the privacy of individuals\r\n - establish procedures to identify and address privacy breaches so they can be reported quickly and responded to efficiently to appropriate institutional ATIP Office"},{"id":"id-3f9c83091a194f82a9b6dfb07ae9b5f5","name":"Use Cloud First","type":"Principle","layer":"motivation","documentation":"Use cloud first\r\n - adopt the use of the GC Accelerators to ensure proper security and access controls\r\n - enforce this order of preference: software as a service (SaaS) first, then platform as a service (PaaS), and lastly infrastructure as a service (IaaS)\r\n - fulfill cloud services through SSC Cloud‑Brokering Services\r\n - enforce this order of preference: public cloud first, then hybrid cloud, then private cloud, and lastly non‑cloud (on‑premises) solutions\r\n - design for cloud mobility and develop an exit strategy to avoid vendor lock‑in"},{"id":"id-de0a273fff5944cc9fb97caa3b36249f","name":"Design For Performance, Availability & Scalability","type":"Principle","layer":"motivation","documentation":"Design for performance, availability and scalability\r\n - ensure response times meet user needs, and critical services are highly available\r\n - support zero‑downtime deployments for planned and unplanned maintenance\r\n - use distributed architectures, assume failure will happen, handle errors gracefully, and monitor performance and behaviour actively\r\n - establish architectures that supports new technology insertion with minimal disruption to existing programs and services\r\n - control technical diversity; design systems based on modern technologies and platforms already in use"},{"id":"id-b6776927ba4e4993bf4fbd18225fc95e","name":"Follow DevSecOps Principles","type":"Principle","layer":"motivation","documentation":"Follow DevSecOps principles\r\n - use continuous integration and continuous deployments\r\n - ensure automated testing occurs for security and functionality\r\n - include your users and other stakeholders as part of the DevSecOps process, which refers to the concept of making software security a core part of the overall software delivery process"},{"id":"id-2d29e444c0b0480b96bef0376882f0cf","name":"Use Public Cloud-Hosted Open Source Solutions","type":"Principle","layer":"motivation","documentation":"Use open source solutions hosted in public cloud\r\n - select existing solutions that can be reused over custom built\r\n - contribute all improvements back to the communities\r\n - register open source software to the Open Resource Exchange"},{"id":"id-3641f5e0fefd43acb8def54c2ca001f0","name":"Use Public Cloud-Hosted SaaS","type":"Principle","layer":"motivation","documentation":"Use software as a service (SaaS) hosted in public cloud\r\n - choose SaaS that best fit for purpose based on alignment with SaaS capabilities\r\n - choose a SaaS solution that is extendable\r\n - configure SaaS and if customization is necessary extend as open source modules"},{"id":"id-77b8de83e89041aeb38ce87dfb717c98","name":"Design For Interoperability","type":"Principle","layer":"motivation","documentation":"Design for Interoperability\r\n - design systems as highly modular and loosely coupled services\r\n - expose services, including existing ones, through APIs\r\n - make the APIs discoverable to the appropriate stakeholders"},{"id":"id-8bb16ea2019d439cb22cf9f985c8d5ef","name":"Enable Interoperability","type":"Principle","layer":"motivation","documentation":"Enable Interoperability, Proposed amendment March 23, 2021\r\n - expose data and functionality through service interfaces\r\n - applications must communicate with each other via those interfaces\r\n - services interfaces must be published and discoverable"},{"id":"id-9f30c8075e1d4f919036446f1a21b561","name":"ESDC EA Principles","type":"Principle","layer":"motivation","documentation":"ESDC EA Principles V0.18.1- Final.docx\r\nhttps://dialogue/grp/BU5946064/EA%20Reference%20Material/02%20-%20ESDC%20EA%20Principles/ESDC%20EA%20Principles%20V0.18.1-%20Final.docx\r\n2019-12-12"},{"id":"id-749be72b93a14ea78a59d80baf67ea55","name":"Enterprise First","type":"Principle","layer":"motivation","documentation":"2.1.\tEnterprise First\r\n\r\nName:\tEnterprise First\r\nStatement:\tProvide maximum long-term benefits to the enterprise as a whole, while optimizing total costs of ownership and risks.\r\nRationale:\r\n•\tEnterprise needs over business unit or project needs\r\n•\tEnterprise priorities are above priorities of a business unit or a project\r\n•\tDecisions based on the whole government have a greater long-term value than decisions with a certain perspective of a group with a specific interest\r\n\r\nImplications:\r\n•\tClient needs must be addressed and opportunities leveraged for creating value by considering and selecting the appropriate approach and solutions in the following order:\r\n    o\tPan-Canadian ; then;\r\n    o\tGovernment of Canada whole-of-government; then\r\n    o\tGovernment of Canada Cluster; then\r\n    o\tDepartment-wide, holistic and horizontal; then\r\n    o\tProgram or project specific.\r\n•\tThe reach of  an architecture  should allow for  Act as one \r\n•\tSolutions must aim to maximize the cumulative business benefits over their entire lifecycle.\r\n•\tInvestment proposals must link to business/IT strategy and goals.\r\n•\tBusiness value realization must be tracked and demonstrated on all major investments. \r\n•\tCommon solutions and shared services that benefit the enterprise over one-off solutions for one sector or region are preferred. \r\n•\tOrganizational readiness for adopting new solutions are analyzed and taken into account.\r\n\r\nReferences:\r\n•\tTOGAF 9 Principle 2\r\n•\tDFO PRN_ARC_01: Enterprise value focus"},{"id":"id-4bb2e7919a5b4a7a96c945f278aae88c","name":"Client Centric","type":"Principle","layer":"motivation","documentation":"2.2.\tClient Centric\r\n\r\nName:\tClient-Centric\r\nStatement:\tDeliver high-quality, timely and accurate services that are responsive to current and emerging client needs and to continue to innovate and meet new standards of excellence.\r\nRationale:\r\n•\tClients expect seamless access to a suite of integrated programs and services based on their individual needs and abilities.\r\nImplications:\r\n•\tServices must be built around client needs \r\n•\tClients must be provided with a “one-stop service” that is simple and intuitive.\r\n•\tClient and employee feedback data must be collected and analyzed to improve services and inform implementation.\r\n•\tClients are able to determine their  level of engagement with the government and/or department as permitted by legislation, public policy and program policy\r\n•\tServices must be delivered across multiple channels using modern architectures. \r\n•\tWhere appropriate, clients are directed into lower cost channels.\r\n•\tService levels must be defined for client services provided. \r\n•\tServices must be measured to improve performance.\r\n•\tA cross-government strategy must be built for common citizen and business data sets (e.g. name, address) and common client applications (e.g. authentication, payments, notifications).\r\n•\tServices should be accessible by the client at anytime, anywhere and on any device.\r\n\r\nReferences:\r\n•\tESDC Service Strategy\r\n•\tThe OASIS Transformational Government Framework, Guiding Principles\r\n•\tDigital Services Playbook - from the U.S. Digital Service\r\n•\tDFO PRN_ARC_02: Citizen centered service"},{"id":"id-9951330f78a440e3afac16423a0039a5","name":"Digital First","type":"Principle","layer":"motivation","documentation":"2.3.\tDigital First\r\n\r\nName:\tDigital First\r\nStatement:\r\nCreate and optimize the design of services and communications for delivery via responsive digital channels (i.e., web, mobile, social media, etc.) over the traditional channels, such as mail, fax, or in-person. \r\nRationale:\r\n•\tClients expect secure and easy-to-use online options to access services from the information and application stage up to a decision on their file. \r\n•\tESDC is committed to providing Canadians with access to high-quality online services, while ensuring that those who require additional assistance to access services online receive it.\r\n•\tClients can complete services using digital self-service.( Goal 1 of the ESDC Service Strategy )\r\n\r\nImplications:\tDigital First means:\r\n•\tWe must optimize to digital channel\r\n•\tWe must embrace decisions enabling its fullest control\r\n•\tWe must design the channel to support\r\n•\tWe must ensure the full spectrum of services covers the non-digital\r\n•\tWe must enable business transformation to grow take up\r\n\r\nGC Digital Architectural Standards\r\no\tAlign to the GC Business Capability model\r\n    \tDefine program services as business capabilities to establish a common vocabulary between business, development, and operation\r\n    \tIdentify capabilities that are common to the GC enterprise and can be shared and reused\r\n    \tModel business processes using Business Process Modelling Notation (BPMN) to identify common enterprise processes\r\no\tDesign for Users First & Deliver with Multidisciplinary Teams\r\n    \tFocus on the needs of users, using agile, iterative, and user-centred methods\r\n    \tConform to both accessibility and official languages requirements\r\n    \tInclude all skillsets required for delivery, including for requirements, design, development, and operations\r\n    \tWork across the entire application lifecycle, from development and testing to deployment and operations\r\n    \tEnsure quality is considered throughout the Software Development Lifecycle\r\n    \tEnsure accountability for privacy is clear\r\n    \tEncourage and adopt Test Driven Development (TDD) to improve the trust between Business and IT\r\no\tDesign Systems to be Measurable and Accountable\r\n    \tPublish performance expectations for each IT service\r\n    \tMake an audit trail available for all transactions to ensure accountability and non-repudiation \r\n    \tEstablish business and IT metrics to enable business outcomes\r\n    \tApply oversight and lifecycle management to digital investments through governance\r\no\tData Collection\r\n    \tEnsure data is collected in a manner that maximizes use and availability of data\r\n    \tEnsure data collected aligns to existing enterprise and international standards\r\n    \tWhere enterprise or international standards don’t exist, develop Standards in the open with key subject matter experts \r\n    \tEnsure collection of data yields high quality data as per data quality guidelines\r\n    \tEnsure data is collected through ethical practices allowing for use that supports appropriate citizen and business-centric \r\n    \tData should only be purchased once and should align with international standards \r\n    \tWhere necessary, ensure collaboration with department/ agency data stewards/ custodians, other levels of government, & Indigenous people\r\no\tData Management \r\n    \tDemonstrate alignment with departmental data governance and strategies.\r\n    \tEnsure accountability for data roles and responsibilities\r\n    \tDesign to maximize data use and availability.\r\no\tData Storage \r\n    \tEnsure data is stored in a secure manner in accordance with the National Cyber Security Strategy, and the Privacy Act.\r\n    \tFollow existing retention and disposition schedules.\r\n    \tEnsure data is stored in a way to facilitate easy data discoverability and accessibility. \r\no\tData Sharing \r\n    \tData should be shared openly by default as per the Directive on Open Government.\r\n    \tEnsure government-held data can be combined with data from other sources enabling interoperability and interpretability through for internal and external use\r\n    \tReduce the collection of redundant data\r\n    \tReuse existing data where possible \r\n    \tEncourage data sharing and collaboration\r\no\tUse open standards and solutions by default\r\n    \tUse open standards and open source software. Avoid lock-in and seek independence and substitutability where open source software or open standards are available.\r\n    \tEnforce this order of preference: open source first, then platform-agnostic COTS, then proprietary COTS, and lastly custom-built\r\n    \tMake source code open and reusable under an appropriate open source software license\r\n    \tExpose public data to implement Open Data and Open Information initiatives\r\no\tMaximize Reuse\r\n    \tLeverage and reuse existing solutions, components, and processes\r\n    \tSelect enterprise and cluster solutions over department-specific solutions\r\n    \tAchieve simplification by minimizing duplication of components and adhering to relevant standards\r\n    \tInform the GC EARB about departmental investments and innovations\r\n    \tShare code publicly when appropriate, and when not, share within the Government of Canada\r\no\tEnable Interoperability \r\n    \t Expose all functionality as services\r\n    \tUse micro services built around business capabilities. Scope each service to a single purpose\r\n    \tRun each IT service in its own process and have it communicate with other IT services through a well-defined interface, such as an HTTPS-based application programming interface (API) as per Appendix D: Mandatory Procedures for Application Programming Interfaces \r\n    \tRun applications in containers\r\n    \tLeverage the GC Digital Exchange Platform for components such as the API Store, Messaging, and the GC Service Bus\r\no\tUse Cloud first\r\n    \tEnforce this order of preference: Software as a Service (SaaS) first, then Platform as a Service (PaaS), and lastly Infrastructure as a Service (IaaS)\r\n    \tEnforce this order of preference: Public cloud first, then Hybrid cloud, then Private cloud, and lastly non-cloud (on-premises) solutions\r\n    \tDesign for cloud mobility and develop an exit strategy to avoid vendor lock-in\r\no\tDesign for Performance, Availability, and Scalability\r\n    \tDesign for resiliency\r\n    \tEnsure response times meet user needs for availability\r\n    \tSupport zero-downtime deployments for planned and unplanned maintenance\r\n    \tUse distributed architectures, assume failure will happen, handle errors gracefully, and monitor actively\r\no\tDesign for Security and Privacy\r\n    \tImplement security across all architectural layers \r\n    \tCategorize data properly to determine appropriate safeguards \r\n    \tPerform a privacy impact assessment (PIA) and mitigate all privacy risks when personal information is involved\r\n    \tBalance user and business needs with proportionate security measures and adequate privacy protections. \r\n\r\n•\tDigital Principles (Canada.ca)\r\no\tDesign Ethical  Services \r\n    \tMake sure that everyone receives fair treatment.\r\n    \tComply with ethical guidelines in the design and use of systems which automate decision making (such as the use of artificial intelligence).\r\no\tCollaborate Widely\r\n    \tCreate multidisciplinary teams with the range of skills needed to deliver a common goal. \r\n    \tShare and collaborate in the open.\r\n    \t Identify and create partnerships which help deliver value to users.\r\nReferences:\r\n•\tESDC Service Strategy\r\n•\tGC Digital Standards\r\n•\tGC Digital Architectural Standards\r\n•\tDigital Princples (https://open.canada.ca/en/blog/digital-principles?page=1%2C0)"},{"id":"id-5a017ebeb18845338b729a1cc0d6d30c","name":"Mission-Driven","type":"Principle","layer":"motivation","documentation":"2.4.\tMission-driven\r\n\r\nName: \tMission-Driven\r\nStatement: Achieving  the mandate and strategic goals of ESDC\r\nRationale:\r\n•\tA business led and focused architecture is more successful in:\r\n    o\tSupporting the department’s mandate\r\n    o\tAchieving the strategic goals\r\n    o\tResponding to changes in client and stakeholder  needs and expectations \r\n•\tFor optimal Return on Investment (ROI) requires decisions to be aligned with the department’s mandate and strategic goals\r\n•\tArchitectures reflect the current and target state of the department so informed decisions can be made regarding achieving the department’s mandate and strategic goals\r\nImplications:\r\n•\tArchitectures will demonstrate how business servers the organizational values and strategic goals\r\n•\tArchitecture must implement a complete vision that is focused on the business\r\n•\tAs new needs arise, priorities must be adjusted proportionally\r\n•\tPriorities must be established by and for the entire company\r\n•\tAbility to analysis the impact of change in laws, regulations, standards and directives has on the department carrying out its mission/mandate\r\n•\tAbility to identify gaps between the current state and target sate\r\n•\tAbility to identify barriers that impact the department’s transformation and recommendations to overcome the barriers\r\nReferences:\t"},{"id":"id-5624f1bcee4745679b4572731b4c7927","name":"Interoperability","type":"Principle","layer":"motivation","documentation":"2.5.\tInteroperability\r\n\r\nName: \tInteroperability\r\nStatement:\tInteroperability allows the enterprise to interact, connect and operate with other parties within its business and IT ecosystem in an effective and efficient manner. \r\nRationale:\r\n•\tChanges in the business and IT ecosystem  may impact ESDC ability to meet its mandate and achieve its strategic goals.\r\n•\tESDC collaborates with other parties to meet its mandate and achieve its strategic goals. \r\n•\tESDC uses the services of 3rd Party Service Providers to meet its mandate and achieve its strategic goals.\r\nImplications:\r\nService \r\n•\tInteroperability requirements are defined and considered from the onset of an initiative \r\n•\tInteroperability standards and industry standards must be followed unless there is a compelling business reason to implement a non-standard.\r\n•\tNeed to understand  all the parties, including their role and responsibilities, that are part of the ESDC business and IT ecosystem. \r\n•\tA party’s role and responsibilities within the ESDC ecosystem is formalized and underpinned by the appropriate vehicle (e.g. legislation, regulation, agreement, etc.).\r\n•\tNeed to understand how  a party contributes to ESDC meeting its mandate and achieving its strategic goals.\r\n\r\nReferences:\t"},{"id":"id-c63002cb67c9434cad69631a0c00ea5c","name":"Business Continuity","type":"Principle","layer":"motivation","documentation":"3.1.\tBusiness Continuity\r\n\r\nName:\tBusiness Continuity\r\nStatement:\tOperations are maintained in case of events that may or are known to cause service or system interruptions.\r\nRationale:\r\n•\tBusiness activities continue regardless of external events. \r\n•\tHardware failure, natural disasters, and data corruption do not disrupt or stop enterprise activities. \r\n•\tThe enterprise business functions are capable of operating leveraging redundant information delivery mechanisms.\r\n\r\nImplications:\r\n•\tThe risks of business interruption must be established in advance and managed. (Management includes but is not limited to planning, testing and monitoring business continuity and IT service recovery, periodic reviews, testing for vulnerabilities and exposure, or designing mission-critical services in a way that ensures business function continuity through redundant or alternative capabilities.)\r\n•\tServices and applications must be assessed for criticality and impact on the ESDC’s mission to determine which continuity level is required and which corresponding recovery plan must be implemented.\r\n•\tRecoverability, redundancy, and maintainability of enabling services and systems must be considered throughout their design and use. \r\n•\tTechnology lifecycle must be actively managed.\r\n•\tTechnology must be regularly and proactively upgraded.\r\nReferences:\r\n•\tTOGAF 9 Principle 4"},{"id":"id-7ca2cc3b895b4664830cefa7fe11317c","name":"Accessibility","type":"Principle","layer":"motivation","documentation":"3.2.\tAccessibility \r\n\r\nName:\tAccessibility\r\nStatement:\tESDC services are accessible on an equitable basis to clients\r\nRationale:\r\n•\tGovernment services needs to be accessible to the widest set of consumers. Channel independence ensures that clients have a choice of access options. While information and services need to be accessed in a variety of ways, the information and services must be delivered in an integrated, consistent fashion.\r\nImplications:\r\n•\tServices should be designed to operate consistently across multiple delivery channels.\r\n•\tPrograms will need to resource significant additional effort in human interface design.\r\n•\tIn designing services, programs will need to consider accessibility by, and interoperability with, automated services.\r\nReferences:\r\n•\tAustralian Government Enterprise Architecture Principles (PR-6)"},{"id":"id-d9b1d2382d354e39ba6fecf0990832e1","name":"Value","type":"Principle","layer":"motivation","documentation":"3.3.\tValue\r\n\r\nName:\tValue\r\nStatement:\tGovernment business initiatives and investments must represent value for money and return a business benefit.\r\nRationale:\r\n•\tThe value and cost of investments need to be measurable in objective terms. A government service that does not have an understood return on investment (ROI) is unlikely to receive the on-going support and commitment that will make it sustainable.\r\n•\tService delivery can create complicated cost/benefit models, particularly where there are cross-jurisdictional boundaries. The benefits realized through a service may not be recorded by the program and/or programs that are required to invest. A thorough understanding of the costs and benefits is required to establish an appropriate investment model to support the creation and on-going management of the service.\r\n•\tIt is mandatory for programs to meet the GC procurement rules for:\r\n    o\t value for money,\r\n    o\t encouraging competition,\r\n    o\tefficient, effective and ethical use of resources, and\r\n    o\taccountability and transparency.\r\nImplications:\r\n•\tBusiness initiatives will need to be fit for purpose and deliver value and benefit.\r\n•\tBusiness initiatives will need to be prioritized in terms of their relation to the GC and department vision, policies, strategies and plans.\r\n•\tThe department will need to assess the ROI for each business initiative.\r\n•\tPublic ROI should be based on the department taking a rewards-based approach to ROI measurement and encompass the following three areas:\r\n    o\tFinancial ROI:  Traditional or “classic” measurement of financial gains with quantifiable results. These ROI is direct, measureable benefits and costs e.g., reduced transaction costs (such as in procurement by reducing the cost creating a purchase order from $28 to $21) or fewer steps in the workflow of approving a budget request\r\n    o\tSocial ROI:  Impact of government services on a societal level This ROI is indirect and difficult to measure public good benefits and costs e.g., are citizens safer? Are children in a particular jurisdiction receiving adequate social services? Are the vulnerable receiving sufficient support?\r\n    o\tPolitical ROI: Impacts the system of governing and policy decision making. This ROI is motivational feasibility of the project, or the benefits of interested parties (champions, opponents, decision makers) e.g., are we delivering government programs that match policies, legislation and mandates? Are we delivering on the promises of our politicians?\r\n•\tIn addition to assessing the public ROI for each business initiative, a total cost of ownership (TCO) approach will be required. The TCO will need to assess the investment against other priorities, as well as balancing the costs of development, support, security, risk mitigation, disaster recovery and retirement against the costs of government’s requirements for flexibility, scalability, ease of use and reduction of integration complexity.\r\n•\tThere will need to be improved whole-of-government usage of business benefit management and benchmarking,\r\nReferences:\r\n•\tAustralian Government Enterprise Architecture Principles (PR-4)"},{"id":"id-469104cf6520468b97f9c31b727316c8","name":"Reliable","type":"Principle","layer":"motivation","documentation":"3.4.\tReliable\r\n\r\nName:\tReliable\r\nStatement:\tDepartmental services are reliable, accurate, relevant and timely.\r\nRationale:\r\n•\tThe take-up and use of lower cost channels will depend on users of government services trusting the ability of the government to provide reliable, accurate, relevant and timely information to consumers.\r\n•\tReliable services that provide consistent outcomes will help to reduce complaints, reviews and appeals from consumers.\r\nImplications:\r\n•\tThe department  will need to deliver services and information which clients can rely upon. \r\n•\t The department, and  programs will need to devote effort towards service design and service performance management to ensure reliable services\r\n•\tGood processes create good services and data. Processes will need to be the focus of ongoing continuous improvement (which in turn will improve reliability, accuracy, relevancy and timeliness of the service). \r\n•\t The department will need to provide trusted services and information to individuals, and organizations. The outcomes of these services and information will strengthened the trust in the department and Government of Canada. \r\n•\tThe department and programs will  need to collaboration  with other departments and programs to deliver, manage and measure services to ensure the services are achieving the desired outcomes\r\n\r\nReferences:\r\n•\tAustralian Government Enterprise Architecture Principles (PR-3)"},{"id":"id-4555926650964bb9a9e55f2ba9c5a2f9","name":"Cohesiveness","type":"Principle","layer":"motivation","documentation":"3.5.\tCohesiveness\r\n\r\nName:\tCohesiveness\r\nStatement:\tDepartments shall present a consistent and unified face of government through a common and integrated approach to service delivery.\r\nRationale:\r\n•\tGovernment services are presented to clients in a consistent and cohesive manner. This means that clients of government services should only need to present a piece of information to government once. Similarly, clients will be presented with a common look, feel and experience regardless of what department service or channel they are accessing at the time. This presentation of a consistent government face will reduce the impact of internal government change (for example, department/program amalgamations and restructures) on clients, and potentially reduce the flow on costs of such changes. Adoption and continued use of a service by clients will depend, to an extent, on ease of use enhanced by consistency of service delivery.\r\n•\tWith the introduction of common services and the reduction of duplicate services, the Government/Department has the opportunity to reduce costs.\r\nImplications:\r\n•\tDepartments and Programs will need to collaborate in the development of services. This will require open sharing of information, cross-department/program planning, and understanding of whole-of-government service channels, segments and lines of business.\r\n•\tTo achieve consistent and interoperable service across the whole-of-government, the government, department and its programs will need to agree and use common technologies, open industry standards and open architectures.\r\n•\tThe department and programs will need to align service delivery with whole-of-government policies, strategies and frameworks.\r\n•\tDepartments and programs will need to reduce integration complexity.\r\n•\tDepartments and programs will need to incorporate the seamless use of interoperable applications, data and information across various sourcing models and operating environments.\r\n\r\nReferences:\r\n•\tAustralian Government Enterprise Architecture Principles (PR-2)"},{"id":"id-bb5ce7eeba6f481395415871f94db000","name":"Optimize Services","type":"Principle","layer":"motivation","documentation":"3.6.\tOptimize Services\r\n\r\nName:\tOptimize Services\r\nStatement:\tAcross the business domain, we will enable simple, flexible, efficient and reusable services.\r\nRationale:\r\n•\tBy focusing on increasing the efficiency, effectiveness, value and quality of our processes we will increase the maturity and stability of what we do (our business capabilities). We won’t be dragged down by non-optimized solutions and designs and reduce risk.\r\n\r\nImplications:\r\n•\tTest and iterate our models and plans more often. \r\n•\tFavour small incremental pieces that integrate seamlessly and can be reused across the organization. \r\n•\tThink enterprise first (instead of one-off solutions).\r\nReferences:\r\n•\tBusiness Architecture Team"},{"id":"id-1d85b944bcb84a1cb9e1747246ef95a3","name":"Accessible-By-Default","type":"Principle","layer":"motivation","documentation":"4.1.\tAccessible-by-Default\r\n\r\nName:\tAccessible-by-Default\r\n\r\nStatement:\tInformation and data is open, accessible and easy to use by default, however protected within closed environments when it includes personally identify  and/or sensitive data \r\nRationale:\r\n•\tThe Government of Canada strives to provide Canadians with access to the data that is produced, collected, and used by departments and agencies across the federal government through a single and searchable window.\r\n•\tInformation and Data are easily findable and consumable, in the appropriate format for a variety of users and scenarios.\r\n•\tBenefits of open data include:\r\n    o\tSupport for innovation\r\n    o\tAdvancing the government's accountability and democratic reform \r\n    o\tLeveraging public sector information to develop consumer and commercial products \r\n    o\tBetter use of existing investment in broadband and community information infrastructure \r\n    o\tSupport for research \r\n    o\tSupport informed decisions for clients \r\n    o\tProactive Disclosure\r\n•\tInformation and Data are ubiquitous, but to be of business value the constraints challenging its access and use must be mitigated as much as is appropriate to do so. \r\n\r\nImplications:\r\n•\tUnless sensitive or containing personally identifiable data, the data is accessible to all employees of ESDC.\r\n•\tWhen designing services and systems, opportunities for publishing open data must be explored. Data can be published in different formats, or made accessible through Application Programming Interfaces (APIs). \r\n•\tApplication Programming Interfaces (APIs) provide on-demand access to large, timely or complex data.\r\n•\tInformation and Data holdings must be aligned to business needs and functions.\r\n•\tInformation and Data are clearly catalogued, easily discoverable and easily accessible.\r\n•\tAccess must be closely tied to understanding of the data, otherwise inappropriate use may occur.\r\n•\tInformation and Data consumers’ awareness and education of data sources must be sustained.\r\n•\tInformation and Data are in the appropriate tool and format for use and users know how to access it.\r\n•\tEfficient / timely access to information / data and its protection are not mutually exclusive concepts.\r\n•\tInformation and Data repositories need to be managed to reduce redundancies and duplication.\r\n•\tInformation and Data presentation must match generally accepted internal or external standards.\r\n•\tLevels of aggregation or disaggregation are appropriate for consumption purposes.\r\n•\tTimeliness of access permits the right data to be available when it is needed.\r\n•\tMashup of Information and Data will push the boundaries of user understanding and will need training and support.\r\n•\tKnowledge repositories should capture enterprise information in ways to be useful as a basis for designing programs and services to improve future outcomes.\r\n•\tBusiness and Information Professionals must partner to ensure user/consumer perspective is enabled.\r\n•\tInformation and data is now found in many forms and under many constraints.\r\n•\tBoundaries or constraints can include legal, geographic, ownership, sovereignty, language, format, application, technology, security, privacy, etc.; the goal is to architect by considering these boundaries, not to circumvent them.\r\n•\tData architecture or lineage and flow must be such that we can utilize, process, and share data regardless of constraints.\r\n•\tData if possible should reside where it is and not re-created or moved.\r\n•\tIntellectual property must be respected and maintained regardless of constraints.\r\n•\tA federated management / stewardship approach may be applied in certain circumstances.\r\n•\tAvailability must not suffer due to insufficiently designed and implemented solutions.\r\n•\tThird party processing (supply chain security) policies and architectures should be designed and monitored (i.e., our data must be under our rules at all times and locations).\r\n\r\nReferences:\r\n•\tCanada's Open Data Principles\r\n•\tCDO"},{"id":"id-76b947541e344ed9bfd961befff4de36","name":"Common Understanding and Trusted","type":"Principle","layer":"motivation","documentation":"4.2.\tCommon Understanding and Trusted\r\n\r\nName:\tCommon Understanding and Trusted\r\nStatement:\tBusiness and program terminology and data are defined consistently throughout the Department, and the definitions and values are understandable, trusted and available to all users.\r\nRationale:\r\n•\tA common vocabulary facilitates communications and enables effective dialogue.\r\n•\tThe data that will be used in the development of services must have a common definition throughout the Department to enable sharing of data. \r\n•\tInformation and Data are meaningfully defined from an enterprise perspective by the appropriate authorities, and are obtained from reliable, authoritative and understood data flows and sources. \r\n\r\nImplications:\r\n•\tThe Department must establish the initial common vocabulary for the business based on open standards where available. The definitions will be used uniformly throughout the Department.\r\n•\tMultiple concurrent definitions must be replaced by a definition that is accepted and understood by the entire Department.\r\n•\tWhenever a new definition is required, the definition effort will be co-coordinated and reconciled with the corporate \"glossary\". \r\n•\tClarity and integrity of information / data is crucial to supporting business processes\r\n•\tBuilding trust in data requires a multi-faceted approach.\r\n•\tMetadata capture and utilisation must be mandatory in all processes and systems\r\n•\tData and its associated metadata must be an integral part of any business process design\r\n•\tInformation and data lineage (flow) and applied business rules must be documented and available\r\n•\tStewards must clearly define business terms and data elements, aligned to business programs to provide a common enterprise vocabulary, thus allowing for enterprise-wide use and interoperability\r\n•\tStewards need a simple and repeatable process to define, have approved and publish definitions and other metadata for information and data elements\r\n•\tStewards and all consumers need a repository, tied to important systems to capture / consume metadata \r\n•\tStewards will direct custodians in their activities as relates data aspects\r\n•\tProperly identified data custodians are solely responsible for data capture to ensure integrity and quality and reduce redundant efforts and storage/processing\r\n•\tData governance and stewardship provide the means to ensure that enterprise data can be trusted \r\n•\tEnterprise Information and Data should be located in authoritative sources \r\n•\tWithout trust in data consumers may develop their own siloed and redundant solutions/repositories.\r\n\r\nReferences:\r\n•\tTOGAF 9 Principle 14\r\n•\tCDO"},{"id":"id-507da9652f2b4a1a81b195e4586c3b38","name":"Shared Assets","type":"Principle","layer":"motivation","documentation":"4.3.\tShared Assets\r\n\r\nName:\tShared Assets\r\nStatement:\tInformation and Data are Shared Assets.\r\nRationale:\r\n•\tInformation and Data are valuable enterprise assets, with clear accountability, and treated as ‘our’ data not ‘my’ data to fully deliver on its benefits. \r\n\r\nImplications:\r\n•\tInformation / Data are enterprise assets, much like capital, human or intellectual property assets.\r\n•\tMost enterprise assets require careful management, and Information / Data are no exception.\r\n•\tInformation / Data assets exist to respond to business needs, support decision-making, enhance operational efficiencies and provide effective service delivery.\r\n•\tOwnership resides at the enterprise level or higher, not at the individual or business line level.\r\n•\tClearly assigned stewardship is key to managing day-to-day data activities and data quality but requires the authority and the means to do so to ensure authoritative decisions are taken by the right parties.\r\n•\tDiscussion and decision forums and approaches must be inclusive, transparent, holistic and at the enterprise level and no longer strictly by business line or limited scope.\r\n•\tValue is derived from sharing by reducing the number of authoritative sources, obliging data quality, permitting horizontal use / re-use and aggregation / dissemination to tap into unknown potential, and by allowing faster yet secured access.\r\n•\tManaging and sharing requires policies, procedures, standards, roles & responsibilities, to govern data management capabilities and a significant cultural change at all enterprise levels.\r\n•\tVarious artefacts and tools such as an enterprise data model and a business glossary will assist with management, communication and sharing in support of the enterprise mandate.\r\n\r\nReferences:\t•\tCDO"},{"id":"id-ad955162a2b34780afb1792abb9af37c","name":"Fit-for-Purpose","type":"Principle","layer":"motivation","documentation":"4.4.\tFit-for-Purpose\r\n\r\nName:\tFit-for-Purpose\r\nStatement:\r\n•\tInformation and Data are Fit-for-Purpose\r\n\r\nRationale:\r\n•\tInformation and Data are suitable and of the appropriate quality for the intended purpose, as defined by the business programs and tested as close to the source as possible.\r\n\r\nImplications:\r\n•\tOften assumed to be a 100% data quality requirement and not the pragmatic reality.\r\n•\tApproach should be to get the data ‘right’ for the need, as defined by the responsible party.\r\n•\tManagement and architecture of the information / data must support not only operational needs but also and analytical / research and marketing requirements, otherwise the data has no value in bettering program outcomes.\r\n•\tInformation and Data quality must be tested and remediated as close to the source as possible.\r\n•\tInformation and Data quality will degrade over time, even if nothing ‘happens’ to the actual data, therefore validation of its quality must be performed as an ongoing function, not one-time efforts and monitoring and reporting on quality metrics must be part of everyday operations.\r\n•\tData quality functional expertise (i.e., center of excellence) can establish a standardised framework and support to business programs in their quality validation processes.\r\n•\tDimensions of quality utilised to validate the appropriateness and usefulness of the data will vary by necessity (i.e., uniqueness, validity, completeness, accuracy, etc.).\r\n•\tBusiness purpose of data must consider upstream and downstream uses, and not just the immediate use.\r\n•\tInformation and data repositories may need differing levels of quality if utilised for research versus operational needs.\r\n\r\nReferences:\r\n•\tCDO"},{"id":"id-060f29eaa0f742caa6e713199b470b3d","name":"Managed Strategically","type":"Principle","layer":"motivation","documentation":"4.5.\tManaged Strategically \r\n\r\nName:\tManaged Strategically\r\nStatement:\tInformation and Data are Managed Strategically.\r\nRationale:\r\n•\tInformation and Data are managed across all data management capabilities and throughout its lifecycle, according to industry standards and best practices, for the purpose of answering current and future business needs.\r\n\r\nImplications:\r\n•\tData Management Functional leadership must exist to ensure all aspects of managing information and data are included to cover all facets of business data needs.\r\n•\tFunctional leadership must create and ensure their standards are applied and monitored for conformity. \r\n•\tInteroperability is the target, and integration is the interim solution, to avoid data silos, replication and unnecessary processing and movement.\r\n•\tManaging Information and data is often a collaborative effort between data professionals and business professionals.\r\n•\tMeasuring the maturity of information and data management practices is of value to ensure improvements and alignment to business needs.\r\n•\tFull functional and lifecycle management is necessary to manage risks, compliance and should be auditable.\r\n\r\nReferences:\r\n•\tCDO"},{"id":"id-cf5303b85e724ba7accf3c4065098655","name":"Buy What We Can and Build What We Must","type":"Principle","layer":"motivation","documentation":"5.1.\tBuy what we can and build what we must\r\n\r\nName: \tBuy what we can and build what we must.\r\nStatement:\r\nImplement cloud services/COTS by default, open source where practical, and reserve custom development for unique requirements; adopt shared services and common government solutions where available.  \r\n\r\nRationale:\r\n•\tProcuring commercial solutions (Cloud Services, COTS or open source) for common applications allows ESDC to focus its resources on application with Unique Requirements related specific configurations, customizations, and as a last resort custom development.\r\n\r\nImplications:\r\n•\tWhen deploying new workloads, Departments must consider cloud service models in the following order:\r\n    o\tCloud Services (SaaS)\r\n    o\tOpen source\r\n    o\tCOTS \r\nThis means that the preference will be given to subscribing to SaaS solutions rather than buying or developing new solutions that can be hosted on a PaaS or IaaS infrastructure.\r\n•\tWhen SaaS is not available, ESDC will explore availability of packaged solutions, both commercially available (COTS) and open source. Only if no appropriate solution is available on the market (commercial or open sauce), development of a custom solution would be considered.\r\n•\tProprietary solutions restrict reuse, reduce asset management flexibility and can prevent government organizations from switching suppliers.\r\n•\tOpen source will be fairly assessed against proprietary solutions alternatives. Exit, rebid and rebuild costs will be taken into consideration during procurement decisions for best value for money comparisons between open source and proprietary solutions.\r\n\r\nReferences:\r\n•\tGovernment of Canada Information Technology Strategic Plan 2016-2020\r\n•\tGC Cloud Adoption Strategy (2016)\r\n•\tAccenture Paper on Technical Debt\r\n•\tCorrectional Service Canada (CSC) Enterprise Architecture Principles"},{"id":"id-05878d3561334e86ac6cb473f7a167d4","name":"Technology Independence","type":"Principle","layer":"motivation","documentation":"5.2.\tTechnology Independence\r\n\r\nName: \tTechnology Independence \r\nStatement:\tApplications are independent of specific technology choices and therefore can operate on a variety of technology platforms. \r\n\r\nRationale:\r\n•\tIndependence of applications from the underlying technology allows applications to be developed, upgraded, and operated in the most cost- effective and timely way. \r\n•\tEnsure that an application is not dependent on specific hardware and operating systems software realizing that IT related decisions makes the organization dependent on that technology\r\n\r\nImplications:\r\n•\tFor SaaS and PaaS there may be limited choices given these services are technology and platform-dependent\r\n•\tInterfaces will need to be developed to enable interoperability with services deployed under the enterprise architecture\r\n•\tMiddleware will be used to decouple services from specific software implementation."},{"id":"id-623ee8b6b1ab4b9bb694bef0ef775957","name":"Service Orientation","type":"Principle","layer":"motivation","documentation":"5.3.\tService Orientation\r\n\r\nName: \tService Orientation\r\nStatement:\tThe architecture is based on a design of services which mirror real-world business activities comprising the enterprise (or inter-enterprise) business processes.\r\nRationale:\r\n•\tService orientation supports enterprise agility and boundaryless information flow\r\n\r\nImplications:\r\n•\tNeed to think in terms of APIs, application services, and service-based integration that fulfills a  business need\r\n•\tService representation utilizes business description to provide context (i.e. business process, goal, rule, policy service interface and service component) and implements services using service orchestration\r\n•\tService orientation places unique requirements on the infrastructure; implementations should use open standards to realise interoperability and location transparency.\r\n•\tImplementations are environment specific; they are constrained by context and must be described within that context.\r\n•\tService orientation requires strong governance of service representation and implementation.\r\n•\tESDC needs to transform its acquisition of IT solutions from siloed systems to modern, modular service-based contracts exploiting common services.\r\n\r\nReferences:\r\n•\tTOGAF 9.2 Principle 6"},{"id":"id-4b6dcf6b33af4cf394c4e915947dec69","name":"Control Technical  Diversity","type":"Principle","layer":"motivation","documentation":"6.1.\tControl Technical Diversity \r\n\r\nName: \tControl Technical  Diversity\r\nStatement:\t‘Right-size’ the variety of technology platforms to use in alignment with our partners’ strategic choices (i.e. SSC, TBS).\r\nRationale:\r\n•\tLimiting the number of different supported technologies:\r\n    o\tImproves maintainability and reduces total cost of ownership.\r\n    o\tEnhances staff focus on standardized technologies and reduces staff competency requirements.\r\n    o\tImproves solution interoperability\r\n    o\tImproves synergy.\r\n\r\nImplications:\r\n•\tConsider benefits of introducing a new technology versus the required additional maintenance effort, additional staff competency requirements, increased complexity, and the potential lack of interoperability with existing technologies.\r\n•\tBalance controlling technical diversity and IT-enabled business innovation.\r\n•\tPrefer vendor-independent technologies to enable solution interoperability and avoid vendor lock-in.\r\n•\tReduce integration complexity by utilizing standardized integration approaches.\r\n•\tPolicies, standards, and procedures that govern acquisition of technology must be tied directly to this principle.\r\n•\tTechnology options will be constrained by the choices available within the supported standards. \r\n•\tTechnology options and preferred choices are published as “Technology Bricks” and governed through architecture governance. The “Bricks” are refreshed regularly to reflect appearance of new technologies and sunset of legacy technologies.\r\n•\tNeed to define and implement a lifecycle management process for all technology products\r\n\r\nReferences:\r\n•\tTOGAF 9 Principle 20"},{"id":"id-7bf8e7ac52a1446fa9aba6d35ef4ccf4","name":"Responsive Change Management","type":"Principle","layer":"motivation","documentation":"6.2.\tResponsive Change Management \r\n\r\nName: \tResponsive Change Management\r\nStatement:\tChanges to the enterprise information/data and technology environment are implemented in a timely manner\r\nRationale:\r\n•\tIf people are to be expected to work within the enterprise information /data and technology environment, this environment must be responsive to their needs\r\n\r\nImplications:\r\n•\tProcesses for managing and implementing  change must be developed that do not create delays\r\n•\tA user who feels a need for change will need to connect with a “business expert” to facilitate explanation and implementation of that need\r\n•\tIf changes are going to be made, the architecture must be kept updated\r\n\r\nReferences:\r\n•\tTOGAF 9.2  Principle 19"},{"id":"id-ea4d7384c6ab4426a76c1ef1f997e123","name":"Quality Level Metrics (QLM) Approach","type":"Principle","layer":"motivation","documentation":"6.3.\tQuality Level Metrics (QLM) Approach\r\n\r\nName:\tQLM Approach\r\nStatement:\tTechnology implementations require quality level metrics (QLM) negotiations and tradeoff discussions to occur as early as possible in the architecture and design process between business stakeholders and systems stakeholders including application architects, technology architects, service providers and operations and maintenance staff.\r\n\r\nRationale:\r\n•\tFacilitates non-functional requirements gathering \r\n•\tAvoids narrow discussions of requirements - business stakeholders will have a clearer idea of the system they are asking for / getting \r\n•\tBetter acceptance from the business on the system that is ultimately delivered – fewer surprises for both the business and I&IT \r\n•\tBetter fit of applications into the infrastructure \r\n•\tBetter security\r\n\r\nImplications:\r\n•\tNeed to ensure that processes, such as product selections, vendor of record, planning, requirements gathering, have quality level metrics as part of the requirements. The standard QLMs are:\r\n    o\tScalability - The ability of the solution to scale up or down to meet the increase/ decrease in volume through increasing/decreasing the number of nodes/servers supporting the solution (horizontal scaling) or increasing/decreasing the resources of a single node/server  (vertical scaling)\r\n    o\tPerformance - The ability of the solution to meet the load and response time requires\r\n    o\tAvailability  - The ability of the solution to meet recovery time objectives, recovery point objectives and system up time\r\n    o\tRecoverability - The ability of the solution to transaction recovery\\rollback, guarantee atomicity, transactional checkpoint logging and backup\r\n    o\tIntegrity - The accuracy, completeness and timeliness of data at rest or in transit within a solution\r\n    o\tInteroperability - The degree with which the system can connect to, exchange and process data from other systems.\r\n    o\tUsability - The ability and extent the solution can be used by specific users to achieve specified goals effectively and efficiently\r\n    o\tSource-ability - The degree to which equivalent solutions/services/components can be obtained from multiple sources\r\n    o\tAffordability - The characteristics of a product or service that  provides the government value for money and falls within their budget  through the expected life span of the product or service\r\n    o\tSupportability - The ease with which the solution can be operated, configured and maintained by the operational staff during the useful life of the solution\r\n    o\tAdaptiveness / Modifiability-The degree to which a module, component or other work product ban be used in more than one solution.\r\n    o\tUpgradeability - The ease in which the solution in whole or components of the solutions can be modified to take advantage of new service, solution, software or hardware technologies\r\n    o\tSecurity -The ability in which the solution meets the security objectives and standards \r\n•\tNeed to document, publish and enforce the requirement for quality level metrics when developing solutions, services and infrastructure"},{"id":"id-6a82302f04c944f9b59a595c3adb4f2d","name":"Security-By-Design","type":"Principle","layer":"motivation","documentation":"7.1.\tSecurity-by-Design\r\n\r\nName:\tSecurity-by-Design\r\nStatement:\tEnable and protect activities and assets of both people and enterprises are built-in to any business practice and corresponding IT solution\r\nRationale:\r\n•\tESDC’s  IM/IT assets are protected against theft, loss, damage, or unauthorized modification, destruction or disclosure to assure public confidence in the Department. \r\n•\tWhen security protection for confidentiality, availability and integrity are considered up front., it is more cost effective and results are more robust and resilient.\r\n \r\nImplications:\r\n•\tControls for the protection of confidentiality, integrity and availability must be designed into all aspects of solutions from initiation, not as an afterthought.  \r\n•\tSecurity must be designed in the business processes within which an IT system will be used.\r\n•\tESDC’s business solutions must be compliant with the Privacy Act; MITS; ATIP policies; FAA, etc.\r\n•\tSecurity requirements must be determined with all stakeholders. \r\n•\tBusiness driven security requirements based on legislation, policies, and business needs must be supported. \r\n•\tA consistent, trusted and effective security model must be developed for use across all applications, data, systems, and infrastructure.\r\n•\tSecurity Assessment and Audit (SA&A) , and Statement of Sensitivity (SoS) processes shall be used to identify threats and risks and select cost effective controls which meet control objectives. \r\n•\tA Vulnerability Assessment (VA) process shall be used to identifying and quantifying vulnerabilities in a system. \r\n•\tProgram managers need to have business impact analysis and business continuity planning processes developed and implemented. \r\n•\tProgram managers need to be part of the process to conduct the business impact analysis and to select contingency and business continuity plans. \r\n•\tBusiness impact analysis should be coordinated with value/risk analysis to identify potential countermeasures to exposures to the ESDC during the design of new business processes. \r\n•\tA controlled variance process must be adhered to.\r\n•\tAccountable parties are responsible for establishing or aligning to authorised purposes for their assets \r\n•\tRisk tolerances, breach mitigation and breach outcomes must be clearly defined beforehand.\r\n•\tEthically and legally, ESDC is obligated to protect Information / Data under its care to retain the right to manage and use it.\r\n•\tInformation / Data are sheltered from unauthorised access, modification, use, disclosure or destruction.\r\n•\tIntellectual property and confidentiality is safeguarded.\r\n•\tSharing must be balanced against classification, proprietariness or sensitivity of Information / Data.\r\n•\tAggregation of Information / Data, such as for residual data must also be reviewed for sensitivity.\r\n•\tSecurity must be applied at the appropriate level, i.e., data level versus application level.\r\n•\tSystems and Information / Data must be safeguarded from malevolent intentions and disaster.\r\n•\tEmerging technologies such as cloud and data lakes, must be accounted for in modernised policies,  standards and practices, and user awareness and training.\r\n•\tAnonymization or masking techniques may be necessary and utilised before permitting certain access.\r\n•\tSecurity controls must not hinder appropriate and timely access and sharing of assets s (e.g.  Information / data).\r\n\r\nGC Security Architecture \r\n•\tInformation categorization – As the originator of a record, each department is responsible for a plan, the implementation of information categorization systems and the review of data and information prior to release on the Open Government Portal (the “Portal”)\r\n•\tShould it be third-party information (government to government, government to industry, other), additional release mechanisms are up to department review \r\n•\tTraining and awareness on the requirements of the Portal is needed (to reduce additional work for other departmental stakeholders such as ATIP officer or Privacy analysts)\r\n•\tDepartments are also responsible to review the metadata and telemetry of datasets, to reduce the risk that combining smaller pieces of the data can enable a malicious user to action one of the risk scenarios\r\n•\tLegal and policy framework – Departments must continue to observe all domestic and international laws as they relate to handling resources, and should be respectful when considering which resources are being shared and released on the Portal\r\n•\tRespect for privacy and persons – Departments must protect personal information by not releasing it on the Portal\r\n•\tDepartments must ensure that all data and information released on the Portal contains no personal information or is properly de-identified/anonymized\r\n•\tDepartments should be transparent about how data and information will be collected, used and shared on the Portal\r\n•\tWithin an “Open by Default” environment, departments must identify situations and datasets which cannot be released or be made open by design\r\n•\tForward planning – Departments should consider privacy and security when releasing records on the Portal.  Considerations should include:\r\n•\tConsulting internally with business line and data / information owners / stewards to identify risks associated to the public, the organizations and the government as a whole\r\n•\tAssessing privacy and security on an ongoing basis, as due diligence does not end with uploading a record but rather an ongoing responsibility to maintain the accuracy and completeness of all records\r\n•\tMaking plans prior to the release of records for their maintenance and periodic reviews of the privacy and security implications of the universe of relevant records available on the Portal\r\n•\tAssigning clear accountabilities within departments and agencies for considering privacy and security implications of open government records\r\n•\tSecurity and Privacy Incidents and Remediation – Departments and agencies will take steps to ensure their ability to respond effectively in the case of a privacy or security incident\r\n•\tIn the event of any real or suspected security incidents, departments and agencies will respond in accordance with the Directive on Departmental Security Management (DDSM), departmental and agency processes and procedures, and when applicable the Cyber Security Event Management Plan (GC CSEMP)  \r\n•\tIn the event of any real or suspected privacy breach, departments and agencies will respond in accordance with the Directive on Privacy Practices. Departments and agencies should apprise themselves of TBS Guidelines for Privacy Breaches and the Privacy Breach Management Toolkit. These privacy instruments identify causes of privacy breaches, provide guidance on how to respond, contain and manage privacy breaches, delineate roles and responsibilities, and include links to relevant supporting documentation\r\n•\tConsiderations for maximizing release – When considering de-identifying information and data, the following should be noted:\r\n•\tDe-identification needs to be done by trained officials\r\n•\tSoftware for de-identification is not always available and may need to be developed\r\n•\tEffective de-identification may reduce the granularity of records and, as a result, data and information quality may decrease\r\n•\tDe-identification can be costly and require significant investments of resources, time, and data processing\r\n•\tExtrapolation or aggregation risks may persist in spite of de-identification efforts\r\n\r\nReferences:\r\n•\tCanada Border Services Agency (CBSA) defined Architecture Principles\r\n•\tCDO\r\n•\tSee decomposition in Open Web Application Security Project (OWASP)\r\n•\tGC Security and Privacy Guidelines- https://gcconnex.gc.ca/file/download/29788569"},{"id":"id-87140d22bd0a4173b38fd1ceece92fc8","name":"Privacy-By-Design","type":"Principle","layer":"motivation","documentation":"7.2.\tPrivacy-by-Design\r\n\r\nName:\tPrivacy-by-Design\r\nStatement:\tRespect and protect personal information are built-in to any business practice and corresponding IT solution.\r\n\r\nRationale:\r\n•\tESDC’s IM/IT assets are protected against theft, loss, damage, or unauthorized modification, destruction or disclosure in order to assure public confidence in the Department. \r\n•\tWhen security is considered up front the result is more cost effective, and the outcome is more robust and resilient security protections for privacy.  \r\n•\tInformation / Data capture, access and usage processes ensure the protection of privacy without impeding or delaying access to it for justified needs.\r\n\r\nImplications:\r\n•\tAll of the Departments’ business solutions must be compliant with the Privacy Act; MITS; ATIP policies; FAA, etc.\r\n•\tPrivacy requirements must be determined with all stakeholders. \r\n•\tEffective privacy administration processes and tools for assurance and accountability shall be required. \r\n•\tA controlled variance process must be adhered to.\r\n•\tMust align to necessary frameworks, both internal and external as pertains privacy protection (i.e., GDPR, Canadian laws and regulations).\r\n•\tAutomatic processing, trans-border and cross-entity flows of personal data create new forms of relationships among countries/entities and require compatible rules and practices be in place.\r\n•\tPersonal data shall not be transferred to any entity unless that entity ensures an adequate level of protection and authorisation from individuals.\r\n•\tCurrent legislation and competing values might be a hurdle to sharing and free flow of private data.\r\n•\tData Stewards must aid in removing or avoid creating unjustified barriers to private data.\r\n•\tWe must prepare for breaches to permit a timely and appropriate response and course of action.\r\n•\tPersonal data collection needs and uses must be clearly defined up front.\r\n•\tPersonal data shall be adequate, relevant and not excessive in relation to the purpose. \r\n•\tPrivate individuals must have the right and ability to view, edit their information, and the right to be forgotten in certain cases (i.e., data is disposed of at the end of the effective lifecycle of the data or process).\r\n•\tAutomated means of processing private data must be transparent to data subjects.\r\n•\tData classification will be necessary in all situations.\r\nReferences:\r\n•\tCanada Border Services Agency (CBSA) defined Architecture Principles\r\n•\tCDO\r\n•\tGovernment of Ontario. OPS Enterprise Architecture: Principles and Artefacts"},{"id":"id-3712452d2c9b4c64a2e2123ed31721dd","name":"Integrity-By-Design","type":"Principle","layer":"motivation","documentation":"7.3.\tIntegrity-by-Design\r\n\r\nName:\tIntegrity-by-Design\r\nStatement:\tProvide clients with a high degree of trust that the system and its attendant data and information are correct (i.e., precise, accurate and meaningful), valid (created, modified and deleted only by authorized users) and invariant (i.e., consistent an unmodified).\r\n\r\nRationale:\r\n•\tIntegrity is one of the three central pillars of securing corporate information assets along with confidentiality and availability. Integrity keeps data pure and trustworthy by protecting system and data from intentional or accidental changes. \r\n•\tWith data being the primary information asset, integrity provides the assurance that the data is accurate and reliable. Without integrity, the cost of collecting and maintaining the data cannot be justified. Therefore, policies and procedures should support ensuring that data can be trusted.\r\n•\tMechanisms put in place to ensure the integrity of the system, its data and information should prevent attacks on the storage of that data (contamination) and on its transmission (interference). Data that is altered on the network between the storage and the user's workstation can be as untrustworthy as the attacker altering or deleting the data on the storage media. Protecting data involves both storage and network mechanisms.\r\nImplications:\t•\tUnauthorized users must be prevented from making modifications to data or programs.\r\n•\tUnauthorized users must be prevented from making improper or unauthorized modifications.\r\n•\tInternal and external consistency of data and programs must be maintained.\r\n•\tApplying encryption to information that will be sent over the Internet or stored on digital media.\r\n•\tSoftware must be built defensively.\r\n•\tUsers should be prevented from inadvertently storing inaccurate or invalid data by incorrect data entry, an incorrect decision made in running programs, or not following procedures.\r\n•\tUsers should be prevented from affecting integrity through system configuration errors at their workstations or even by using the wrong programs to access the data.\r\n•\tUsers should be taught about devicde and data integrity during their information security awareness training.\r\n•\tThe installation of any new software or devices must be prevented except when done by a limited set of authorized people. \r\n•\tCheck system integrity against a set of predefined validation policies or standards.\r\n\r\nReferences:\r\n•\tSecurity Architecture Team"},{"id":"id-6e339f0fec064e6e8edb46978b1e4d89","name":"BDM Architecture Principles","type":"Principle","layer":"motivation","documentation":"BDM Architecture Principles \r\n\r\nProposed to BDM-ARC for endorsement (1-5 out of 10)\r\n1) BDM will implement a new Target Operating Model designed for the future. Transition will be gradual and iterative ensuring service continuity.\r\n2) BDM will consume a GC or ESDC enterprise solution/service where it exists and meets all BDM mandatory and majority of non-mandatory functional and non-functional requirements, as well as, when there is a commitment and plan for long-term investment in sustainment and support.\r\n3) BDM will favour investment in strategic solutions and technologies over investment in interim and tactical ones. \r\n4) Data is at the center of BDM. BDM embraces Data Management-by-design by building services and processes that support and enable appropriate data access, standards and quality for ESDC clients, partners and staff. BDM advocates leveraging data from an authoritative source. \r\n5) Digital First. BDM will design and implement digital interfaces to enable and encourage submission of information in a digital format through the digital channel and third-party systems and end-user applications.\r\n6) Open solutions by default, proprietary by exception. SaaS and COTS that support open standards are considered open solutions. Open source will be considered where appropriate. \r\n7) Balance Service and Security. Balance proactive and personalized Service Experience and Privacy.\r\n8) BDM will embed integrity and quality controls up-front and throughout processes and services. \r\n9) Cloud First. BDM will leverage cloud where appropriate and available.\r\n10) Minimize changes and write-back to legacy."},{"id":"id-bf82dc1967484d9faa494d8861e7599d","name":"13. Adoption of Event-Driven Architecture","type":"Principle","layer":"motivation","documentation":"BDM Architecture Principle 13: \r\nPrinciple:\tAdoption of Event-Driven Architecture\r\nStatement:\tPreference will be given to event-driven architecture to help build decoupled, responsive, adaptive and resilient solutions.\r\nRationale: \tModernization of digital channels and services, as well as planned advances in service delivery and common benefit processing, require ability to access data and process events and transactions in (near) real time. Solutions and services need to be designed to “react to events” and process them in (near) real time where desirable and to the extent possible.\r\nThis type of architecture adds a layer that further decouples architecture components, making the overall architecture more adaptive and resilient.\r\nImplications:\t•\tKey objective is to move from batch to predominantly (near) real-time services and transactions.\r\n•\tEvery integration should be considered for event driven approach. BDM will implement the most appropriate pattern for each integration with a view to move to event-driven integrations whenever this approach is aligned with the business processes the integration enables. \r\n•\tWe will assess supporting solutions and dependencies for their ability of being event driven and can participate without added complexity.\r\n•\tBest practices and lessons learned from previous successful implementations of these technologies will be consulted prior to making the decision.\r\n•\tWe do not recommend “Everything is an Event” approach. Complementary integration patterns exist and will be considered for integrations that are not natively event-driven. Data integration technologies are available too!\r\n•\tSelection and implementation of an Event Broker and Messaging Platform becomes high priority for Tranche 1.\r\n•\tCaveat: Cùram SPM includes OOTB batch processes that need to be implemented as defined by the platform. No previous implementations of Cùram were based on event driven architecture.\r\n•\tCaveat: This type of architecture requires highly-available and resilient network and infrastructure. Cost may increase.\r\n•\tCaveat: Will require high transaction rate through SCED which raises performance and bandwidth concerns.\r\n\r\n\r\nBDM EA WG: The principle is well received and supported by the architecture community. Despite caveats, this is a good principle to have to communicate desire to move from batch to predominantly real-time client services and transaction processing.\r\nRecommendation: Accept"},{"id":"id-a6fce31b0e8b4e11ad7f3fad8b78900e","name":"7. Security and Privacy-by-Design","type":"Principle","layer":"motivation","documentation":"BDM Architecture Principle 7: \r\nPrinciple:\tSecurity and Privacy-by-Design. \r\nStatement:\tBalance Service and Security. \r\nBalance Service and proactive and personalized Service Experience and Privacy.\r\nRationale: \tSecurity measure can present constraints for data collection and client interaction. Similarly, proactive and personalized service requires collecting and analyzing client data and proactively initiating interactions with the client which can be viewed as at odds with respecting client’s privacy. \r\nImplications:\t•\tBDM will seek to balance client and business needs with appropriate security measures. \r\n•\tEvaluation of architectures and proposed solutions in regards to applicable and supported security measures will be presented to BDM-ARC.\r\n•\tBDM will seek to reduce constraints related to data collection and data access and sharing, while maintaining a focus on privacy (e.g. leveraging a client consent-based model). \r\n•\tPrivacy considerations are key to legislation, operational policy, service and business rules design. Through architecture and solution design, BDM will ensure that their intent in regards to privacy is maintained in implementation."},{"id":"id-c4c39a9080b44970aca7f79a41ea3bce","name":"6. Open Solutions and standards","type":"Principle","layer":"motivation","documentation":"BDM Architecture Principle 6: \r\nPrinciple:\tOpen Solutions and standards. \r\nStatement:\tOpen solutions by default, proprietary by exception. SaaS and COTS that support open standards are considered open solutions. Open source will be considered where appropriate. \r\nRationale: \tIn an ideal scenario, solutions (or their components) are interoperable and substitutable: each one can be substituted easily and independently. This can be achieved only when solutions support open standards. \r\nImplications:\t•\tOpen standards and industry best practices are and will continue to be embedded in BDM architecture and functional and non-functional requirements.\r\n•\tProprietary solutions that do not support open standards or are not substitutable for any reason must be identified and granted an exception by BDM-ARC and EARB. \r\n\r\n\r\nNote on open standards and open source software (Reference: Open Standards Whitepaper on GitHub):\r\nThe following criteria define open standards:\r\nprocess for the standard's development is open and transparent to all interested parties and cannot be controlled by any single person or entity with any vested interests;\r\nplatform independent, vendor neutral and usable for multiple implementations;\r\nspecifications and supporting material are freely available with limited restrictions;\r\nsupported by the community and demonstrate independence or approved through due process by rough consensus among participants.\r\nOpen source software (OSS) is a way of developing and distributing software. The code is often written collaboratively, and it can be downloaded, used and changed by anyone.\r\nOpen source software (OSS) and open standards are separate concepts, however there are strong ties between them. OSS tends to use and help define open standards and publicly available specifications. OSS are, by their nature, publicly available specifications, and the availability of their source code promotes open, democratic debate around their specifications, making them both more robust and interoperable. "},{"id":"id-d76ad2aae99f4e55a21c363fc13297b5","name":"12. Maximize Use of Core Technology","type":"Principle","layer":"motivation","documentation":"BDM Architecture Principle 12: \r\nPrinciple:\tMaximize Use of Core Technology\r\nStatement:\tConsider leveraging capabilities and functionality of the Core Technology (Cùram Social Program Management) before considering other solutions and applications for common benefit processing and service delivery.\r\nRationale: \tLeveraging investment in the platform and making use of OOTB business logic and processes will greatly improve ESDC agility and ability to implement new benefits and implement changes to existing benefits and processes.\r\nAdditionally, this will reduce complexity of implementation and cost of ownership minimizing the need for integration with other dependant applications. \r\nImplications:\t•\tBusiness may have to accept that not all requirements will be fully met by the Core Technology solution. \r\n•\tDesign of some future state business processes may need to be adjusted to leverage OOTB business logic and processes.\r\n•\tEvolving business needs may require moving away from specific capabilities of the Core Technology solution in the future. This situation would trigger changes in architecture, transition to either specialized best of breed or enterprise solutions and possibly procurement. Principle #11: Architecting for Agility mitigates this implication.\r\n•\tCore Technology solution architecture becomes the architecture for the Common Benefit Delivery Platform.  \r\n•\tEnables alignment of the BDM solution evolution and improvements with the Cùram Social Program Management product roadmap and plans for future improvements.\r\n•\tSupports an MVP approach.\r\n•\tCaveat: Increased risk of vendor lock-in.\r\n\r\n\r\nBDM EA WG: The remaining principles would lead to the same conclusions and outcomes. The principle is redundant.\r\nCuram Capabilities Prototype did surface and supports the principle.\r\nRecommendation: Consult BDM ARC"},{"id":"id-ea3c30f9e0844254be27c5abd4fbd090","name":"8. Integrity & Quality-by-Design","type":"Principle","layer":"motivation","documentation":"BDM Architecture Principle 8: \r\n\r\nPrinciple:\tIntegrity & Quality-by-Design. \r\nStatement:\tBDM will embed integrity and quality controls up-front and throughout processes and services. \r\nRationale: \tEmbedded approach to integrity and quality management is required to move away from “pay-and-chase” model and enable continuous service improvement. \r\nImplications:\t•\tBDM will ease burden of proof on clients, based on risk and complexity profile, while maintaining compliance and integrity checks.  \r\n•\tClient risk, priority and complexity profile will result from integrity and quality controls embedded in processes and services.\r\n•\tQuality and continuous improvement will be embedded in all processes.\r\n\r\n"},{"id":"id-a499a11f352d41858bf3d5f3b44fb87c","name":"9. Cloud First","type":"Principle","layer":"motivation","documentation":"BDM Architecture Principle 9: \r\nPrinciple:\tCloud First. \r\nStatement:\tCloud First. BDM will leverage cloud where appropriate and available.\r\nRationale: \tCloud computing means providing infrastructure services and application services on demand. This is made possible through a high level of virtualization of hardware components by way of infrastructure service software. The result is highly scalable, elastic, available and programmable infrastructure. All these characteristics are of great importance to BDM. \r\nImplications:\t•\tBDM will leverage cloud where applicable, available and where it meets BDM security requirements. \r\n•\tAll cloud deployment options (including SaaS) will be explored and evaluated as part of the solution design.\r\n•\tBDM will ensure that requirements for performance, availability, and scalability (including peak traffic periods) are met by all BDM solutions and components (new and legacy) and the hosting infrastructure. \r\n"},{"id":"id-5cb8434ed9ed4954a1c93e33b1fae867","name":"5. Digital First","type":"Principle","layer":"motivation","documentation":"BDM Architecture Principle 5: \r\nPrinciple:\tDigital First. \r\nStatement:\tDigital First. BDM will design and implement digital interfaces to enable and encourage submission of information in a digital format through the digital channel and third-party systems and end-user applications.\r\nRationale: \tBDM target state characteristics include digitally enabled services and responsive, proactive and inclusive service experience. BDM goals, among others, include:\r\n•\tempowering clients to self-serve by providing an attractive, seamless and end-to-end service delivery option through the digital channel;\r\n•\tleveraging the support of NGOs, public and private sector partners to optimize and deliver a better, more impactful client outcomes.\r\nImplications:\t•\tBDM will design and implement new digital channel solutions that will enable seamless and accessible client self-service.\r\n•\tFunctionality will be exposed as services via APIs where applicable and of business value.\r\n•\tBDM will encourage and work with service delivery partners to change their existing systems or develop new end-user applications for their staff and clients to submit data to ESDC in a digital format.\r\n•\tProposed external APIs will be presented to BDM-ARC for review.\r\n"},{"id":"id-3bf938c80d8346c2879be5476065dbab","name":"1. New Target Operating Model and service continuity during the transition","type":"Principle","layer":"motivation","documentation":"BDM Architecture Principle 1: \r\nPrinciple:\tNew Target Operating Model and service continuity during the transition \r\nStatement:\tBDM will implement a new Target Operating Model designed for the future. Transition will be gradual and iterative ensuring service continuity.\r\nRationale: \tBDM service modernization and service ambitions cannot be realized with technology modernization only – a new Operating Model is required. BDM will modernize services that deliver over $122B annually to Canadians, many of which are mission critical as they support most vulnerable clients in the time of need. Disruption to the delivery of these services is unacceptable.\r\nImplications:\t•\tArchitectures and solutions proposed as strategic and target state will be evaluated against the new Target Operating Model.\r\n•\tTo ensure service continuity, co-existence model where new solutions and legacy operate in parallel will be required. \r\n•\tCo-existence model inherently leads to a greater complexity than the current or target state. Among different viable architectures that are fit to support the new Target Operating Model and co-existence, less complex ones will be favoured over more complex options.\r\n•\tEvaluation of  architectures and proposed solutions in regards to their ability to integrate and operate in a co-existence model will be presented to BDM-ARC."},{"id":"id-d04f2d93e1ae414cac7475ac9d3b6c7b","name":"11. Architecting for Agility","type":"Principle","layer":"motivation","documentation":"BDM Architecture Principle 11: \r\nPrinciple:\tArchitecting for Agility\r\nStatement:\tBDM solutions will be architected for agility, creating modular and flexible architecture and reducing risks of vendor lock-in. \r\nRationale: \tArchitecting for agility is a fundamental shift in delivering IT services, moving away from operational inefficiencies to flexible, decoupled solutions. It will position ESDC to adapt to technology changes and ever-changing client and business needs and expectations.\r\nOur objective is to create a flexible and resilient BDM architecture that enables agility to continuously innovate. An architecture that has greater agility will enable ESDC to have a more fluid and flexible technology landscape, setting us up to be more responsive and adaptable to future changes.\r\nImplications:\t•\tPlatforms and products that consist of individually deployable modules will be preferred over monolithic solutions.\r\n•\tSolutions and modules will be decoupled whenever possible without causing performance or latency issues.\r\n•\tArchitecture decisions will be made just in time to enable procurement and implementation. Making them too early may create undesirable constraints on the scope and technology options.\r\n•\tBDM will consider alternatives and keep them \"open\" as long as they remain viable. It should be recognized that not all technical decisions can be made at the same time: there is benefit to making some decisions later when they can be better informed by business decisions and through additional analysis and prototyping. \r\n•\tBDM will be prepared to refactor (change) architecture. Architecture work products will evolve and be further developed throughout the BDM Programme lifecycle. We will iterate and improve architecture periodically and as needed.\r\n•\tBDM will identify and analyze architectural dependencies and incorporate them into a responsive model: we will strive to integrate dependencies through loose coupling and have contingency plan when they are yet to be implemented.\r\n•\tCaveat: This principle will compete with Principle #3: Favour strategic over interim and tactical solutions. Tactical solutions may be necessary to help us achieve desired level of agility.\r\n\r\n\r\nBDM EA WG: The principle is well received and supported by the architecture community. It communicates that architecture practice is adapting and orienting to help enable business agility.\r\nRecommendation: Accept"},{"id":"id-27c62af6d5e342f98e3e425dae6f4c37","name":"4. Data is at the center of BDM","type":"Principle","layer":"motivation","documentation":"BDM Architecture Principle 4: \r\nPrinciple: \tData is at the center of BDM.\r\nStatement:\tData is at the center of BDM. BDM embraces Data Management-by-design by building services and processes that support and enable appropriate data access, standards and quality for ESDC clients, partners and staff. BDM advocates leveraging data from an authoritative source.  \r\nRationale: \tData has a great potential to support and inform better decisions both in service design and continuous improvement and in adjudicating and processing client applications and requests. To realize such potential, data needs to be relevant, reliable and available.  \r\nImplications:\t•\tBDM will strive to enable data driven approach to decision making in service design and continuous improvement .\r\n•\tBDM will enable data-as-a-service approach by enabling access to authoritative sources of data whenever possible. \r\n•\tData gathered once.\r\n•\tCollecting the same data from the client multiple times for the use in different programs will be avoided.\r\n•\tTransferring and replicating data will be done judiciously and only when necessary for functional or performance reasons.  \r\n•\tProposed data architectures, models and data flows will be presented to BDM-ARC for review.\r\n"},{"id":"id-14fc1d0c5c494ce9b5676a6530cb79eb","name":"2. BDM will consume GC and ESDC Enterprise Solutions/Services where appropriate and available","type":"Principle","layer":"motivation","documentation":"BDM Architecture Principle 2: \r\nPrinciple:\tBDM will consume GC and ESDC Enterprise Solutions/Services where appropriate and available.\r\nStatement:\tBDM will consume a GC or ESDC enterprise solution/service where it exists and meets all BDM mandatory and majority of non-mandatory functional and non-functional requirements, as well as, when there is a commitment and plan for long-term investment in sustainment and support.\r\nRationale: \tWith each decision to leverage an existing solution or service, BDM will inherit risks associated with the architecture, deployment, availability and operations of the solution/service. Solutions and services which may have not been designed for the scale required by BDM or lack appropriate investment commitments, product roadmaps and operational and support models, present a risk to the BDM Programme. \r\nImplications:\t•\tGC and ESDC Enterprise Solutions/Services will be evaluated against BDM requirements. If gaps are identified, it is expected that an investment and a project plan are put in place to close the gaps. \r\n•\tThe architecture of the GC and ESDC Enterprise Solutions/Services will be evaluated for alignment and compatibility with the BDM solution architecture. \r\n•\tBDM may present opportunities to enhance or modernize certain enterprise solutions and services. Such opportunities will be identified as architecture options and presented to BDM-ARC.\r\n"},{"id":"id-eefee88af4ac4b85879630201e232abc","name":"3. Favour strategic over interim and tactical solutions","type":"Principle","layer":"motivation","documentation":"BDM Architecture Principle 3:\r\nPrinciple:\tFavour strategic over interim and tactical solutions.\r\nStatement:\tBDM will favour investment in strategic solutions and technologies over investment in interim and tactical ones. \r\nRationale: \tStrategic solutions and technologies are those that are selected and deployed with a plan to support service delivery over a long term (10+ years). Tactical and interim solutions are both expected to be replaced by Strategic solutions, either in a relatively short time period (tactical) or over longer term (interim). \r\nImplications:\t•\tInvestments in interim and tactical solutions, unless required for legislative, significant business value/savings or service continuity reasons, will be presented as architecture options with generally lower score for EA alignment than strategic solutions.\r\n•\tBDM will support investments in interim and tactical solutions that are expected to deliver immediate business outcomes when they do not constitute an obstacle to the BDM implementation or significantly increase BDM technical debt. We advise to establish and monitor metrics for identified business outcomes throughout the lifecycle of the investment.\r\n•\tArchitecture of the interim or tactical solution may be reviewed if the solution needs to integrate with the BDM solution or support BDM implementation, for instance, by generating data and insights that would inform BDM service design and/or architecture."},{"id":"id-c201f5af16c449b39b671e13c4e623e0","name":"10. Minimize changes to legacy","type":"Principle","layer":"motivation","documentation":"BDM Architecture Principle 10: \r\nPrinciple:\tMinimize changes to legacy. \r\nStatement:\tMinimize changes and write-back to legacy. \r\nRationale: \tCo-existence model inherently leads to significant complexity. BDM needs to design deployment strategy, transition architecture, services, processes and integration between new solutions and legacy to control complexity and risk. One of the approaches to control complexity is to minimize changes to legacy.\r\nImplications:\tArchitecture objectives and planning assumptions (to be validated through prototyping):\r\n•\tThere will be one system of record for each transaction.\r\n•\tTransactions will be process either in the new or legacy system, not in both.\r\n•\tData will be accessed in the other system as needed.\r\n•\tCertain amount of data will be migrated to the new system.\r\n"},{"id":"id-f58acbceb7ac4f3abee5caf2a67ed827","name":"14. Outcome-Driven","type":"Principle","layer":"motivation","documentation":"BDM Architecture Principle 14: \r\nPrinciple:\tOutcome-driven (proposed by business architecture)\r\nStatement:\tArchitectural decisions will seek to maximize value to clients, partners, staff, ESDC, and the GoC driven by the overall Programme strategy.\r\nRationale: \tBDM will seek to realize benefits for clients, partners, staff, ESDC, and the GoC.  Decisions regarding the architecture of BDM should be primarily focused on delivering on the outcomes outlined in the strategy.\r\nImplications:\t•\tDecisions regarding the technical and solution architecture should be weighed against their ability to achieve strategic outcomes and impact on the targeted stakeholders\r\n•\tCapabilities delivered as part of the BDM programme, enabled by the technology, will be linked to the outcomes that they support, value they deliver, and benefits realized \r\n\r\n\r\nBDM EA WG: The principle is covered by the new GC Architecture Standards, therefore redundant. Also, the remaining principles would lead to the same conclusions and outcomes.\r\nRecommendation: Reject"},{"id":"id-67a03a63072648db96e22d49fc1615c5","name":"Design Principles","type":"Principle","layer":"motivation","documentation":""},{"id":"id-5e72be0059ed42abae13c5aa2b2954fd","name":"API Design Principles","type":"Principle","layer":"motivation","documentation":""},{"id":"id-690e5215d34045f3a535c113b1a80e9d","name":"Security by Design ","type":"Principle","layer":"motivation","documentation":"adopt a philosophy where security is inherent in API development"},{"id":"id-9559c8dfb8684b729ce3aeae905bc2cf","name":"Continuous Improvement ","type":"Principle","layer":"motivation","documentation":"actively improve and maintain API's over time by incorporating consumer feedback"},{"id":"id-b5cc33812e2a4238bee9db717d64acf0","name":"Sustainability ","type":"Principle","layer":"motivation","documentation":"avoid short-term optimizations at the expense of unnecessary client-side obligations"},{"id":"id-e0f0c0704e074deca20cf33b82d228ad","name":"Well Described ","type":"Principle","layer":"motivation","documentation":"adopt a simple, consistent and durable API specification and endpoint naming standard that includes API meta information"},{"id":"id-b537d3ba21d34737babb849199587163","name":"Consistency ","type":"Principle","layer":"motivation","documentation":"design API's with a common look and feel using a consistent style and syntax"},{"id":"id-86bf8dbcc66d4ab58293f0d1f4c1e60e","name":"Quality ","type":"Principle","layer":"motivation","documentation":"adopt a simple, consistent and durable API specification and endpoint naming standard that includes API meta informatio"},{"id":"id-df2e5af2f6a84a1ca95385cd36dbfb53","name":"Open Standards Based","type":"Principle","layer":"motivation","documentation":"stay compliant with the standard HTTP methods including status and error codes"},{"id":"id-bdf6220302c54ebbabb5001ef9dc4b02","name":"Simplicity and Reusability ","type":"Principle","layer":"motivation","documentation":"strive to make the API the best way for clients to consume your data"},{"id":"id-cc5bbdad729b4c8197b428bd0c5d66bc","name":"Government of Canada Digital Standards","type":"Principle","layer":"motivation","documentation":"https://www.canada.ca/en/government/system/digital-government/government-canada-digital-standards.html\r\nGovernment of Canada Digital Standards: Playbook\r\nFrom Treasury Board of Canada Secretariat\r\n\r\nImproving government services in the Digital Age\r\nOur goal is to provide public services to Canadians which are simple to use and trustworthy. The Government of Canada’s Digital Standards form the foundation of the government’s shift to becoming more agile, open, and user-focused. They will guide teams in designing digital services in a way that best serves Canadians.\r\n\r\nThese digital standards were co-created with the public and key stakeholder groups. They are living standards and they will continue to evolve over time as we better understand the complexities involved in putting them into practice."},{"id":"id-9237c3a7c94a4f6ebb51cd47b1e5157b","name":"Design With Users","type":"Principle","layer":"motivation","documentation":"Design with users\r\nResearch with users to understand their needs and the problems we want to solve. Conduct ongoing testing with users to guide design and development.\r\n\r\nGuidance: Design with users\r\nServices should not be built based on internal constraints or complexities of government, they should be built to address the needs of users. In order to deliver value to users, one must understand and prioritize their needs. Everything is a hypothesis until tested with the users of services.\r\n\r\nTo validate one's hypotheses, one must validate their assumptions through direct and frequent interactions with those who will be using the services. Users may be members of the public, or government employees or a combination thereof. Keeping in mind that users will come from diverse backgrounds, varying in location, experience, knowledge, and abilities, requirements for services are built first and foremost with the needs of all users. When designing services, one must take a holistic approach to service delivery -- from each member's individual contributions to the end goal, as defined by user requirements.\r\n\r\nAligned Behaviours\r\n1. End-user feedback is used to establish the requirements of our service(s).\r\n2. Our team has processes or tools in place for user feedback, including anonymous user feedback, to be incorporated into the design of the service.\r\n3. Our team conducts user research prior to deciding upon a given implementation. \r\n4. Our team has tested our primary systems in the users’ context with a wide range of users including users with varying needs and representing diverse backgrounds.\r\n5. Our team considers user needs and feedback in defining key service metrics.\r\n6. Our team uses automation to anticipate and detect operational or quality-of-service issues before our users tell us.\r\n7. Our team has within it, or direct access to, the expertise required to conduct user research and usability testing.\r\n\r\nMisaligned Behaviours\r\n1. Our team receives requirements through extensive documentation and builds against them.\r\n2. Our team does not involve internal or external users to collaborate on the design of the service.\r\n3. The technical development resources or IT senior management are prioritizing features.\r\n4. Our team's prioritization of tasks is driven by senior management.\r\n5. Senior executives and teams rely exclusively on desk-based research, or other proxy sources of information to inform policy, program and/or service design."},{"id":"id-5073e95c58cc4d859539977398ba388a","name":"Iterate and Improve Frequently","type":"Principle","layer":"motivation","documentation":"Iterate and improve frequently\r\nDevelop services using agile, iterative and user-centred methods. Continuously improve in response to user needs. Try new things, start small and scale up.\r\n\r\nGuidance: Iterate and improve frequently\r\nIn contrast to high risk and long lead time ‘big bang’ deployments, working services must be put in the hands of users as early as possible to get rapid feedback. Said feedback is then used to iterate upon to improve the service.\r\n\r\nOne sets a north star to define a clear direction, then begins iterating towards this north star, keeping in mind that the path is not clear, and unexpected circumstances will require adjustments to be made along the way. By leveraging modern technologies and modern approaches to working, risk can be reduced by limiting the size of changes and increasing their frequency. Processes should empower teams to deliver value to services as often as possible, rather than increase risk by creating prolonged processes that use documentation in place of demonstrably functioning software. Focus on working software over comprehensive documentation and remember that perfect is the enemy of good.\r\n\r\nAligned Behaviours\r\n1. There are processes in place to prioritize and implement feedback from peers, stakeholders and end-users.\r\n2. When a new or updated service or feature is being created our team understands the minimum requirements for the system to be of value to users.\r\n3. Our team experiments with new approaches based on team reflections, lessons learned, and user feedback.\r\n4. Our team collects metrics to improve upon which are used throughout the development and lifecycle of the service.\r\n5. When resolving problems our team dedicates time to identify the root cause of the issue and address it.\r\n6. Our team is relentlessly inspecting, adapting, and automating their processes to increase the speed at which our team can deliver value to users.\r\n7. Our team has access to environments and resources to allow for rapid prototyping while initial requirements are being sought.\r\n8. Our team embraces learning about and using new digital skills, approaches, and tools to incorporate into our daily work.\r\n\r\nMisaligned Behaviours\r\n1. Our team only shares their work once it has been finalized and approved.\r\n2. Decisions regarding the direction of our team are made without reference to any collected performance metrics.\r\n3. Our team identifies solutions before it is clear what outcomes our team is working towards and how to measure them.\r\n4. Processes are rarely, if ever, reviewed to find and implement efficiencies.\r\n5. Our team must wait for the project to be approved and funded prior to environments being made available to teams to begin experimenting with solutions.\r\n6. Our team fully architects the end to the service delivery solution prior to starting to build."},{"id":"id-d5f2ada307704ba69329e4a6a90d1058","name":"Work In The Open By Default","type":"Principle","layer":"motivation","documentation":"Work in the open by default\r\nShare evidence, research and decision making openly. Make all non-sensitive data, information, and new code developed in delivery of services open to the outside world for sharing and reuse under an open licence.\r\n\r\nGuidance: Work in the open by default\r\nWorking in the open increases the transparency of services, increases trust in government, creates an ecosystem that promotes innovation, prevents needing to reinvent the wheel by increasing collaboration within, and external to, government. Working in the open promotes understanding of government processes and services and creates an environment whereby innovation can take place throughout the Government of Canada and through non-governmental organizations leveraging the government data and information to improve service delivery for Canadians.\r\n\r\nThis way of working aligns Canada with the Digital Nations Charter, of which it is a signatory and promotes “transparency and citizen participation and uses open licences to produce and consume open data”, and the Open Data Charter. Further, by working in the open the Government of Canada can increase its reuse of existing public solutions and allow others to reuse work conducted by the Government of Canada. \r\n\r\nAligned Behaviours\r\n1. Teams continually makes all non-sensitive and non-personal data, information, and new code publicly available, or at a minimum accessible across the GC, for sharing and reuse.\r\n2. Our team contributes back to the public projects from which they borrow content.\r\n3. Our team tracks and makes public the metrics upon which our team measures its success.\r\n4. Our team tracks, and makes publicly available, or at a minimum accessible across the GC, information regarding how often a change to our services fails (e.g., the deployment or rollout of a service or feature experiences issues or complications).\r\n5. Our team makes visual displays which show what they’re working on and the status of their work available publicly, or at least throughout the Government of Canada.\r\n6. Our team publicly documents, including examples of reuse, how others can use their service’s APIs, open data, or information.\r\n\r\nMisaligned Behaviours\r\n1. All of the team's work is done on systems behind the corporate firewall.\r\n2. The work of our team has permissions set so that only members of our team can access the team's work.\r\n3. Our team does not contribute to, or collaborate on, work being done by our colleagues.\r\n4. Team applies blanket security classification for the digital system to all data stored by the application.\r\n5. Our team has no process by which to declassify and release records when they are no longer protected or classified.\r\n6. The documentation for our APIs is only available to internal approved consumers."},{"id":"id-881d110ef6ec40b8b8ab6807a70d9440","name":"Use Open Standards and Solutions","type":"Principle","layer":"motivation","documentation":"Use open standards and solutions\r\nLeverage open standards and embrace leading practices, including the use of open source software where appropriate. Design for services and platforms that are seamless for Canadians to use no matter what device or channel they are using.\r\n\r\nGuidance: Use open standards and solutions\r\nTo maintain the trust of Canadians, the government must continually learn and improve by embracing leading practices to simplify access to government services to match the rising expectations of Canadians.\r\n\r\nIn alignment with the Digital Nations Charter, which calls for both the use of Open Standards and Open Source, this Digital Standard aligns with the ultimate Digital Vision which reads, “The Government of Canada is an open and service-oriented organization that operates and delivers programs and services to people and businesses in simple, modern and effective ways that are optimized for digital and available anytime, anywhere and from any device.” By leveraging open source software, and leveraging open standards and solutions, the Government of Canada can mitigate vendor lock-in and expand its vendor pool from which to acquire digital services.\r\n\r\nAligned Behaviours\r\n1. Our team prioritizes solutions using open standards over solutions that do not.\r\n2. Team members give back to the open source community as active contributors.\r\n3. Our team designs their services to be interoperable with other services.\r\n4. When searching for a new product, service or solution, our team considers open source solutions.\r\n5. Our team supports clients using any device, from anywhere and at any time.\r\n\r\nMisaligned Behaviours\r\n1. Our team renews existing contracts with vendors without first investigating open source tooling.\r\n2. Our team does not have the competencies within it to deliver its services without the help of consultants or closed source vendor software."},{"id":"id-e52aaffc44144a7dad5322348bb855d6","name":"Address Security and Privacy Risks","type":"Principle","layer":"motivation","documentation":"Address security and privacy risks\r\nTake a balanced approach to managing risk by implementing appropriate privacy and security measures. Make security measures frictionless so that they do not place a burden on users.\r\n\r\nGuidance: Address security and privacy risks\r\nDigital services are core to service delivery, and they must securely store and manage the information of Canadians to maintain trust in government services.\r\n\r\nSecurity and privacy should be taken as a consideration from the onset of work for a given service, in alignment with Iterate and Improve. The implementation of security and privacy controls should be considered part of daily work. Similarly, processes should promote and monitor the continuous implementation of security and privacy controls throughout the lifecycle of a service. This will demonstrably increase the security and privacy posture of digital services by leveraging automated testing and real time reporting and monitoring over anecdotal document-heavy manual processes. Said processes, and the security and privacy controls themselves, should be frictionless, ensuring that services are designed first and foremost for users, not to satisfy existing legacy government procedures, tooling, or processes. Furthermore, by creating frictionless processes and permitting services to be iterated and improved upon quickly, the government is better situated to respond quickly to security or privacy risk. By responding to these operational needs within hours or minutes rather than months, the government can improve its security and privacy posture.\r\n\r\nAligned Behaviours\r\n1. Our team considers security and privacy throughout the service design process.\r\n2. When implementing or enforcing security or privacy controls, our team takes into consideration how they would impact the quality or efficiency of the service and how it will impact the end users of the service.\r\n3. Security measures are frictionless so that they do not place a burden on users.\r\n4. Our team has privacy and security knowledge and understanding as a competency within the team.\r\n5. The service has implemented automated security checks and privacy protections include role-based access and audit functions against the service.\r\n6. There are procedures and processes in place to quickly respond to security or privacy breaches or incidents.\r\n\r\nMisaligned Behaviours\r\n1. Team has no internal privacy or security knowledge, relying on other teams to identify nearly all security or privacy controls and best practices.\r\n2. The core services upon which our team works have no automated security checks or privacy protections.\r\n3. Our team relies on security through obscurity, hiding services or information rather than improving the security posture of the service.\r\n4. Our team implements or enforces security or privacy controls without considering the impact on service usability."},{"id":"id-1e8f784a84534bd1ab922a054229fb95","name":"Build In Accessibility From the Start","type":"Principle","layer":"motivation","documentation":"Build in accessibility from the start\r\nServices should meet or exceed accessibility standards. Users with distinct needs should be engaged from the outset to ensure what is delivered will work for everyone.\r\n\r\nGuidance: Build in accessibility from the start\r\nQuality should be built in from the start, preventing the need to revisit previously implemented components due to issues, such as accessibility. The faster and earlier issues are found the less costly they are to fix.\r\n\r\nAccessibility in Canada is about creating communities, workplaces and services that enable everyone to participate fully in society without barriers. The Government of Canada is committed to taking a proactive and systemic approach for identifying, removing and preventing barriers to accessibility without delay complementing the rights of persons with disabilities under the Canadian Human Rights Act. To meet these commitments, accessibility should be a consideration throughout the service development lifecycle. This requires that accessibility be monitored and built into our processes to continually promote alignment with accessibility standards. While iterating and improving frequently and designing with users, accessibility should be a key consideration, and become a source of work items throughout the service design lifecycle. When designing with users, efforts should be made to identify a wide variety of users with a wide variety of needs, to ensure accessibility standards are met or exceeded.\r\n\r\nAligned Behaviours\r\n1. Starting at the outset, our team's service and platform design continually considers the lowest levels of digital skill, confidence and access.\r\n2. Our team understands how to make their services or products accessible.\r\n3. Our team considers accessibility throughout the service design process.\r\n4. Research and testing are conducted to ensure our service is accessible to people of all abilities no matter how, where, or when they access the service.\r\n5. Our team conducts ongoing user research with users with low level digital literacy, people with disability, and people from different cultural and linguistic backgrounds.\r\n6. Our team implements automated accessibility checks for our services.\r\n\r\nMisaligned Behaviours\r\n1. Our team has no competency with accessibility and relies on another team to identify accessibility shortcomings.\r\n2. Accessibility compliance is added at the end of the development cycle in order to pass compliance checks or audits."},{"id":"id-eff823450c1742e0a60ad939dd26ad53","name":"Empower Staff to Deliver Better Services","type":"Principle","layer":"motivation","documentation":"Empower staff to deliver better services\r\nMake sure that staff have access to the tools, training and technologies they need. Empower the team to make decisions throughout the design, build and operation of the service.\r\n\r\nGuidance: Empower staff to deliver better services\r\nTo promote innovation and create agility within our organizations the teams that makeup our organizations must be empowered. Innovation increasingly flows from the bottom up rather than from the top down, and to benefit from this trend teams must be empowered.\r\n\r\nDon’t hire good people to tell them what to do, hire good people to have them tell you what to do. The government manages large, highly complex and crucially important services for their users. A top-down command and control approach to service delivery and designs enforces a structure that aligns to the structure itself, rather than to the needs of the users, or based on the expertise of those building the services. Rather than bringing information to authority, bring authority to the information. Those best suited to solve a given problem, are those closest to the problem. By removing decision-making authority from the teams into complex governance structures, the innovative potential of teams is mitigated by legacy governance procedures and processes. To create organizations that can iterate and improve frequently, teams must be empowered to make decisions for themselves. Complex architectures that are responsive to the needs of users, including users within the organization, are emergent and are not derived through the compilation of hypotheses lacking the expertise of those closest to the complex problems needing to be solved. \r\n\r\nAligned Behaviours\r\n1. Team members self-organize and self-manage through self-assigning tasks.\r\n2. Team members meet with liberty to openly discuss challenges without fear of blame or reproach.\r\n3. Team members feel safe to challenge the status quo.\r\n4. Our team values learning as part of daily work.\r\n5. Team members can articulate how their work contributes to business outcomes.\r\n6. Our team can choose the tools they use to deliver their service.\r\n7. Our team's management actively removes impediments that prevent the team from focusing on delivering value.\r\n8. Our team has access to environments to experiment with new approaches, tooling, or solutions.\r\n9. Our team feels their feedback is valued.\r\n10. Failures are treated in our team as opportunities to improve and learn.\r\n\r\nMisaligned Behaviours\r\n1. Work is assigned directly to members of our team from management.\r\n2. Our team is required to get a series of approvals prior to being able to make routine changes to their service.\r\n3. Learning in our team is largely done through week or day long courses periodically throughout the year.\r\n4. Our team is unable, or finds it difficult, to acquire productivity tooling.\r\n5. Our team does not have access to Software as a Service (SaaS) productivity tools as they are blocked by the department.\r\n6. On our team, learning through reading books, blogs, or watching videos, talks, or tutorials is not viewed as work.\r\n7. Our team has restricted access to tools, training and software based on job classification."},{"id":"id-3b3a2953ff51410da46b492a9cc0b0d5","name":"Be Good Data Stewards","type":"Principle","layer":"motivation","documentation":"Be good data stewards\r\nCollect data from users only once and reuse wherever possible. Ensure that data is collected and held in a secure way so that it can easily be reused by others to provide services.\r\n\r\nGuidance: Be good data stewards\r\nGood data stewardship is required to ensure data is clean, reusable, and managed responsibly to be leveraged for data driven decision making and promote reuse of information rather than duplication of efforts.\r\n\r\nThis involves managing data and information responsibly and securely, which supports the sharing and reuse of data throughout the Government of Canada and through promoting its use through innovative new solutions within the private sector. In alignment with working in the open by default, data and information should be published to be readable, by humans or by machines by publishing well organized data in machine readable formats. In alignment with iterating and improving frequently, efforts should be made to continually improve the quality of the data, and the quality of the processes used to manage and publish said data. Further, by working in the open by default and properly managing data and information sources, issues such as duplication of data and information and rework can be mitigated, while promoting the creation of innovative solutions which are able to leverage information collected and published by the government. \r\n\r\nAligned Behaviours\r\n1. Our team strives to leverage data to continuously improve decision-making, operations, or service delivery.\r\n2. Our team identifies what data is needed to support decision-making, operations, or service delivery and reuses existing data as appropriate before acquiring new data.\r\n3. Our team strives to identify and remove barriers to data sharing and release.\r\n4. Our team ensures that users of our services can make corrections to their personal information.\r\n5. Our team publishes data and information on the open government portal.\r\n6. Our team publishes data in plain language and machine-readable formats.\r\n7. Our team has clearly defined roles, responsibilities, and accountabilities for data and information management and use.\r\n8. Our team captures appropriate metadata to provide context for the information and data we create and capture, thereby enabling its discovery and reuse by others.\r\n9. Our team has processes in place to regularly assess, maintain, and improve data quality.\r\n10. Our service has in place processes for ensuring proper management of information and data prior to being collected, used, disclosed, retained, disposed of, or declassified.\r\n11. Our team ensures that information and data of business value are saved in systems where it can be properly managed.\r\n12. Our team has processes in place for determining the classification of data and information.\r\n13. Our team is aware of which information and data has business value and prioritizes its management.\r\n\r\nMisaligned Behaviours\r\n1. Our team, or the service our team manages, asks users for the same information more than once.\r\n2. The service, or services, our team is responsible for collects all the data or information required without reusing existing data or information.\r\n3. The documentation for our APIs is only available to internal approved consumers.\r\n4. Our team does not have the data it needs to make informed policy, program, or service decisions."},{"id":"id-5053208316404ad88ca7c1c183164a06","name":"Design Ethical Services","type":"Principle","layer":"motivation","documentation":"Design ethical services\r\nMake sure that everyone receives fair treatment. Comply with ethical guidelines in the design and use of systems which automate decision making (such as the use of artificial intelligence).\r\n\r\nGuidance: Design ethical services\r\nDesigning ethical systems means that systems created by the government ensures that everyone receives equitable treatment.\r\n\r\nServices should address client needs and provide public benefits. In the digital age, the underlying systems that run Canada’s services come to conclusions that can be opaque to both the external users, and those managing the systems. Efforts are required to increase the transparency and address potential biases of computational decisions, and to ensure that decisions made or supported using these systems are legal, consistent, accurate and align with the expectations and intents of those managing them. The responsible use of automated-decision systems includes being open about their use and being able to explain how decisions are made. Through iterative service design where results are continuously monitored against expected and desired outcomes, the organization positions itself to ensure it is designing ethical services. Furthermore, with extensive monitoring solutions, one must ensure their services are not enforcing biases, whether conscious or unconscious. \r\n\r\nAligned Behaviours\r\n1. Our team continually seeks out indicators of bias and ensures their services are not reinforcing unintended biases.\r\n2. Our team continually seeks out evidence of unintended consequences to the user in service design and delivery and works to mitigate these consequences for the user.\r\n3. When automated decision-making is being leveraged by our team, possible biases in the data and algorithms are acknowledged, accounted for, and mitigated.\r\n4. Our team designs services which address cultural, linguistic, geographical, disability, technological, socioeconomic, or other access barriers to uptake.\r\n5. Our team has considered the impacts of decisions on the users and negative outcomes are reduced, when encountered.\r\n6. Our team uses data in a manner consistent with the purpose of its collection.\r\n\r\nMisaligned Behaviours\r\n1. No training is provided to our team regarding the potential impacts of the service they are designing or delivering.\r\n2. Our team conducts little to no monitoring of outcomes of the service to identify implicit bias.\r\n3. Our team delegates ethical analysis to a vendor or external service, without direct accountability to management.\r\n4. Our team designs and deliver services without fully considering relevant legislation\r\n5. Our team delivers services without assessing the impacts of negative outcomes."},{"id":"id-ae20c26b0d8e47c6894c072e63b23542","name":"Collaborate Widely","type":"Principle","layer":"motivation","documentation":"Collaborate widely\r\nCreate multidisciplinary teams with the range of skills needed to deliver a common goal. Share and collaborate in the open. Identify and create partnerships which help deliver value to users.\r\n\r\nGuidance: Collaborate widely\r\nCollaborating widely allows us to learn from others to minimize mistakes already experienced and reduces work through identifying and sharing existing solutions. The problems that government solves are often unique, though they are not unique amongst governments.\r\n\r\nMany of the same solutions by the same, or similar vendors, are used throughout the world, or at varying levels of government within different jurisdictions. When designing a service, or implementing a service using tools or systems, identify which other departments, jurisdictions, or organizations, have leveraged similar technologies to solve similar use cases in order to collaborate widely, reduce work, share solutions, and benefit from lessons already learned by others. Furthermore, using multidisciplinary teams, especially when coupled with the empowerment of staff, the government improves its posture to deliver modern and innovative services. Through wide collaboration, organizations begin to break down the silos developed over time through the overreliance on functionally based teams. Going forward, working across skill sets, and leveraging work from others, while learning from their lessons, promotes the development of modern services better able to meet the changing needs of citizens in the digital age.\r\n\r\nAligned Behaviours\r\n1. Our team is multidisciplinary, having all the skills and capabilities required to fully deliver our service to users.\r\n2. Our team is active in communities of practice, events, or groups that pertain to the areas of expertise of team members.\r\n3. Our team has identified, and collaborates with, other teams, in or outside of our organisation, including other levels of government, other governments, the public, or private sector organizations, who have done, or are doing, similar work.\r\n4. Our team documents any APIs for our service using modern and common protocols and standards and provides examples to others regarding their use.\r\n5. Our team uses data from performance monitoring tools to inform business decisions.\r\n\r\nMisaligned Behaviours\r\n1. Our team develops most of the service on our own, without leveraging existing solutions and services to reduce duplication of effort.\r\n2. Our team overwhelmingly relies on tickets to manage collaboration between internal stakeholders or teams.\r\n3. The team does not consider the impacts on teams working across the value stream, or on the outcome of the service."},{"id":"id-39b2ae29b1964d22bd9d7fc3f8abfebe","name":"The Open Group Architecture Framework (TOGAF)","type":"Principle","layer":"motivation","documentation":"Architect selects principles affecting EA work throughout the ADM cycle.\r\n\r\nThe TOGAF® Standard, Version 9.2, The Open Group Standard (C182), published by The Open Group, April 2018; refer to: www.opengroup.org/library/c182"},{"id":"id-07659cdbcbec48eba218c1a72fa6fb18","name":"European Interoperability Reference Architecture (EIRA)","type":"Principle","layer":"motivation","documentation":"<European-Specific>"},{"id":"id-90261a52f29d414197a624bfe1624fca","name":"External Constraints","type":"Constraint","layer":"motivation","documentation":"Appendix B: Development of EA Principles\r\n\r\nThe development of architecture principles is typically influenced by the following :\r\n•\tExternal constraints: Market factors (time-to-market imperatives, customer expectations, etc.); existing and potential legislation."},{"id":"id-6670e30315994409a6ec2c7f38ad7542","name":"Existing Legislation","type":"Constraint","layer":"motivation","documentation":"Appendix B: Development of EA Principles\r\n\r\nThe development of architecture principles is typically influenced by the following :\r\n•\tExternal constraints: Market factors (time-to-market imperatives, customer expectations, etc.); existing and potential legislation."},{"id":"id-b6a704e878d7425cbcc58b749ee71a04","name":"Potential Legislation","type":"Constraint","layer":"motivation","documentation":"Appendix B: Development of EA Principles\r\n\r\nThe development of architecture principles is typically influenced by the following :\r\n•\tExternal constraints: Market factors (time-to-market imperatives, customer expectations, etc.); existing and potential legislation."},{"id":"id-f7da8d16078d4ee0a5a45f120b90faa9","name":"Market Factors","type":"Constraint","layer":"motivation","documentation":"Appendix B: Development of EA Principles\r\n\r\nThe development of architecture principles is typically influenced by the following :\r\n•\tExternal constraints: Market factors (time-to-market imperatives, customer expectations, etc.); existing and potential legislation."},{"id":"id-2245b191a825443584383dd5b09dae72","name":"Time-To-Market Imperatives","type":"Constraint","layer":"motivation","documentation":"Appendix B: Development of EA Principles\r\n\r\nThe development of architecture principles is typically influenced by the following :\r\n•\tExternal constraints: Market factors (time-to-market imperatives, customer expectations, etc.); existing and potential legislation."},{"id":"id-075baf59effb469db58611846d9143e0","name":"Customer Expectations","type":"Constraint","layer":"motivation","documentation":"Appendix B: Development of EA Principles\r\n\r\nThe development of architecture principles is typically influenced by the following :\r\n•\tExternal constraints: Market factors (time-to-market imperatives, customer expectations, etc.); existing and potential legislation."},{"id":"id-91f5143cd2a040a6b33df6370f044753","name":"Current Systems and Technology","type":"Driver","layer":"motivation","documentation":"Appendix B: Development of EA Principles\r\n\r\nThe development of architecture principles is typically influenced by the following :\r\n•\tCurrent systems and technology: The set of information resources deployed within the enterprise, including systems documentation, equipment inventories, network configuration diagrams, policies, and procedures."},{"id":"id-94e95a5373d9494a87a601f2ac19a390","name":"Emerging Industry Trends","type":"Driver","layer":"motivation","documentation":"Appendix B: Development of EA Principles\r\n\r\nThe development of architecture principles is typically influenced by the following :\r\n•\tEmerging industry trends: Predictions about economic, political, technical, and market factors that influence the enterprise environment."},{"id":"id-cf886bfc9c8143678452d3e58619f950","name":"Understandable Principles","type":"Requirement","layer":"motivation","documentation":"Step 2- Definition of the EA Principles: Once identified, the principles are further defined along the following five criteria and properly documented to fit ESDC’s business needs. EA Principles should be few in number and future-oriented.\r\n•\tUnderstandable: The intention of the principle is clear and unambiguous so that it can be quickly grasped and understood by individuals throughout the organization."},{"id":"id-1f02e530cf094ae5b2ce94048a8e6fd6","name":"Robust Principles","type":"Requirement","layer":"motivation","documentation":"Step 2- Definition of the EA Principles: Once identified, the principles are further defined along the following five criteria and properly documented to fit ESDC’s business needs. EA Principles should be few in number and future-oriented.\r\n•\tRobust: The principle will enable good quality decisions about architectures and plans to be made and enforceable policies and standards to be created. Each principle should be sufficiently definitive and precise to support consistent decision-making in complex, potentially controversial situations."},{"id":"id-a18525ebc1854758988906c5f0e97453","name":"Complete Principles","type":"Requirement","layer":"motivation","documentation":"Step 2- Definition of the EA Principles: Once identified, the principles are further defined along the following five criteria and properly documented to fit ESDC’s business needs. EA Principles should be few in number and future-oriented.\r\n•\tComplete: Every potentially important principle governing the management of information and technology for the organization is defined. The principles cover every situation perceived."},{"id":"id-7a5bb04259604c47aa8a8bb62f070508","name":"Consistent Principles","type":"Requirement","layer":"motivation","documentation":"Step 2- Definition of the EA Principles: Once identified, the principles are further defined along the following five criteria and properly documented to fit ESDC’s business needs. EA Principles should be few in number and future-oriented.\r\n•\tConsistent: Strict adherence to one principle may require a loose interpretation of another principle. The set of principles must be expressed in a way that allows a balance of interpretations."},{"id":"id-ce41ea126eaf45ba9b09fcfc5e9575cd","name":"Stable Principles","type":"Requirement","layer":"motivation","documentation":"Step 2- Definition of the EA Principles: Once identified, the principles are further defined along the following five criteria and properly documented to fit ESDC’s business needs. EA Principles should be few in number and future-oriented.\r\n•\tStable: Principles should be enduring, yet able to accommodate change. An amendment process should be established for adding, removing, or altering principles after they are initially ratified."},{"id":"id-df0e3eac01874ec2bed9622f31d3c34d","name":"EA Principles Value","type":"Value","layer":"motivation","documentation":"1.2.\tWhat are Principles?\r\nArchitecture principles are a set of statements that inform architecture decisions (e.g. “Doing the Right Thing”) and work (e.g. “Doing EA  Right”). \r\n\r\nBizbok and  TOGAF,  define principles as:\r\n•\tAn agreed upon truth that can guide one’s reasoning. (Bizbok 7.5 glossary)\r\n•\tEA principles are general rules and guidelines, intended to be enduring and seldom amended, that inform and support the way in which an organization sets about fulfilling its mission (TOGAF 9.2 Chapter 20.1).\r\nTo that end the essence of ESDC EA Principles are:\r\n•\tEA Assement Principles: “Doing the Right Thing” inform architecture decisions to ensure  the department is doing the right thing to acheive its strategic goals and act on its mandate.  \r\n•\tEA Program Principles: “Doing EA Right”,  inform architure work to ensure architectures are being developed and implemented the correct way.  (e.g TOGAF EA Principles, GC Architectural Standards)\r\n\r\nIn general, the EA Principles are high-level statements of the fundamental values that guide business and IM/IT decision-making. EA Principles the foundation for architectures, policies, standards and processes. Because the EA Principles define a value system, once they are defined and agreed upon, they are not likely to change frequently; however they will be reviewed on an annual basis.\r\n\r\nTo be effective, EA Principles must be considered as a set, not individually. It is common to have sets of principles form a hierarchy in those more detailed principles are informed by and elaborate on the principles at a higher level.\r\n\r\n•\tEnterprise Architecture Principles are comprised of:\r\n    o\tDomain Architecture Principles (Business, Information and Data, Application, Technology, Security & Privacy) \r\n    o\tReference Architecture Principles\r\n    o\tSecurity Architecture Principles\r\n    o\tSolution Architecture Principles\r\n        \tDesign Principles\r\n\r\nESDC Enterprise Architecture Principles are informed and constrained by the Government of Canada and the ESDC Service Strategy principles. Employment and Social Development Canada’s Service Strategy Overview\r\n\r\n1.5.\tValue of EA Principles\r\nThe EA Principles are intended to simplify, not complicate business decisions. They are most valuable in evaluating complex situations with multiple competing goals and where no clear rules or directives have been established. Conformance to the EA Principles as outlined in this document will:\r\n•\tOptimize business value and departmental benefits realization;\r\n•\tProvide a framework for assessing and prioritizing changes;\r\n•\tAllow for change to be accommodated in a less disruptive manner;\r\n•\tFacilitate the fulfilment of the business requirements;\r\n•\tLower the overall life cycle cost of applications;\r\n•\tImprove the manageability of the architectural components;\r\n•\tSupport an active vs. reactive approach to planning service delivery projects."},{"id":"id-b0f0d49b038e4e6f9d2c102f7d08514e","name":"Do The Right Thing","type":"Value","layer":"motivation","documentation":""},{"id":"id-1afe72919563452686e4b15db7cf04d7","name":"Do EA Right","type":"Value","layer":"motivation","documentation":""},{"id":"id-f9cf6ba79d3844e89a8b15d27db3a258","name":"Process Improvement","type":"WorkPackage","layer":"implementation_migration","documentation":"Appendix B: Development of EA Principles\r\nThe development of architecture principles is typically influenced by the following :\r\n•\tEnterprise strategic initiatives: The characteristics of the enterprise; its strengths, weaknesses, opportunities, threats, and its current enterprise-wide initiatives (such as process improvement and quality management)."},{"id":"id-51c3f654d39c41f99ef5b1664e53cdee","name":"SECURITY ARCHITECTURE","type":"Grouping","layer":"other","documentation":"Security architecture\r\nclick here for Security Architecture guide\r\nhttps://wiki.gccollab.ca/GC_Enterprise_Architecture/Framework/SecurityGuide\r\nThe GC Enterprise Security Architecture program is a government‑wide initiative to provide a standardized approach to developing IT security architecture, ensuring that basic security blocks are implemented across the enterprise as the infrastructure is being renewed."},{"id":"id-33d5ea68af85487ca3a78836962eb28f","name":"BUSINESS ARCHITECTURE","type":"Grouping","layer":"other","documentation":"Business architecture\r\nclick here for Business Architecture guide\r\nhttps://wiki.gccollab.ca/GC_Enterprise_Architecture/Framework/BusinessGuide\r\n\r\nBusiness architecture is a critical aspect for the successful implementation of the GC Enterprise Ecosystem Target Architecture. The architectural strategy advocates whole‑of‑government approach where IT is aligned to business services and solutions are based on re‑useable components implementing business capabilities in order to deliver a cohesive user experience. As such, it is essential that business services, stakeholder needs, opportunities to improve cohesion and opportunities for reuse across government be clearly understood. In the past these elements have not been a priority. It is expected that the IT culture and practices will have to change to make business architecture, in general, and these elements a primary focus."},{"id":"id-ce1b4695832248d8b181d1d0c55c02da","name":"INFORMATION ARCHITECTURE","type":"Grouping","layer":"other","documentation":"Information architecture\r\nclick here for Information/Data Architecture guide\r\nhttps://wiki.gccollab.ca/GC_Enterprise_Architecture/Framework/DataGuide\r\n\r\nInformation architecture includes both structured and unstructured data. The best practices and principles aim to support the needs of a business service and business capability orientation. To facilitate effective sharing of data and information across government, information architectures should be designed to reflect a consistent approach to data, such as the adoption of federal and international standards. Information architecture should also reflect responsible data management, information management and governance practices, including the source, quality, interoperability, and associated legal and policy obligations related to the data assets. Information architectures should also distinguish between personal and non‑personal data and information as the collection, use, sharing (disclosure), and management of personal information must respect the requirements of the Privacy Act and its related policies."},{"id":"id-5afcae26730748f6b22e912870634ff0","name":"TECHNOLOGY ARCHITECTURE","type":"Grouping","layer":"other","documentation":"Technology architecture\r\nclick here for Technology Architecture guide\r\nhttps://wiki.gccollab.ca/GC_Enterprise_Architecture/Framework/TechnologyGuide\r\nTechnology architecture is an important enabler of highly available and adaptable solutions that must be aligned with the chosen application architecture. Cloud adoption provides many potential advantages by mitigating the logistical constraints that often negatively impacted legacy solutions hosted “on premises.” However, the application architecture must be able to enable these advantages."},{"id":"id-df083d548605455bb28b9c2a798df80f","name":"APPLICATION ARCHITECTURE","type":"Grouping","layer":"other","documentation":"Application architecture\r\nclick here for Application Architecture guide\r\nhttps://wiki.gccollab.ca/GC_Enterprise_Architecture/Framework/ApplicationGuide\r\nApplication architecture practices must evolve significantly for the successful implementation of the GC Enterprise Ecosystem Target Architecture. Transitioning from legacy systems based on monolithic architectures to architectures that oriented around business services and based on re‑useable components implementing business capabilities, is a major shift. Interoperability becomes a key element, and the number of stakeholders that must be considered increases."},{"id":"id-12673f544ccb414fa146ddf6bd57abfe","name":"Enterprise Architecture Principles","type":"Grouping","layer":"other","documentation":"2.\tEnterprise Architecture Principles"},{"id":"id-9d95b8fe025b4d2d9e2abd116730f15e","name":"Business Architecture Principles","type":"Grouping","layer":"other","documentation":"3.\tBusiness Architecture Principles"},{"id":"id-6370b54bc17b42a8afce54a83c8abc23","name":"Information Architecture Principles","type":"Grouping","layer":"other","documentation":"4.\tInformation Architecture Principles"},{"id":"id-c8e6c49c7b644bfa87b06aee82c4a921","name":"Application Architecture Principles","type":"Grouping","layer":"other","documentation":"5.\tApplication Architecture Principles"},{"id":"id-0580bb9574ca4fd78c729fd624b015b6","name":"Technology Architecture Principles","type":"Grouping","layer":"other","documentation":"6.\tTechnology Architecture Principles"},{"id":"id-0a8faa1eba344a60b47dda1299aa6912","name":"Security and Privacy Architecture Principles","type":"Grouping","layer":"other","documentation":"7.\tSecurity and Privacy Architecture Principles"},{"id":"id-9c85f5a976d94353b68a1b0b4543d61e","name":"Architecture Principles Influencers","type":"Grouping","layer":"other","documentation":""}],"relationships":[{"id":"id-b3046cc1c72b494e8e63e84cae333239","sourceId":"id-df083d548605455bb28b9c2a798df80f","targetId":"id-8bb16ea2019d439cb22cf9f985c8d5ef","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-bf6f26b413dc447a87ff6137465effff","sourceId":"id-6e339f0fec064e6e8edb46978b1e4d89","targetId":"id-27c62af6d5e342f98e3e425dae6f4c37","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-2e006cb8d1dd44afb08bd7ca0ec1b7c8","sourceId":"id-6e339f0fec064e6e8edb46978b1e4d89","targetId":"id-a6fce31b0e8b4e11ad7f3fad8b78900e","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-629663adb1794d65b09dc609161bb50c","sourceId":"id-6e339f0fec064e6e8edb46978b1e4d89","targetId":"id-3bf938c80d8346c2879be5476065dbab","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-c96607960a124b03831f6a783f8aaa33","sourceId":"id-df083d548605455bb28b9c2a798df80f","targetId":"id-2d29e444c0b0480b96bef0376882f0cf","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-afdcd31d28e24dde9c992a26cf96c50d","sourceId":"id-6e339f0fec064e6e8edb46978b1e4d89","targetId":"id-d04f2d93e1ae414cac7475ac9d3b6c7b","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-076e7f4379c649459d2b34d09b5d45b5","sourceId":"id-9d95b8fe025b4d2d9e2abd116730f15e","targetId":"id-4555926650964bb9a9e55f2ba9c5a2f9","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-064544fe83d94b23826303b178fe0236","sourceId":"id-5e72be0059ed42abae13c5aa2b2954fd","targetId":"id-e0f0c0704e074deca20cf33b82d228ad","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-62d8f4120a194ff9b2a4cc55adf3a305","sourceId":"id-6e339f0fec064e6e8edb46978b1e4d89","targetId":"id-a499a11f352d41858bf3d5f3b44fb87c","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-77d67f80429547dab173433c469e9160","sourceId":"id-12673f544ccb414fa146ddf6bd57abfe","targetId":"id-749be72b93a14ea78a59d80baf67ea55","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-6223a56bd908420581fd6bbaaee58bdd","sourceId":"id-0580bb9574ca4fd78c729fd624b015b6","targetId":"id-7bf8e7ac52a1446fa9aba6d35ef4ccf4","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-7280f038cfa9447cb6888635667bb6a2","sourceId":"id-9d95b8fe025b4d2d9e2abd116730f15e","targetId":"id-469104cf6520468b97f9c31b727316c8","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-43e83b39d56f45969cb10639976e1d5e","sourceId":"id-15329c2ec0984676a5d31dc62094deb6","targetId":"id-5afcae26730748f6b22e912870634ff0","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-90bd18cb16e04278a86f9d2fd3cfe000","sourceId":"id-0580bb9574ca4fd78c729fd624b015b6","targetId":"id-ea4d7384c6ab4426a76c1ef1f997e123","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-fb261a20ee994ff59f474df0510b2847","sourceId":"id-51c3f654d39c41f99ef5b1664e53cdee","targetId":"id-8f35913fa62c46aa95b3db6bb1d31137","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-06f2b91153ab4546be815e4d203e3caa","sourceId":"id-6370b54bc17b42a8afce54a83c8abc23","targetId":"id-76b947541e344ed9bfd961befff4de36","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-7217f86e4d2442789f9bd62ea5a48561","sourceId":"id-12673f544ccb414fa146ddf6bd57abfe","targetId":"id-5a017ebeb18845338b729a1cc0d6d30c","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-211a96cae8be4096813f2919d348bf20","sourceId":"id-9d95b8fe025b4d2d9e2abd116730f15e","targetId":"id-bb5ce7eeba6f481395415871f94db000","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-8371bb055a54496d88ff3fb761f53c12","sourceId":"id-9f30c8075e1d4f919036446f1a21b561","targetId":"id-c8e6c49c7b644bfa87b06aee82c4a921","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-5eb8c5fbbbc4418681516e3b04993150","sourceId":"id-9d95b8fe025b4d2d9e2abd116730f15e","targetId":"id-7ca2cc3b895b4664830cefa7fe11317c","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-ded12aa3994f4ec3bedf25c8ff668a7b","sourceId":"id-15329c2ec0984676a5d31dc62094deb6","targetId":"id-df083d548605455bb28b9c2a798df80f","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-b62a043838a046e9b61cb6a15c3fc0dc","sourceId":"id-df083d548605455bb28b9c2a798df80f","targetId":"id-77b8de83e89041aeb38ce87dfb717c98","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-c04d3e818c43426293998a84402b9917","sourceId":"id-5e72be0059ed42abae13c5aa2b2954fd","targetId":"id-86bf8dbcc66d4ab58293f0d1f4c1e60e","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-a5708d91aa794822aea68855694f7faf","sourceId":"id-12673f544ccb414fa146ddf6bd57abfe","targetId":"id-4bb2e7919a5b4a7a96c945f278aae88c","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-9869c56dba554a218fefbca391a587f2","sourceId":"id-df083d548605455bb28b9c2a798df80f","targetId":"id-3641f5e0fefd43acb8def54c2ca001f0","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-e8372f5a64274f669de0cdd7bd1e3e62","sourceId":"id-9f30c8075e1d4f919036446f1a21b561","targetId":"id-6370b54bc17b42a8afce54a83c8abc23","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-dc0a445952ea4b798b87d96430c00027","sourceId":"id-6e339f0fec064e6e8edb46978b1e4d89","targetId":"id-5cb8434ed9ed4954a1c93e33b1fae867","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-2c19fbbea225435b94bc2932c559df84","sourceId":"id-33d5ea68af85487ca3a78836962eb28f","targetId":"id-404d349f65534e898d039ad0853d5074","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-2695f13732a242008b9298b00cfe40a8","sourceId":"id-c8e6c49c7b644bfa87b06aee82c4a921","targetId":"id-05878d3561334e86ac6cb473f7a167d4","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-bfa5806ac14c4995aaba6c7e750d083d","sourceId":"id-ce1b4695832248d8b181d1d0c55c02da","targetId":"id-448c2aa782304118898fef8e8479abc7","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-43e8acf1928c4db0bd2535d7931badc1","sourceId":"id-9f30c8075e1d4f919036446f1a21b561","targetId":"id-9d95b8fe025b4d2d9e2abd116730f15e","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-b3c8af0d9d4c4c8a9f0e520c850a69ee","sourceId":"id-ce1b4695832248d8b181d1d0c55c02da","targetId":"id-dbe7b737cdc545ee8b6ccc9069654bf2","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-a9fe7c3170714305831b1e805c1b61c3","sourceId":"id-6e339f0fec064e6e8edb46978b1e4d89","targetId":"id-c4c39a9080b44970aca7f79a41ea3bce","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-b1e4fe9d1abe4fc8a908ca07592449ec","sourceId":"id-5e72be0059ed42abae13c5aa2b2954fd","targetId":"id-690e5215d34045f3a535c113b1a80e9d","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-99edbeff83d14d4f853f658e3348693d","sourceId":"id-15329c2ec0984676a5d31dc62094deb6","targetId":"id-33d5ea68af85487ca3a78836962eb28f","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-90cf5406081e4dd78631693189f646a5","sourceId":"id-5afcae26730748f6b22e912870634ff0","targetId":"id-b6776927ba4e4993bf4fbd18225fc95e","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-aff2d1d273de40259fe14efe285a853c","sourceId":"id-6e339f0fec064e6e8edb46978b1e4d89","targetId":"id-c201f5af16c449b39b671e13c4e623e0","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-690c28616dbc4429aba5002e81f30d06","sourceId":"id-15329c2ec0984676a5d31dc62094deb6","targetId":"id-51c3f654d39c41f99ef5b1664e53cdee","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-8d3d8d6099744c1eb3ecba2543c8d1d1","sourceId":"id-15329c2ec0984676a5d31dc62094deb6","targetId":"id-ce1b4695832248d8b181d1d0c55c02da","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-af905197a88a470e977c89b50ecadd48","sourceId":"id-ce1b4695832248d8b181d1d0c55c02da","targetId":"id-727fb42a8f964adb909878b2629c3f51","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-29eca3a9234145bfa89b767ad244eb66","sourceId":"id-6e339f0fec064e6e8edb46978b1e4d89","targetId":"id-f58acbceb7ac4f3abee5caf2a67ed827","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-3659389a2ca74b6c8423748c7b004255","sourceId":"id-67a03a63072648db96e22d49fc1615c5","targetId":"id-5e72be0059ed42abae13c5aa2b2954fd","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-a0234b32153d4f9d85f37dc3b2c1f9be","sourceId":"id-12673f544ccb414fa146ddf6bd57abfe","targetId":"id-5624f1bcee4745679b4572731b4c7927","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-c6d5cf7b4eba496fb4a3dc9ba96d34f0","sourceId":"id-9f30c8075e1d4f919036446f1a21b561","targetId":"id-0a8faa1eba344a60b47dda1299aa6912","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-7c5fd83de6494f7eb85a7735017f6218","sourceId":"id-5afcae26730748f6b22e912870634ff0","targetId":"id-3f9c83091a194f82a9b6dfb07ae9b5f5","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-a9c738e9caf8486e8e9a29ff7648ab8d","sourceId":"id-6370b54bc17b42a8afce54a83c8abc23","targetId":"id-060f29eaa0f742caa6e713199b470b3d","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-bc76200466fc4eec821ad23360287241","sourceId":"id-c8e6c49c7b644bfa87b06aee82c4a921","targetId":"id-623ee8b6b1ab4b9bb694bef0ef775957","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-b2d08591cc3144fba704db7150b7097f","sourceId":"id-6370b54bc17b42a8afce54a83c8abc23","targetId":"id-507da9652f2b4a1a81b195e4586c3b38","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-87ca35e0081f4bc48c1e79aafdfed6a1","sourceId":"id-9f30c8075e1d4f919036446f1a21b561","targetId":"id-12673f544ccb414fa146ddf6bd57abfe","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-46f5bc7953f044e3a42738bac5139c5d","sourceId":"id-9f30c8075e1d4f919036446f1a21b561","targetId":"id-0580bb9574ca4fd78c729fd624b015b6","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-b17a857540ac490f86c6b9a605cd70b5","sourceId":"id-5e72be0059ed42abae13c5aa2b2954fd","targetId":"id-df2e5af2f6a84a1ca95385cd36dbfb53","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-e59a073ef208411ab9b33ebc9c88463f","sourceId":"id-33d5ea68af85487ca3a78836962eb28f","targetId":"id-67af2a04d9de44e4b0b4eae0de6c8fce","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-a7e168b0e7854a75be30f9db45c7170c","sourceId":"id-6370b54bc17b42a8afce54a83c8abc23","targetId":"id-1d85b944bcb84a1cb9e1747246ef95a3","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-ce06092272bd4812a95f35b083f93ecf","sourceId":"id-5afcae26730748f6b22e912870634ff0","targetId":"id-de0a273fff5944cc9fb97caa3b36249f","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-3639fb79cb7d4536bdb95f157957e841","sourceId":"id-5e72be0059ed42abae13c5aa2b2954fd","targetId":"id-b5cc33812e2a4238bee9db717d64acf0","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-59e9f28c60b1403ea63d39b465b1bb2e","sourceId":"id-9d95b8fe025b4d2d9e2abd116730f15e","targetId":"id-d9b1d2382d354e39ba6fecf0990832e1","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-de238f03a54a4dd5b3138bb90de14442","sourceId":"id-6e339f0fec064e6e8edb46978b1e4d89","targetId":"id-eefee88af4ac4b85879630201e232abc","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-f89e961bdd874624ae0d3b3c5a3a77e5","sourceId":"id-0a8faa1eba344a60b47dda1299aa6912","targetId":"id-3712452d2c9b4c64a2e2123ed31721dd","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-50373d4353714a519a62cbfd840b63ab","sourceId":"id-51c3f654d39c41f99ef5b1664e53cdee","targetId":"id-4dfbaa51425b4292aa82a79082e876f8","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-9368d01e61444f938284bbb968e5f1c9","sourceId":"id-5e72be0059ed42abae13c5aa2b2954fd","targetId":"id-bdf6220302c54ebbabb5001ef9dc4b02","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-6ec5249b72774b1b91417a4df9fa46bc","sourceId":"id-0a8faa1eba344a60b47dda1299aa6912","targetId":"id-6a82302f04c944f9b59a595c3adb4f2d","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-386a6ad12d7a47aeb8101c153d05491e","sourceId":"id-12673f544ccb414fa146ddf6bd57abfe","targetId":"id-9951330f78a440e3afac16423a0039a5","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-c06de272d75548f296884db19e9f7e9b","sourceId":"id-ce1b4695832248d8b181d1d0c55c02da","targetId":"id-91e8c32f2d474d42b3970b0ef865893d","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-de7af715d9ab401995d8e047c79bdeb1","sourceId":"id-6e339f0fec064e6e8edb46978b1e4d89","targetId":"id-bf82dc1967484d9faa494d8861e7599d","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-5057c097338a4fb98242e800a12fa911","sourceId":"id-5e72be0059ed42abae13c5aa2b2954fd","targetId":"id-9559c8dfb8684b729ce3aeae905bc2cf","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-c386e629ea4a40f2a285f51e61277274","sourceId":"id-0580bb9574ca4fd78c729fd624b015b6","targetId":"id-4b6dcf6b33af4cf394c4e915947dec69","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-bd6f4bb3907441de9823f4fe564ad42d","sourceId":"id-c8e6c49c7b644bfa87b06aee82c4a921","targetId":"id-cf5303b85e724ba7accf3c4065098655","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-d08f62cfe9544a9bb79e2685120af02e","sourceId":"id-9d95b8fe025b4d2d9e2abd116730f15e","targetId":"id-c63002cb67c9434cad69631a0c00ea5c","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-bff79ddfac3743ffb3b2b78d2c3fc7c3","sourceId":"id-6e339f0fec064e6e8edb46978b1e4d89","targetId":"id-ea3c30f9e0844254be27c5abd4fbd090","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-18e0cee7fe284e4fb276fb62f85b2cec","sourceId":"id-6e339f0fec064e6e8edb46978b1e4d89","targetId":"id-d76ad2aae99f4e55a21c363fc13297b5","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-f0c628a193e04d04bc3f63ae0432f7dd","sourceId":"id-6e339f0fec064e6e8edb46978b1e4d89","targetId":"id-14fc1d0c5c494ce9b5676a6530cb79eb","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-ec0eacab610044809f70808cb5d2ccec","sourceId":"id-6370b54bc17b42a8afce54a83c8abc23","targetId":"id-ad955162a2b34780afb1792abb9af37c","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-256a363b25af49538caa397f509e140d","sourceId":"id-0a8faa1eba344a60b47dda1299aa6912","targetId":"id-87140d22bd0a4173b38fd1ceece92fc8","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-3472ead5948f43aab1ce0584937449e5","sourceId":"id-5e72be0059ed42abae13c5aa2b2954fd","targetId":"id-b537d3ba21d34737babb849199587163","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-5f378a0c4c024eeb9b4454a95277130e","sourceId":"id-33d5ea68af85487ca3a78836962eb28f","targetId":"id-697a63e3dff4496d8a7f303b67a8b45a","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-f21ab02b419f448a9ee32c6aa172da19","sourceId":"id-51c3f654d39c41f99ef5b1664e53cdee","targetId":"id-089b9283fcfe4f9dab49a52f87988ef0","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-bb2f217a89634daea0c5462a703decef","sourceId":"id-e915f5cd24aa4a08843ae6624f70b21b","targetId":"id-33d5ea68af85487ca3a78836962eb28f","type":"ServingRelationship","name":"","documentation":""},{"id":"id-d679ce049626494a9dea46f8dd3507ad","sourceId":"id-2ccab90e065740b28b0bd1da735d097e","targetId":"id-ce1b4695832248d8b181d1d0c55c02da","type":"ServingRelationship","name":"","documentation":""},{"id":"id-5fd22cd9f7a8441db400491885a7500a","sourceId":"id-0f0d3bc67555416c95f7ca0591a213fc","targetId":"id-df083d548605455bb28b9c2a798df80f","type":"ServingRelationship","name":"","documentation":""},{"id":"id-fbac8c1597cc48deb83fd3c3fb62b942","sourceId":"id-cac3da86e3cc4be4852680c6b80bc6d5","targetId":"id-5afcae26730748f6b22e912870634ff0","type":"ServingRelationship","name":"","documentation":""},{"id":"id-00c7109531a64e8f8b62205d6c3ecb2e","sourceId":"id-b7f46e95259842168e25e4d39b07f811","targetId":"id-51c3f654d39c41f99ef5b1664e53cdee","type":"ServingRelationship","name":"","documentation":""},{"id":"id-a947e9fd8a394ef38baf0696921f462f","sourceId":"id-cc5bbdad729b4c8197b428bd0c5d66bc","targetId":"id-ae20c26b0d8e47c6894c072e63b23542","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-9dc0140f58ae4ac9b712c7ab5210ca96","sourceId":"id-cc5bbdad729b4c8197b428bd0c5d66bc","targetId":"id-5053208316404ad88ca7c1c183164a06","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-18f72de14f2a4a13aba35d760b04be85","sourceId":"id-cc5bbdad729b4c8197b428bd0c5d66bc","targetId":"id-881d110ef6ec40b8b8ab6807a70d9440","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-ba98392f21814e27b4d584763f886944","sourceId":"id-cc5bbdad729b4c8197b428bd0c5d66bc","targetId":"id-1e8f784a84534bd1ab922a054229fb95","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-70678c383ea74e86bddd74fffbf2379a","sourceId":"id-cc5bbdad729b4c8197b428bd0c5d66bc","targetId":"id-d5f2ada307704ba69329e4a6a90d1058","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-bae2355b91114209b35d7ecaebcb95b5","sourceId":"id-cc5bbdad729b4c8197b428bd0c5d66bc","targetId":"id-e52aaffc44144a7dad5322348bb855d6","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-dcbd56a38c12400a97828081798db498","sourceId":"id-cc5bbdad729b4c8197b428bd0c5d66bc","targetId":"id-9237c3a7c94a4f6ebb51cd47b1e5157b","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-507da89368cf407597aae8df4c20296e","sourceId":"id-cc5bbdad729b4c8197b428bd0c5d66bc","targetId":"id-3b3a2953ff51410da46b492a9cc0b0d5","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-f8e4baae4ddb4915826ea48bf70de5c0","sourceId":"id-cc5bbdad729b4c8197b428bd0c5d66bc","targetId":"id-eff823450c1742e0a60ad939dd26ad53","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-d76b69eea269460ea0f1cbc6e70f1eb8","sourceId":"id-cc5bbdad729b4c8197b428bd0c5d66bc","targetId":"id-5073e95c58cc4d859539977398ba388a","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-923fef95879d4ebdbae115ff664427aa","sourceId":"id-39a336dedad94299afeb7eaf5e0d7496","targetId":"id-9f30c8075e1d4f919036446f1a21b561","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-c18aebb77402495780d125bb918bf328","sourceId":"id-39a336dedad94299afeb7eaf5e0d7496","targetId":"id-15329c2ec0984676a5d31dc62094deb6","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-c67c331cd648435e8607b57a265bb224","sourceId":"id-39a336dedad94299afeb7eaf5e0d7496","targetId":"id-6e339f0fec064e6e8edb46978b1e4d89","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-34cd86dc36754f379c3d2e6204eec1ab","sourceId":"id-39a336dedad94299afeb7eaf5e0d7496","targetId":"id-67a03a63072648db96e22d49fc1615c5","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-094154ef63b048b280a1b69fa3a3b368","sourceId":"id-39a336dedad94299afeb7eaf5e0d7496","targetId":"id-5e72be0059ed42abae13c5aa2b2954fd","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-2c47603af1d74a0c86028c4ab01a40cd","sourceId":"8e4291ac-c9db-4b22-b510-ed9444955f13","targetId":"id-39a336dedad94299afeb7eaf5e0d7496","type":"AssociationRelationship","name":"","documentation":""},{"id":"id-bfaf587cc57d4366819f8b2182a571fe","sourceId":"id-39b2ae29b1964d22bd9d7fc3f8abfebe","targetId":"id-39a336dedad94299afeb7eaf5e0d7496","type":"AssociationRelationship","name":"","documentation":""},{"id":"id-bfba808306c14e939cacb65ff6b1b67d","sourceId":"id-07659cdbcbec48eba218c1a72fa6fb18","targetId":"id-39a336dedad94299afeb7eaf5e0d7496","type":"AssociationRelationship","name":"","documentation":""},{"id":"id-a3dc8a0d55a84920a10a2b5e08220574","sourceId":"id-23f28335374f49208cf1a2fa3299b78a","targetId":"id-6e339f0fec064e6e8edb46978b1e4d89","type":"AssociationRelationship","name":"","documentation":""},{"id":"id-d4a2019c1f3b4fb2a630530d1735fe72","sourceId":"id-8fc938c6350b4087bc1d405c90ba7a36","targetId":"id-bdc6adf323a94ac8ae5a137b0e866ec5","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-40ac2fc090204927811bf105ba9c3e4c","sourceId":"id-9c85f5a976d94353b68a1b0b4543d61e","targetId":"id-e19ec68d8c614e3aa5212bd96e89e094","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-7b9c7b8f40c84f6bbc34805912b008c7","sourceId":"id-9c85f5a976d94353b68a1b0b4543d61e","targetId":"id-95f0896e98f34df6b11d65b8928d157c","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-f50a6ccca51e45dcab0bd585253f2e1f","sourceId":"id-8fc938c6350b4087bc1d405c90ba7a36","targetId":"id-3eea7b58671546f6b37d99d022ccb87f","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-3905a7ada50245acb97dcff3018fa872","sourceId":"id-90261a52f29d414197a624bfe1624fca","targetId":"id-f7da8d16078d4ee0a5a45f120b90faa9","type":"AggregationRelationship","name":"","documentation":""},{"id":"id-e81efb83e7a14e34959447b83162c5d2","sourceId":"id-ed938b7d676547adb2fb90c24bac8201","targetId":"id-4dc0b07fa02243208634a5295a11cb64","type":"TriggeringRelationship","name":"","documentation":""},{"id":"id-111277fed78649f0aa45dff8b704701a","sourceId":"id-7e5571c0735943e8968c58563b5f52ed","targetId":"id-763269bca5ac49e28ac0293f553e4ae9","type":"SpecializationRelationship","name":"","documentation":""},{"id":"id-02fd55c29b1f47d8824f7414476d9a6c","sourceId":"id-a8783cd314384e48bce244fab6ffa8cb","targetId":"id-ce41ea126eaf45ba9b09fcfc5e9575cd","type":"RealizationRelationship","name":"","documentation":""},{"id":"id-5e88c73a9096418ba7b0ad394b09dbaf","sourceId":"id-3e0d95a2ce4a41c695a7fb4824ddd258","targetId":"id-bdc6adf323a94ac8ae5a137b0e866ec5","type":"TriggeringRelationship","name":"","documentation":""},{"id":"id-f132e3c8117f4b6f93f88d8447953609","sourceId":"id-fb4eb87d52e54e24a7546cc2b2eb3ed0","targetId":"id-8fc938c6350b4087bc1d405c90ba7a36","type":"TriggeringRelationship","name":"","documentation":""},{"id":"id-973b8dc12d004c67ab0a1ce5880acd95","sourceId":"id-a8783cd314384e48bce244fab6ffa8cb","targetId":"id-fb4eb87d52e54e24a7546cc2b2eb3ed0","type":"TriggeringRelationship","name":"","documentation":""},{"id":"id-62ca845936b8455db697d0671fdcb267","sourceId":"id-7e5571c0735943e8968c58563b5f52ed","targetId":"id-188e3622221947c092815ed926d19826","type":"SpecializationRelationship","name":"","documentation":""},{"id":"id-78a480a6b0ca48d79f5911e7528e2fd5","sourceId":"id-f7da8d16078d4ee0a5a45f120b90faa9","targetId":"id-2245b191a825443584383dd5b09dae72","type":"AggregationRelationship","name":"","documentation":""},{"id":"id-1c84732e5ef44415ace2900fceb8f921","sourceId":"id-7e5571c0735943e8968c58563b5f52ed","targetId":"id-45ea0f3890e04c2398d3eee18e53aba6","type":"SpecializationRelationship","name":"","documentation":""},{"id":"id-fde5ad8db64b477bbafbecffd113fc76","sourceId":"id-8fc938c6350b4087bc1d405c90ba7a36","targetId":"id-333c926e45e34fe49d9ba1db658d0942","type":"TriggeringRelationship","name":"","documentation":""},{"id":"id-e3cbbf0b28684f1598c12ea0571ff12a","sourceId":"id-90261a52f29d414197a624bfe1624fca","targetId":"id-b6a704e878d7425cbcc58b749ee71a04","type":"AggregationRelationship","name":"","documentation":""},{"id":"id-31e866fa974a4eceb6fdf3f53cda435e","sourceId":"id-df0e3eac01874ec2bed9622f31d3c34d","targetId":"id-b0f0d49b038e4e6f9d2c102f7d08514e","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-d0c1350854de4f0599aff21ebddfbcd5","sourceId":"id-a8783cd314384e48bce244fab6ffa8cb","targetId":"id-cf886bfc9c8143678452d3e58619f950","type":"RealizationRelationship","name":"","documentation":""},{"id":"id-114d147cc3574c21b9a9c18a695b0318","sourceId":"id-1ef66617b47244399aa8ba2505327641","targetId":"id-7e5571c0735943e8968c58563b5f52ed","type":"ServingRelationship","name":"","documentation":""},{"id":"id-a04e6f5eb35c4c44850397d4948d30d7","sourceId":"id-69e63f25daf74c9e8cb83cbb7da7ecf2","targetId":"id-88d8dd71dfde4c9bbbb5b2541c02b625","type":"RealizationRelationship","name":"","documentation":""},{"id":"id-fa1c146c9e23487ea4357162106329e5","sourceId":"id-4dc0b07fa02243208634a5295a11cb64","targetId":"id-3eea7b58671546f6b37d99d022ccb87f","type":"TriggeringRelationship","name":"","documentation":""},{"id":"id-9185eb04b053407ea3a49d0af9c9f851","sourceId":"id-a8783cd314384e48bce244fab6ffa8cb","targetId":"id-1f02e530cf094ae5b2ce94048a8e6fd6","type":"RealizationRelationship","name":"","documentation":""},{"id":"id-62ed297fa47e4add9b2b706a90f5ca8d","sourceId":"id-a8783cd314384e48bce244fab6ffa8cb","targetId":"id-7a5bb04259604c47aa8a8bb62f070508","type":"RealizationRelationship","name":"","documentation":""},{"id":"id-568d89ce3cf24187b74a328289e813a8","sourceId":"id-90261a52f29d414197a624bfe1624fca","targetId":"id-6670e30315994409a6ec2c7f38ad7542","type":"AggregationRelationship","name":"","documentation":""},{"id":"id-fc41eeb9b48e4ab3ba936772fd5e6018","sourceId":"id-3eea7b58671546f6b37d99d022ccb87f","targetId":"id-3e0d95a2ce4a41c695a7fb4824ddd258","type":"TriggeringRelationship","name":"","documentation":""},{"id":"id-89f8e8f46c234866874fa9e608dc1bb3","sourceId":"id-7e5571c0735943e8968c58563b5f52ed","targetId":"id-13b1ac42338649c4b5468d6b6d2c5699","type":"SpecializationRelationship","name":"","documentation":""},{"id":"id-168584c43ef2451da719df5683372efe","sourceId":"id-f9cf6ba79d3844e89a8b15d27db3a258","targetId":"id-88d8dd71dfde4c9bbbb5b2541c02b625","type":"RealizationRelationship","name":"","documentation":""},{"id":"id-40f8007a04b84ffdbfcaf81ef336d415","sourceId":"id-8fc938c6350b4087bc1d405c90ba7a36","targetId":"id-ed938b7d676547adb2fb90c24bac8201","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-9e4e92c7b0bf4f20bc21c4e184328893","sourceId":"id-3b8fe32b5f3f4f598f4ea6866f4dd7e0","targetId":"id-fb4eb87d52e54e24a7546cc2b2eb3ed0","type":"AssignmentRelationship","name":"","documentation":""},{"id":"id-ed4ec733a6b643bd81aa1464dde0488d","sourceId":"id-7e5571c0735943e8968c58563b5f52ed","targetId":"id-c45b8163560b4bcc9acbe0968e5ce4cb","type":"SpecializationRelationship","name":"","documentation":""},{"id":"id-78f89c14d8e94fd991e653a456ab3e9d","sourceId":"id-9c85f5a976d94353b68a1b0b4543d61e","targetId":"id-94e95a5373d9494a87a601f2ac19a390","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-a9b9d512f7c24877b0f9a08d0e5c7f50","sourceId":"id-f7da8d16078d4ee0a5a45f120b90faa9","targetId":"id-075baf59effb469db58611846d9143e0","type":"AggregationRelationship","name":"","documentation":""},{"id":"id-ab8b48f6c4644585b0610a5746d054e2","sourceId":"id-df0e3eac01874ec2bed9622f31d3c34d","targetId":"id-1afe72919563452686e4b15db7cf04d7","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-ea61423be1aa4ae6902e11bcff02671f","sourceId":"id-9c85f5a976d94353b68a1b0b4543d61e","targetId":"id-90261a52f29d414197a624bfe1624fca","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-55aaa222e12a4bfea949488d059c3a30","sourceId":"id-0d9a152a37f5437e90ae37e053041abe","targetId":"id-bdc6adf323a94ac8ae5a137b0e866ec5","type":"AssignmentRelationship","name":"","documentation":""},{"id":"id-41072b122b1f4042abfb214008a1a18a","sourceId":"id-a8783cd314384e48bce244fab6ffa8cb","targetId":"id-a18525ebc1854758988906c5f0e97453","type":"RealizationRelationship","name":"","documentation":""},{"id":"id-bf046243317f4ef58a24291b13362adc","sourceId":"id-8fc938c6350b4087bc1d405c90ba7a36","targetId":"id-4dc0b07fa02243208634a5295a11cb64","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-806074ba05144ce39a466407d833cb82","sourceId":"id-19c79bed868a48b789e45ef17958e442","targetId":"id-a8783cd314384e48bce244fab6ffa8cb","type":"TriggeringRelationship","name":"","documentation":""},{"id":"id-5320557bb44a4eeaab8929b7d10f306d","sourceId":"id-8fc938c6350b4087bc1d405c90ba7a36","targetId":"id-3e0d95a2ce4a41c695a7fb4824ddd258","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-03d05d419dd74576b34744d25492f65f","sourceId":"id-9c85f5a976d94353b68a1b0b4543d61e","targetId":"id-91f5143cd2a040a6b33df6370f044753","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-9a278bc183dd440282efc2186268c5ba","sourceId":"id-9c85f5a976d94353b68a1b0b4543d61e","targetId":"id-88d8dd71dfde4c9bbbb5b2541c02b625","type":"CompositionRelationship","name":"","documentation":""},{"id":"id-d54ed9d7618a42b09a927f304035ece1","sourceId":"id-9c85f5a976d94353b68a1b0b4543d61e","targetId":"id-9f30c8075e1d4f919036446f1a21b561","type":"InfluenceRelationship","name":"","documentation":""},{"id":"id-aa59b6cf55464e36bf4e55eccf1e2d85","sourceId":"id-df0e3eac01874ec2bed9622f31d3c34d","targetId":"id-9f30c8075e1d4f919036446f1a21b561","type":"AssociationRelationship","name":"","documentation":""}],"views":[{"id":"id-dc57a92e642d471ba09bac71d469f377","name":"ESDC Principles Catalog","viewpoint":"","documentation":""},{"id":"id-587522dedc9247c1a899198982fc52fd","name":"GC EA Framework","viewpoint":"","documentation":""},{"id":"id-a470d3a6e96949dbac47bc04992b2204","name":"GC Digital Standards","viewpoint":"","documentation":""},{"id":"id-60c009a9721b40cf8da91bbb90ff54fc","name":"ESDC Principles Catalog HL","viewpoint":"","documentation":""},{"id":"id-43dd4db1e054496fa396c8a17f69e077","name":"BDM Architecture Principles","viewpoint":"","documentation":""},{"id":"id-eb5e5c39929f4fa9a19ded6bc1279120","name":"ESDC EA Principles","viewpoint":"","documentation":""}]}