{"id":"4bb4b2d6","name":"ServiceNow","documentation":"","file":"../../raw-data/github/archimate/SMAG v8.archimate","format":"ARCHIMATE","source":"","timestamp":"15-06-2023 03:28:47","tags":[],"archiVersion":"3.1.1","language":"","elements":[{"id":"8a503796","name":"Budgeting","type":"BusinessProcess","layer":"business","documentation":""},{"id":"075fbf35","name":"Accounting","type":"BusinessFunction","layer":"business","documentation":""},{"id":"8aed9f55","name":"Charging","type":"BusinessProcess","layer":"business","documentation":""},{"id":"f47e0d68","name":"IT Financial Management","type":"BusinessProcess","layer":"business","documentation":""},{"id":"0a7bd17b","name":"Budget Owner","type":"BusinessActor","layer":"business","documentation":"Budget owners can view all items that budget keys are associated with, such as budget plans and forecasts.\n\nBudget owners are users in the instance that you can associate with a budget plan. Create a budget owner record to give a user the budget_owner role, which grants access to budget plans and forecasts.\n\n"},{"id":"0609e555","name":"Budget Admin","type":"BusinessActor","layer":"business","documentation":"Role: budget_admin\n"},{"id":"2f46ec2b","name":"Budget Key Owner","type":"BusinessActor","layer":"business","documentation":"Budget key owners are also users in the instance that you can associated with a budget key, and thereby budget plans as well. Budget key ownership can be full or limited:\n\nFull access allows the owner to access everything associated with the budget key, including budget plans and forecasts, targets, and budget key expenses.\nLimited access allows the owner to see only the budget plans they own and the items in those plans.\nBudget key owners also have the same level of access to the items associated with child budget keys."},{"id":"e08c04f4","name":"Budget Analyst","type":"BusinessActor","layer":"business","documentation":"Role: ?\n"},{"id":"ef73bdc7","name":"Cost Admin","type":"BusinessActor","layer":"business","documentation":"cost_transparency_admin"},{"id":"8dab2caa","name":"Company","type":"BusinessActor","layer":"business","documentation":""},{"id":"8e9c9750","name":"Financial Management","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"152ed138","name":"Cost Management","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"f4ab94d8","name":"ServiceNow","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"2ea1db1a","name":"Financial System","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"19ff834b","name":"General Ledger","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"c2292107","name":"Chart of Accounts","type":"DataObject","layer":"application","documentation":""},{"id":"122f2140","name":"IT General Ledger","type":"DataObject","layer":"application","documentation":"The general ledger: A list of your organizational expenses.\nthe general ledger contains all expenses for your organization for all fiscal periods."},{"id":"0939c504","name":"Cost Model","type":"DataObject","layer":"application","documentation":""},{"id":"ff894a0a","name":"GL Data Import","type":"ApplicationCollaboration","layer":"application","documentation":"Financial data resides in the General Ledger Staged Data table.\n\nYou can import financial data into the General Ledger Staged Data [itfm_gl_data_staged] table by using either of the following methods:\n\nImport sets\nEasy import\nSee Import sets.\nAttention: Be sure that your fiscal calendar can be used with your financial data.\n"},{"id":"8f42a49a","name":"Allocation Engine","type":"ApplicationComponent","layer":"application","documentation":"The core of the application that uses your cost model to calculate expenses and determine how to allocate expenses."},{"id":"e57b74d1","name":"Fiscal Period","type":"DataObject","layer":"application","documentation":"The fiscal period: The timeframe during which expenses were incurred. You can work with only one fiscal period at a time."},{"id":"d9fe1e40","name":"Financial Reports and Dashboards","type":"ApplicationService","layer":"application","documentation":"Graphical representations of the expense allocations that show you where your expenses are coming from."},{"id":"9da59fe0","name":"Budget Model","type":"DataObject","layer":"application","documentation":"A budget model is the foundation of your budget.\n\nA budget model is necessary for each budget key. Create as many budget models as necessary to classify budgeted expenses based on the segments that you can specify through their relationships.\n\nBudget analysts and budget admins can see any budget model. Budget owners can see only the budget models associated with budget keys that the budget owner has access to.\n\nBudget models replace budget definitions, starting with the Helsinki release.\n\n"},{"id":"02281798","name":"Create Budget Model","type":"ApplicationFunction","layer":"application","documentation":"Create a budget model that can be used by cost allocations and budgets.\n\nBefore you begin\n\nRole required: budget_admin\nAbout this task\n\nWhen you are creating a budget model, select segments in a hierarchy and then generate a budget key for the model.\n\nProcedure\n\nNavigate to Financial Planning > Administration > Budget Model.\n\nClick New.\n\nFill out the fields on the Financial Model form (see table).\n\nRight-click the header and select Save.\n\nTable 1. Budget Model form fields\nField\tDescription\nName\tA descriptive name for the model.\nData Source\tThe source of the financial data. Use the General Ledger Staged source. Only use the Cost Plan Breakdown if you activate and use the Project Portfolio Suite with Financials (com.snc.financial_planning_pmo) plugin. Portfolio actuals do not come from the staged general ledger. They are located in cost plan breakdowns in the Project Portfolio Suite.\nModel Owner\tThe user who owns the model.\nUsed by Cost Allocation\tIf the model can be used by cost models. You can select this option if you also want the budget model to be used as a cost model.\nUsed by Budgeting\tIf the model can be used by budgets. Select this option.\nDescription\tA detailed description for the model.\nImportant budget model actions\nGenerate Budget Keys\tCreates budget keys based on the segment relationships.\nGenerate Actuals\tCreates financial actuals in the Budget actuals table [itfm_gl_actuals], which the budget console and the budget variance report use.\nRelated list\nSegment Relationships\tThe relationships between the segments associated with this budget model. The segments are used when you generate budget keys for the model. Create segments relationships as necessary.\n"},{"id":"c3601efe","name":"Budget Key","type":"DataObject","layer":"application","documentation":"A budget key is a unique combination of values that the application uses to identify budget forecasts and budget plans.\n\nNote: Budget keys replace account codes, starting with the Helsinki release.\n\nStructure\n\nYou can define the structure of the budget key by specifying the segments/code combination from the general ledger, such as the cost center, department, location, vendor, or any attributes. The budget key is a unique combination of values for these attributes. The combination of values is in a budget model hierarchy on a budget model.\n\n"},{"id":"df557988","name":"Budget Plan","type":"DataObject","layer":"application","documentation":"Budget plans specify expenses for assets, contracts, labor, and certain configuration items (CIs) for a fiscal period, particularly one in the future. Use budget plans as the basis to compare your actual versus planned expenses.\n\nBudget plans are associated with a budget key and a fiscal period. If you have financial data over several financial periods, make a separate plan for each period.\n\nThere are several types of items you can add to the budget plan. The costs of these items are broken down over the fiscal period that you specify for the plan. See Budget items and Budget item breakdowns for more information.\n\nBudget plan expense amount types\n\nBudget plans show these types of expense amounts:\n\nTarget amounts: An amount that you set as a goal to reach or a limit not to exceed. A target amount is created for a specific fiscal period and account code combination. When you select the account code and fiscal period for the budget plan, the target amount is automatically populated in the read-only target fields. There are targets for both operating and capital expenses.\nBudgeted amounts: A rollup of all the budget plan items, which appear as related lists on the Budget Plan form. Only items marked as capital expenses do not roll up to the amount fields. There are budgeted amounts for both operating and capital expenses.\nBudget plan ownership\n\nBudget plans have a single owner, who must have the budget_owner role. Whoever you chose as the budget owner must also be associated with the budget plan's budget key as an owner.\n\nBudget plan parent-child relationships\n\nBudget plans can have one or more sub-plans, which roll up their actual budget amounts to the parent budget plan. You cannot promote child plans individually. Only the top-level plan in a hierarchy can be promoted.\n\nThe same account codes can be used for parent and any or all child plans, if necessary. Child plans can also have account codes that are lower in the hierarchy. For example, if the parent's account code is IT finance, the child plan's account code could be IT finance > Auditing Service, or similar. If you have multiple sub-plans with the same account codes, the amounts roll up from all subplans to the forecast.\n\nChanging the fiscal period parent plan cascades the change down to all sub-plans. See Budget owners and budget key owners for more information.\n\nBudget plan promotion\n\nYou can promote a budget plan to a budget forecast, based on the plan's account code and fiscal period. The forecast helps you predict the expenses your organization will incur. See Budget forecasts for more information.\n\nCreate a budget plan\nAfter you have configured your budget target and account codes, create a budget plan.\n\nCopy a budget plan\nYou can use any plan as a basis for creating a new plan.\n\nBudget items\nThe items that comprise a budget plan come from several other applications in an instance, including Asset Management, Project Management, and Configuration Management. This enables you to budget your expenses for items across your IT infrastructure.\n\n"},{"id":"b23efb5d","name":"Generate Budget Keys","type":"ApplicationFunction","layer":"application","documentation":"Budget keys can be generated using Generate Budget Keys from the model. To generate budget keys, the segments used in the budget model have to be mapped to the data source column in the field map, if by default they were not mapped already. By default, the application has field mapping with cost center, vendor, location, department, and project. If you are using any code combination segments in the budget model hierarchy other than these segments mentioned, then it has to be explicitly mapped in the data source field map.\n\nIf there is an error when you manually generate budget keys, then verify the data source field map.\n"},{"id":"5e7f7d9f","name":"Segments","type":"DataObject","layer":"application","documentation":""},{"id":"7930a261","name":"Generate from model ","type":"ApplicationFunction","layer":"application","documentation":"Generate budget keys from a budget model if you do not want to create them manually one by one.\n\nBefore you begin\n\nRole required: budget_admin\nAbout this task\n\nProcedure\n\nNavigate to Financial Planning > Administration > Budget Model.\n\nOpen the desired budget model.\n\nEnsure that your mappings are defined on all the segments used in the model hierarchy.\n\nClick the Generate Budget Keys button at the bottom of the list.\n\nIf you add more general ledger data and generate the keys again, the application generates only new keys based on the changed data. It does not regenerate the same keys, nor does it create duplicate keys.\n\n"},{"id":"86d83799","name":"Assign ","type":"ApplicationFunction","layer":"application","documentation":"Assign budget key to budget owner\n"},{"id":"84baf3d1","name":"Create Manually","type":"ApplicationFunction","layer":"application","documentation":"Create a budget key manually when you want to specify specific segment records that comprise the key, as allowed by the budget definition.\n\nBefore you begin\n\nRole required: budget_admin\nProcedure\n\nNavigate to Financial Planning > Administration > Budget keys.\n\nClick New.\n\nFill out the form fields (see table).\n\nClick Submit.\n\nTable 1. Account Code form fields\nField\tDescription\nName\tDescriptive name for the account code.\nSegments\tThe segments associated with this budget key. These segments are set in the budget model in the Segment Relationships related list. Select a value for the root segment identified in the budget definition."},{"id":"545b9b14","name":"Generate Actuals","type":"ApplicationFunction","layer":"application","documentation":""},{"id":"9fe51835","name":"Budget Actuals","type":"DataObject","layer":"application","documentation":"Account code, or budget key, expenses are records that show general ledger amounts for a budget key. The amounts are aggregated for each fiscal period.\n\nThe expenses in the Account Code Expenses [itfm_gl_actuals] table are used by the budget console for calculations of actual expenses. Normally you do not need to create or modify data in this table.\n\nFinancial administrators can access account code expenses from the Financials > Administration > Budget actuals module. The expenses are populated when you click Generate Actuals on the Financial Model form."},{"id":"335241d2","name":"Budget Console","type":"ApplicationInterface","layer":"application","documentation":"The target amount also appears on the Review tab of the Budget Console. You can edit the amount through the console."},{"id":"32acda7d","name":"Workbench","type":"ApplicationInterface","layer":"application","documentation":"Financial Management Workbench\n"},{"id":"2d37fcb1","name":"Use the budget variance report","type":"ApplicationService","layer":"application","documentation":"Use the budget variance report\nUse the Budget Variance report to see how expenses compare to budgets for cost centers, departments, locations, and vendors.\n\nAbout this task\n\nWhen you access this report, you can only see the budget data for the budget keys that the user in the Budget Owner choice list actually owns.\n\nProcedure\n\nNavigate to Financial Planning > Budget Planning > Variance. The report opens in another tab or window.\n\nClick the gear icon (gear icon) to configure settings for the report:\n\nTable 1. Report configuration options\nSetting\tDescription\nBudget Model\tShows budget data for the selected model.\nGroup by\tThe main segments you want to group by. Select the segment from the choice list. To change the segments, modify the ITFM_BudgetVariance script include.\nSubgroup by\tThe segment you want to group by under the main segment. Select the segment from the choice list.\nDisplay description instead of name\tHow you want to display the segment in the report. Click the switch to use the display description instead of the name of the department, vendor, and so on.\nUse Year-to-Date Instead of Fiscal Periods\tSets the available time period for the data. Click the switch icon next to Use Year-to-Date instead of Fiscal Periods to use data for the current year. Turn off the switch to use fiscal periods, one of which you can select with the Fiscal Period choice list.\nFilter the report as needed.\n\nTable 2. Budget variance report filters\nAction\tProcedure\nFilter by a budget variance\tEnter the low end and high end of the range in the left and right-hand text boxes under Filter out by Variance. For example, to show only the budgets where the difference between the actual amount and the budgeted amount is between -1000 and 1000, enter (1000) in the left text box and 1000 in the right text box.\nShow data for a specific fiscal period and budget model.\tSelect the period from the Fiscal Period and Budget Model choice lists.\nShow data for a specific budget owner.\tSelect a user from the Budget Owner choice list. This list is filtered to show only the budget owners under you in the budget owner hierarchy.\nShow budget data for capital or operating expenses\tSelect the Operating or Capital check boxes\n- Business Management Financial Management, Istanbul"},{"id":"cc29385a","name":"Budget Forecast","type":"DataObject","layer":"application","documentation":"Budget forecasts provide a projection of expenses taken from a budget plan.\n\nYou create a budget forecast by promoting a budget plan. When you do, the application creates a forecast and a read-only copy of the budget plan that the forecast refers to. This allows you to modify the budget plan without changing the forecast.\n\nBudget forecast components\n\nThe budget forecast includes these items.\n\nInherited budget plan values: important values from the plan, including the budget plan key.\nOverrides: an amount you can specify to override, or replace, the final forecast amount.\nBudget forecast items: the budget items from the budget plan.\nBudget forecast breakdowns: A breakdown of the Amount value into monthly units.\nPromote a budget plan\nAfter you review the budget plan and agree to the numbers, you can promote it to a forecast. The forecast becomes a benchmark for the same fiscal period specified by the plan.\n\nOverride a budget forecast amount\nIf you do not want to keep the forecast amount, you can override it with a value of your own.\n\nBudget forecast breakdowns\nThe total cost in a budget forecast is divided into smaller units called breakdowns, which are taken from the budget plan.\n"},{"id":"7f089ff2","name":"Promote a budget plan ","type":"ApplicationFunction","layer":"application","documentation":"After you review the budget plan and agree to the numbers, you can promote it to a forecast. The forecast becomes a benchmark for the same fiscal period specified by the plan.\n\nBefore you begin\n\nRole required: budget_admin\nNote: All items must have an account number associated with them before you can promote the budget plan.\nProcedure\n\nOpen a budget plan.\n\nClick Promote.\n\nNote: The application creates a forecast and a read-only copy of the project plan that the forecast refers to. This allows you to modify the project plan without changing the forecast.\nNavigate to Financial Planning > Budget Planning > Budget Forecasts.\n\nClick the forecast Display Name to open it.\n\nVerify the information on the form and related lists (see table).\n\nIf you make any changes, click Update.\n\nField\tDescription\nDisplay Name\tThe name derived from the budget plan\nBudget Key\tThe budget key used by the plan.\nAccount Number\tAn account associated with the forecast.\nBudget Owner\tThe budget plan's owner, who also has access to this forecast.\nBudget Plan\tThe budget plan from which the forecast was derived.\nFiscal period\tThe fiscal period from the budget plan.\nAmount\tThe Budget Amount from the plan. This value populates the Final Amount field unless you use an override.\nOverride Amount\tAn amount that can replace the amount in the Final Amount field. Enter an amount if you want to ignore the value in the Amount field.\nFinal Amount\tThe final amount that is taken from the Amount field, or, if you are using an override, the Override Amount field.\nOverride Category\tThe category for the override.\nTarget\tThe target amount for the account code on the budget forecast. The target amount may not be the same as the target on the budget plan because there may be multiple account codes on the budget plan that each generates a budget forecast. This is because the budget forecast is for a fiscal period + account code combination.\nRelated Lists\nBreakdown\tA breakdown of the Amount value into monthly units. Double-click the fields in the list to edit them or click the record icon to open the breakdown.\nBudget Forecast Items\tThe items inherited from the budget plan."},{"id":"60d0dd58","name":"Breakdowns ","type":"DataObject","layer":"application","documentation":"Budget forecast breakdowns: A breakdown of the Amount value into monthly units.\n\nThe total cost in a budget forecast is divided into smaller units called breakdowns, which are taken from the budget plan.\n\nThe breakdowns are used to calculate the value in the forecast's Amount field.\n\n"},{"id":"ea54df95","name":"Override forecast ","type":"ApplicationFunction","layer":"application","documentation":"f you do not want to keep the forecast amount, you can override it with a value of your own.\n\nBefore you begin\n\nRole required: budget_admin\nAbout this task\n\nYou can also override the amounts in budget breakdowns. The override value is used in the forecast's Amount field. However, any value you use as an override in the forecast completely overrides the value in the Amount field.\n\nIf you are using the budget console, you can edit the value of the Override column if you add that column to the view on the Review tab. See The budget console for more information.\n\nProcedure\n\nNavigate to Financial Planning > Budget Planning > Budget Forecasts.\n\nOpen a forecast.\n\nEnter the override value in the Override Amount field.\n\nSelect an optional Override Category. See Create a budget override category for more information on these categories.\n\nEnter comments in the Override Note field.\n\nClick Update.\n\n"},{"id":"50bb7671","name":"Import budget data ","type":"ApplicationService","layer":"application","documentation":"You can use the platform's Easy Import feature to import budget data into the Budget Item table. A transform map is available by default to transform the data and create a budget plan, account code, budget items, and a budget owner.\n\nBefore you begin\n\nYou must set up a budget definition. Configure the spreadsheet with any or all the following columns, which represent segments:\nDepartment\nLocation\nVendor\nCost Center\nBusiness unit\nBusiness service\nPortfolio\nProject\nShared service\nCustom columns (up to four): additional segments.\nYou do not need all of these columns. Only include the ones you need for your budget data. The values in each of the rows is the same as the value in the Name field of each of the segments.\n\nYou must be familiar with the Easy import feature and transform map scripts. The transform map used in this topic is named importBudgetItemTranform.\n\nSee Import sets.\n\nRole required: budget_admin\nAbout this task\n\nThe transform map performs the following actions:\n\nConcatenates strings to provide an account code.\nGets an account code by querying the account codes or by creating a new one.\nCreates a budget item for each row in the spreadsheet.\nAssociates the budget items to a budget plan by finding a plan in the Budget Plan table or by creating one.\nPromotes the budget plan to a forecast.\nProcedure\n\nCreate a table named u_itfm_budget_stage.\n\nImport the spreadsheet data into the u_itfm_budget_stage table using the Easy Import feature.\n\nRun the transform map importBudgetItemTranform. This transform processes data from the Source u_itfm_budget_stage table to the Target Budget Item [itfm_budget_item] table.\n\nNavigate to Financial Planning > Budget Planning > Final Budgets to confirm the budget data and records that were created and make modifications.\n\n"},{"id":"1891a735","name":"Create Budget Plan","type":"ApplicationFunction","layer":"application","documentation":"After you have configured your budget target and account codes, create a budget plan.\n\nBefore you begin\n\nRole required: budget_admin, budget_analyst, budget_owner\nAbout this task\n\nThis procedure explains how to create a budget plan with a blank form. You can also copy an existing budget plan.\n\nProcedure\n\nNavigate to Financial Planning > Budget Planning > Budget Plans.\n\nClick New.\n\nFill in the Budget Plan form fields (see table).\n\nRight-click the form header and select Save from the context menu. The related lists and links appear.\n\nClick Preview to see what your budget plan would look like. The Budget Preview window looks like the Budget Console, except that you cannot change the budget model, budget key, or fiscal period. The data comes from the pre-promoted budget plan and includes sub-plans.\n\n"},{"id":"903f187e","name":"Generate Actuals","type":"ApplicationFunction","layer":"application","documentation":"\nAfter you have configured your budget target and account codes, create a budget plan.\n\nBefore you begin\n\nRole required: budget_admin, budget_analyst, budget_owner\nAbout this task\n\nThis procedure explains how to create a budget plan with a blank form. You can also copy an existing budget plan.\n\nProcedure\n\nNavigate to Financial Planning > Budget Planning > Budget Plans.\n\nClick New.\n\nFill in the Budget Plan form fields (see table).\n\nRight-click the form header and select Save from the context menu. The related lists and links appear.\n\nClick Preview to see what your budget plan would look like. The Budget Preview window looks like the Budget Console, except that you cannot change the budget model, budget key, or fiscal period. The data comes from the pre-promoted budget plan and includes sub-plans.\n\n"},{"id":"03c5d0fc","name":"Create Budget Targets ","type":"ApplicationFunction","layer":"application","documentation":"A budget target is an estimated amount of money for a specific fiscal period and budget key combination for operating and capital expenses. Use budget targets to set up a financial goal for a budget plan.\n\nBefore you begin\n\nRole required: budget_admin, budget_analyst, budget_owner\nProcedure\n\n"},{"id":"08b505e8","name":"Copy a budget plan","type":"ApplicationFunction","layer":"application","documentation":"You can use any plan as a basis for creating a new plan.\n\nBefore you begin\n\nRole required: budget_admin\nAbout this task\n\nWhen you copy a plan, an exact replica of the plan and all its items is created, with the word copy appended to the name.\n\nProcedure\n\nNavigate to Financial Planning > Budget Planning > Budget Plans.\n\nClick a plan to open the Budget Plan form.\n\nClick Copy Plan.\n\n"},{"id":"60c02ef2","name":"Budget items ","type":"DataObject","layer":"application","documentation":"The items that comprise a budget plan come from several other applications in an instance, including Asset Management, Project Management, and Configuration Management. This enables you to budget your expenses for items across your IT infrastructure.\n\nEach item in the budget plan has an actual item cost and an account number. The actual item costs roll up to comprise the budget plan's actual budgeted amounts for both capital and operating expenses, using the type of account code (capital or operating) associated with each item. You can further refine the costs of the items by specifying how many units to include in a single item, a unit cost, and the percentage of each unit that you want to include in the actual item cost.\n\nStarting with the Helsinki release:\n\nyou can add product catalog items to budget items. See Product Catalog for more information.\nExpense type will be determine by the Account selected on the budget item.\nBudget item breakdowns\nThe total cost in a budget plan is divided into smaller units called breakdowns.\n\nAdd items to a budget plan\nAfter you create a budget plan, add items to the plan, such as assets and configuration items. You can then track the estimated target cost of all the items in the budget versus the actual costs."},{"id":"61db4962","name":"Asset Management","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"bd988b18","name":"Project Management","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"9e5881db","name":"Application Component","type":"ApplicationComponent","layer":"application","documentation":"Configuration Management"},{"id":"b0f6f900","name":"Service Catalog","type":"ApplicationComponent","layer":"application","documentation":"Configuration Management"},{"id":"f34c0571","name":"Add items to a budget plan ","type":"ApplicationFunction","layer":"application","documentation":"After you create a budget plan, add items to the plan, such as assets and configuration items. You can then track the estimated target cost of all the items in the budget versus the actual costs.\n\nBefore you begin\n\nRole required: budget_admin\nProcedure\n\nOpen a budget plan.\n\nClick one of the related lists.\n\nClick New.\n\nFill out the fields on the form (see table).\n\nRight-click the form header and select Save.\n\nThe application calculates the breakdowns automatically.\n\nClick Recalculate Item Amount if you update budget reference rates.\n\nTable 1. Form fields for budget plan items\nField\tAvailable for these types of items\tDescription\nName\tAll types\tA descriptive name for the item. Enter a name. If you select a product model, the application automatically populates this field and makes it read-only.\nBudget Plan\tAll types\tThe plan this item belongs to.\nBudget Key\tAll types\tThe budget key for this item. You can select a key that is designated as a sub-key of the plan's key. Use this sub-key if you want items to be separated by different codes and assign those keys to different users. Items without a key take the key of the plan.\nAccount Number\tAll types\tThe account number associated with this item.\nExpense Type\tAll types\tIf the item is an Operational or Capital expense. The account determines this value.\nConfiguration Item\tBudget item, Software, Hardware\tThe CI in the Configuration Item [cmdb_ci] table.\nItem Cost in Plan Currency\tAll types\tThe actual item cost for the number of units and the cost per unit. This field uses the currency that the budget uses.\nProduct Model\tBudget item\tAn item from the product catalog's Product Model [product_model] table. This field is new with the Helsinki release. See Models.\nItem Cost in Local Currency\tAll types\tThe actual item cost for the number of units and the cost per unit. This field uses the local currency selection that you make on the Cost Details tab.\nUser\tLabor\tThe user performing the labor. Select a user from the system.\nContract\tContracts\tThe contract from the [ast_contract] table. Select a contract.\nCost Details\nLocal Currency\tAll types\tSelect the currency that pertains to the cost of this particular item.\nUnit Cost in Local Currency\tAll types\tThe cost of each unit in the item. Enter the cost per unit.\nQuantity\tAll types\tThe number of units in this item. Enter the quantity of this item.\nIs Prorated\tAll types, except Asset Depreciation\tThe breakdown is prorated if the start or end date falls in the middle of the time period for a breakdown record. Select this option to prorate the amount. This field is automatically selected and is read only for external labor.\nIs Monthly\tAll types, except Asset Depreciation\tAssumes the amount entered in the Unit Cost in Local Currency field is not incurred annually, but monthly. The amount is then applied across the entire fiscal period until the specified end date. This field is automatically selected when Is Prorated is selected, and is read only for the external labor item type.\nItem Execution\nPlanned Execution Start Date\tAll types, except Asset Depreciation and Contract\tThe date when this item is estimated to begin incurring an expense. The planned dates can determine which budget item breakdowns receive cost values.\nActual Execution Start Date\tAll types, except Asset Depreciation\tThe date when this item actually begins incurring an expense. The actual dates take precedence over the planned dates in determining which budget item breakdowns receive cost values.\nPlanned Execution End Date\tAll types, except Asset Depreciation\tThe date when this cost is estimated to stop incurring an example. The planned dates can determine which budget item breakdowns receive cost values.\nActual Execution End Date\tAll types, except Asset Depreciation\tThe date when this item actually stops incurring an expense. The actual dates take precedence over the planned dates in determining which budget item breakdowns receive cost values.\n"},{"id":"edadc916","name":"GL Account","type":"DataObject","layer":"application","documentation":""},{"id":"a9ee62a3","name":"Create GL account","type":"ApplicationFunction","layer":"application","documentation":"Create a general ledger account for each account in your organization that requires an account number to associate expenses with.\n\nBefore you begin\n\nRole required: cost_transparency_admin\nAbout this task\n\nAccounts are associated with all three types of expenses in the general ledger.\n\nStarting with the Helsinki release, account numbers are classified as either an operating expense or a capital expense. This expense type is expressed in budgets to compare operating and capital budget targets versus actual budgeted expenses.\n\nAfter you upgrade Financial Management to the Helsinki version, the Expense Type field defaults to Operating.\n\nProcedure\n\nNavigate to Financial Planning > Administration > Accounts.\n\nFill out the form fields (see table).\n\nClick Submit.\n\nTable 1. General Ledger Account form fields\nField\tDescription\nAccount Number\tEnter a unique account number for each account.\nDescription\tEnter a detailed description for the account.\nName\tEnter a descriptive name.\nExpense type\tSelect the type of expense associated with the account:\nOperating: An operational expense. If you upgrade to Helsinki from a previous release, all accounts default to this type.\nCapital: A capital expense.\nNote: After you upgrade Financial Management to the Helsinki version, this field defaults to Operating.\n"},{"id":"076276ee","name":"Staged expenses","type":"DataObject","layer":"application","documentation":"Staged expenses that you imported from your external source. Imported expenses are saved in the General Ledger Staged Data [itfm_gl_data_staged] table.\n"},{"id":"cfd31687","name":"Cleansed expenses","type":"DataObject","layer":"application","documentation":"Cleansed expenses that the workbench uses during the Data Cleansing stage. Changes to expenses during this stage are saved in the General Ledger Cleansed Data [itfm_gl_data_cleansed] table. Each time you add an expense to the General Ledger Staged Data table, a corresponding expense is created in this table.\n"},{"id":"6a230b49","name":"Groomed expenses","type":"DataObject","layer":"application","documentation":"Groomed expenses that the workbench uses during the Bucketing stage. Changes to expenses during this stage are saved in the Groomed General Ledger Data [itfm_gl_data_groomed] table.\n"},{"id":"49695135","name":"View expenses ","type":"ApplicationInterface","layer":"application","documentation":"You can view records in any of the general ledger tables and make changes if necessary.\n\nBefore you begin\n\nRole required: cost_transparency_admin\nProcedure\n\nNavigate to Cost Transparency > General Ledger and open one of these general ledgers: Staged Expenses, Cleansed Expenses, Groomed Expenses.\n\nOpen an expense by clicking the value in the Number column for the expense.\n\nModify the fields on the form as appropriate (see table).\n\nClick Submit.\n\nTable 1. Groomed General Ledger Data form fields\nField\tDescription\nNumber\tAuto-generated identification number for the general ledger data record.\nState\tThe current state of the record:\nUnallocated: Allocations for this expense are not allocated.\nAllocated: This expense has been allocated.\nLocked: The general ledger expense is locked so that its allocation lines cannot be reverted.\nAccount name\tName of the account.\nAccount number\tAccount number this expense applies to. This field is mandatory on the Cleansed General Ledger Data form to ensure that all cleansed expenses appear in an account in the Bucketing stage of the workbench.\nDescription\tDetailed description of the expense.\nAmount\tThe amount of the expense.\nCleansed expense\t[General Ledger Staged Data form]\nA reference to the corresponding record in the General Ledger Cleansed Data table. This is the expense in the General Ledger Cleansed Data table that is automatically created when you create an expense in the General Ledger Staged Data table.\n\nStaged expense\t[General Ledger Cleansed Data form]\nA reference to the corresponding record in the General Ledger Cleansed Data table.\n\nGroomed expense\t[General Ledger Cleansed Data form]\nA reference to the corresponding record in the Groomed General Ledger Data table.\n\nGrooming rule\t[General Ledger Cleansed Data form]\nThe condition that the workbench uses to filter expenses that are put in buckets.\n\nCurrency\tCurrency that the expense is valued in. The currency is a three letter code defined in the Currency [fx_currency] table. If the value in this field does not match any code in the Currency table, dollar signs are displayed by default for all expenses. Make sure that your expenses in all general ledger forms are in the same currency as your system currency.\nDocument amount\tAmount of the original expense document.\nDocument currency\tCurrency that the original expense document uses. As with the Currency field, the value in the field is a three letter code defined in the Currency table.\nBucket\t[Groomed General Ledger Data form]\nBucket that this expense is associated with.\n\nSub-bucket\t[Groomed General Ledger Data form]\nSub-bucket that this expense is associated with.\n\nCost center\tCost center this expense applies to.\nDepartment\tDepartment associated with this expense.\nFiscal period\t[Groomed General Ledger Data form]\nPeriod during which this expense occurred.\n\nDocument date\tDate on which the original expense document was issued.\nImport set\tThe import set containing the data that you imported into the instance.\nLocation\tThe location of where the expense was incurred.\nVendor\tThe vendor record that is referenced from the Company [core_company] table.\nPosting date\tThe date of when this expense was incurred.\nLocal amount\tThe amount represented in the local currency.\nLocal currency\tThe currency associated with the account.\nSegments\tExpense amounts for the segments that are defined in the IT chart of accounts.\nRelated links\nPreview Allocation\t[Groomed General Ledger Data form]\nOpens the allocation viewer for unallocated expenses. This link does not appear on the form for allocated expenses.\n\nVisualize Allocation\t[Groomed General Ledger Data form]\nOpens the allocation viewer for allocated expenses. This link does not appear on the form for unallocated expenses.\n\nRelated Lists\nCost Allocations\t[Groomed General Ledger Data form]\nAllocation lines created from this expense.\n\nGeneral Ledger Cleansed Data\t[Groomed General Ledger Data form]\nThe records in the General Ledger Cleansed Data table that created the groomed expense records after the expenses are put into buckets."},{"id":"0d1a6d64","name":"Business Unit","type":"DataObject","layer":"application","documentation":"Business units are the parts of your organization that are in charge of certain operations, such as Finance, HR, IT, and so on.\n\nBusiness units are typically comprised of departments and associated with a company. By default, the IT chart of accounts includes a segment for business units, departments, and vendors, which are companies with the Vendor option selected. With this chart of accounts setup, you can allocate expenses to specific business units, departments, or vendors, or have expense allocations roll up to them. You can configure both departments and companies as part of user management.\n\nCreate business units\nCreate business units to set up the top-most segment in the IT chart of accounts. Then you can create rollup rules to have expenses roll up to these business units.\n\n"},{"id":"91c9d084","name":"Create Business Units ","type":"ApplicationFunction","layer":"application","documentation":"Create business units to set up the top-most segment in the IT chart of accounts. Then you can create rollup rules to have expenses roll up to these business units.\n\nBefore you begin\n\nRole required: cost_transparency_admin\nProcedure\n\nNavigate to Cost Transparency > Chart of Accounts > Business Units.\n\nClick New.\n\nFill out the fields on the form (see table).\n\nClick Save.\n\nTable 1. Business Unit form fields\nField\tDescription\nName\tName of the business unit.\nCompany\tThe company, if any, associated with this business unit. You can choose any company, including those that do not have the Vendor field selected.\nDescription\tA description of the business unit.\nRelated List\nDepartments\tDepartments that comprise this business unit. Add as many departments as necessary.\n"},{"id":"d17ef5eb","name":"Department","type":"DataObject","layer":"application","documentation":""},{"id":"8eb68cb9","name":"Company","type":"DataObject","layer":"application","documentation":""},{"id":"a970de3f","name":"Default Model","type":"Artifact","layer":"technology","documentation":"Default budget model: A default budget model that you can customize. If you upgrade to Helsinki, the budget definition you had in Geneva is converted to the default budget model."},{"id":"b993bd55","name":"Project Financials","type":"Artifact","layer":"technology","documentation":"Project Financials Budget Model: used to integration with the Project Portfolio Suite (requires the Project Portfolio Suite with Financials (com.snc.financial_planning_pmo) plugin)."},{"id":"bd7d45d8","name":"Account Code Expenses","type":"Artifact","layer":"technology","documentation":"[itfm_gl_actuals] table\nthe expenses are used by the budget console for calculations of actual expenses. Normally you do not need to create or modify data in this table.\n"},{"id":"e843fa9d","name":"Budget Variance report ","type":"Artifact","layer":"technology","documentation":"he Budget Variance report shows you how expenses compare to budgets for the segments in the budget definition.\n\nThe Budget Variance Report is the main report you need for managing budgets. It gives you an overview of your budget estimates versus actuals. The estimated budget data is taken from the Final Budgets [itfm_budget] table, not from forecasts. The actual expense values are taken from the General Ledger Staged Data [itfm_gl_data_staged] table.\n\nThe budget variance data is grouped by Operating and Capital expenses, starting with the Helsinki release.\n\nUse the budget variance report\nUse the Budget Variance report to see how expenses compare to budgets for cost centers, departments, locations, and vendors."},{"id":"dbd78f41","name":"Inherited budget plan values","type":"Artifact","layer":"technology","documentation":"Important values from the plan, including the budget plan key. "},{"id":"bfe922b5","name":"Overrides","type":"Artifact","layer":"technology","documentation":"Overrides: an amount you can specify to override, or replace, the final forecast amount.\n"},{"id":"6e4996af","name":"Budget forecast items","type":"Artifact","layer":"technology","documentation":"the budget items from the budget plan.\n"},{"id":"8f92868a","name":"Operating Target","type":"Artifact","layer":"technology","documentation":"Operating Target\tThe target amount for operating expenses.\nCapital Target\tThe amount of the target in the currency being used.\nBudget Key\tThe budget key to which this target applies. Select a key.\nCurrency\tThe currency in use.\nFiscal period\tThe fiscal period year to which this target applies. Select a fiscal period."},{"id":"f414147f","name":"Capital Target","type":"Artifact","layer":"technology","documentation":"Capital Target\tThe amount of the target in the currency being used.\n"},{"id":"3ad22a6e","name":"Currenc","type":"Artifact","layer":"technology","documentation":"Currency\tThe currency in use.\n"},{"id":"1686d65d","name":"Target Amount","type":"Artifact","layer":"technology","documentation":"The target amount also appears on the Review tab of the Budget Console. You can edit the amount through the console."},{"id":"70ee5b05","name":"Account Number","type":"Artifact","layer":"technology","documentation":""},{"id":"3b16c665","name":"Actual Item Cost","type":"Artifact","layer":"technology","documentation":"The actual item costs roll up to comprise the budget plan's actual budgeted amounts for both capital and operating expenses using the type of account code (capital or operating) associated with each item."}],"relationships":[{"id":"f056042a","sourceId":"f47e0d68","targetId":"8a503796","type":"CompositionRelationship","name":"","documentation":""},{"id":"f594407d","sourceId":"f47e0d68","targetId":"075fbf35","type":"CompositionRelationship","name":"","documentation":""},{"id":"69f830ab","sourceId":"f47e0d68","targetId":"8aed9f55","type":"CompositionRelationship","name":"","documentation":""},{"id":"a48fbf67","sourceId":"f4ab94d8","targetId":"152ed138","type":"CompositionRelationship","name":"","documentation":""},{"id":"a2988c62","sourceId":"f4ab94d8","targetId":"8e9c9750","type":"CompositionRelationship","name":"","documentation":""},{"id":"479c7c0f","sourceId":"2ea1db1a","targetId":"19ff834b","type":"CompositionRelationship","name":"","documentation":""},{"id":"da87524e","sourceId":"f4ab94d8","targetId":"ff894a0a","type":"CompositionRelationship","name":"","documentation":""},{"id":"5ecbfef9","sourceId":"f4ab94d8","targetId":"8f42a49a","type":"CompositionRelationship","name":"","documentation":""},{"id":"bca83684","sourceId":"f4ab94d8","targetId":"d9fe1e40","type":"AssignmentRelationship","name":"","documentation":""},{"id":"ab1619b4","sourceId":"8e9c9750","targetId":"ff894a0a","type":"CompositionRelationship","name":"","documentation":""},{"id":"9e9e5a3e","sourceId":"8e9c9750","targetId":"8f42a49a","type":"CompositionRelationship","name":"","documentation":""},{"id":"3bd2742a","sourceId":"8e9c9750","targetId":"d9fe1e40","type":"AssignmentRelationship","name":"","documentation":""},{"id":"11ad81b0","sourceId":"8e9c9750","targetId":"02281798","type":"AssignmentRelationship","name":"","documentation":""},{"id":"6f300604","sourceId":"8e9c9750","targetId":"b23efb5d","type":"AssignmentRelationship","name":"","documentation":""},{"id":"e849b93d","sourceId":"8e9c9750","targetId":"86d83799","type":"AssignmentRelationship","name":"","documentation":""},{"id":"0bdac89e","sourceId":"8e9c9750","targetId":"84baf3d1","type":"AssignmentRelationship","name":"","documentation":""},{"id":"36bc1a63","sourceId":"b23efb5d","targetId":"84baf3d1","type":"CompositionRelationship","name":"","documentation":""},{"id":"b68dc6f9","sourceId":"b23efb5d","targetId":"7930a261","type":"CompositionRelationship","name":"","documentation":""},{"id":"629043c3","sourceId":"84baf3d1","targetId":"0609e555","type":"UsedByRelationship","name":"","documentation":""},{"id":"951814f3","sourceId":"c3601efe","targetId":"84baf3d1","type":"AssociationRelationship","name":"","documentation":""},{"id":"c8b6ec8e","sourceId":"7930a261","targetId":"9da59fe0","type":"AccessRelationship","name":"","documentation":""},{"id":"02bdbdb7","sourceId":"7930a261","targetId":"c3601efe","type":"AssociationRelationship","name":"","documentation":""},{"id":"672a367e","sourceId":"7930a261","targetId":"0609e555","type":"UsedByRelationship","name":"","documentation":""},{"id":"c97ff7be","sourceId":"02281798","targetId":"9da59fe0","type":"AssociationRelationship","name":"","documentation":""},{"id":"e122d8f5","sourceId":"86d83799","targetId":"0a7bd17b","type":"AssociationRelationship","name":"","documentation":""},{"id":"1f6b079c","sourceId":"86d83799","targetId":"c3601efe","type":"AssociationRelationship","name":"","documentation":""},{"id":"c31fa7b4","sourceId":"02281798","targetId":"0609e555","type":"UsedByRelationship","name":"","documentation":""},{"id":"d8201e39","sourceId":"02281798","targetId":"5e7f7d9f","type":"AccessRelationship","name":"Select","documentation":""},{"id":"cf83406a","sourceId":"02281798","targetId":"c3601efe","type":"AccessRelationship","name":"Generates","documentation":""},{"id":"5e6d11d7","sourceId":"a970de3f","targetId":"9da59fe0","type":"AccessRelationship","name":"","documentation":""},{"id":"9aa9498f","sourceId":"7930a261","targetId":"02281798","type":"UsedByRelationship","name":"","documentation":""},{"id":"80019c21","sourceId":"02281798","targetId":"545b9b14","type":"CompositionRelationship","name":"","documentation":""},{"id":"72117be1","sourceId":"cc29385a","targetId":"60d0dd58","type":"AggregationRelationship","name":"","documentation":""},{"id":"bd454e62","sourceId":"60d0dd58","targetId":"df557988","type":"CompositionRelationship","name":"","documentation":""},{"id":"78346239","sourceId":"df557988","targetId":"60d0dd58","type":"SpecialisationRelationship","name":"","documentation":""},{"id":"bec5d941","sourceId":"df557988","targetId":"60d0dd58","type":"AssociationRelationship","name":"","documentation":""},{"id":"89c6039b","sourceId":"7f089ff2","targetId":"df557988","type":"AssociationRelationship","name":"","documentation":""},{"id":"be37fd0f","sourceId":"7f089ff2","targetId":"0609e555","type":"UsedByRelationship","name":"","documentation":""},{"id":"718e8e3f","sourceId":"df557988","targetId":"cc29385a","type":"SpecialisationRelationship","name":"","documentation":""},{"id":"4d837bc2","sourceId":"ea54df95","targetId":"0609e555","type":"UsedByRelationship","name":"","documentation":""},{"id":"8e2671bb","sourceId":"bfe922b5","targetId":"cc29385a","type":"RealisationRelationship","name":"","documentation":""},{"id":"fae505be","sourceId":"dbd78f41","targetId":"cc29385a","type":"RealisationRelationship","name":"","documentation":""},{"id":"85027f58","sourceId":"6e4996af","targetId":"cc29385a","type":"RealisationRelationship","name":"","documentation":""},{"id":"0169cc62","sourceId":"bfe922b5","targetId":"ea54df95","type":"UsedByRelationship","name":"","documentation":""},{"id":"2d80b4da","sourceId":"df557988","targetId":"60c02ef2","type":"AggregationRelationship","name":"","documentation":""},{"id":"d74c831a","sourceId":"60c02ef2","targetId":"9e5881db","type":"AssociationRelationship","name":"","documentation":""},{"id":"dc19e767","sourceId":"60c02ef2","targetId":"61db4962","type":"AssociationRelationship","name":"","documentation":""},{"id":"7e86d80d","sourceId":"60c02ef2","targetId":"bd988b18","type":"AssociationRelationship","name":"","documentation":""},{"id":"2c27e47c","sourceId":"3b16c665","targetId":"60c02ef2","type":"RealisationRelationship","name":"","documentation":""},{"id":"57144229","sourceId":"b0f6f900","targetId":"df557988","type":"AssociationRelationship","name":"Product Catalog Items","documentation":""},{"id":"5bfc35c6","sourceId":"df557988","targetId":"e57b74d1","type":"AssociationRelationship","name":"1:1","documentation":""},{"id":"b87e3f84","sourceId":"df557988","targetId":"c3601efe","type":"AssociationRelationship","name":"","documentation":""},{"id":"cca20688","sourceId":"df557988","targetId":"08b505e8","type":"AssociationRelationship","name":"","documentation":""},{"id":"40a6f908","sourceId":"1891a735","targetId":"f34c0571","type":"FlowRelationship","name":"","documentation":""},{"id":"6ee34e6c","sourceId":"f34c0571","targetId":"0609e555","type":"UsedByRelationship","name":"","documentation":""},{"id":"36baa0ca","sourceId":"f34c0571","targetId":"df557988","type":"AssociationRelationship","name":"","documentation":""},{"id":"2aa67545","sourceId":"122f2140","targetId":"edadc916","type":"AggregationRelationship","name":"","documentation":""},{"id":"3d4e6a38","sourceId":"a9ee62a3","targetId":"edadc916","type":"AssociationRelationship","name":"","documentation":""},{"id":"c083b7ad","sourceId":"a9ee62a3","targetId":"ef73bdc7","type":"UsedByRelationship","name":"","documentation":""},{"id":"a662980c","sourceId":"19ff834b","targetId":"ff894a0a","type":"AssociationRelationship","name":"","documentation":""},{"id":"bece3011","sourceId":"ff894a0a","targetId":"076276ee","type":"AccessRelationship","name":"","documentation":""},{"id":"ffacbf34","sourceId":"ff894a0a","targetId":"cfd31687","type":"AccessRelationship","name":"","documentation":""},{"id":"12b1574e","sourceId":"ff894a0a","targetId":"6a230b49","type":"AccessRelationship","name":"","documentation":""},{"id":"6da736c9","sourceId":"49695135","targetId":"122f2140","type":"AccessRelationship","name":"","documentation":""},{"id":"76a643fa","sourceId":"49695135","targetId":"ef73bdc7","type":"UsedByRelationship","name":"","documentation":""},{"id":"1d394f27","sourceId":"91c9d084","targetId":"ef73bdc7","type":"UsedByRelationship","name":"","documentation":""},{"id":"c711c9e4","sourceId":"c2292107","targetId":"0d1a6d64","type":"AssociationRelationship","name":"","documentation":""},{"id":"303f71dd","sourceId":"91c9d084","targetId":"0d1a6d64","type":"AssociationRelationship","name":"","documentation":""},{"id":"cf2b919b","sourceId":"0d1a6d64","targetId":"d17ef5eb","type":"AggregationRelationship","name":"1:n","documentation":""},{"id":"a9f7d665","sourceId":"03c5d0fc","targetId":"1686d65d","type":"AssociationRelationship","name":"","documentation":""},{"id":"8b2b3fe4","sourceId":"03c5d0fc","targetId":"8f92868a","type":"AssociationRelationship","name":"","documentation":""},{"id":"2a0606c9","sourceId":"03c5d0fc","targetId":"3ad22a6e","type":"AssociationRelationship","name":"","documentation":""},{"id":"322d9ed7","sourceId":"03c5d0fc","targetId":"f414147f","type":"AssociationRelationship","name":"","documentation":""},{"id":"5cd44798","sourceId":"0d1a6d64","targetId":"8eb68cb9","type":"AssociationRelationship","name":"","documentation":""},{"id":"ba2babba","sourceId":"1891a735","targetId":"e08c04f4","type":"UsedByRelationship","name":"","documentation":""},{"id":"63e98909","sourceId":"1891a735","targetId":"0609e555","type":"UsedByRelationship","name":"","documentation":""},{"id":"bb22cb76","sourceId":"1891a735","targetId":"0a7bd17b","type":"UsedByRelationship","name":"","documentation":""}],"views":[{"id":"7c825f38","name":"Default View","viewpoint":"","documentation":""}]}