{"id":"6a18db2b","name":"SMAG V3","documentation":"","file":"../../raw-data/github/archimate/SMAG v4.archimate","format":"ARCHIMATE","source":"","timestamp":"15-06-2023 03:28:48","tags":["duplicate"],"archiVersion":"3.1.1","language":"","elements":[{"id":"75d26025","name":"Service Provider","type":"BusinessActor","layer":"business","documentation":"Party 2 in Contract\n"},{"id":"7430b38a","name":"Service Consumer","type":"BusinessActor","layer":"business","documentation":"Party 1 in Contract\n"},{"id":"c633df8a","name":"Requester","type":"BusinessRole","layer":"business","documentation":""},{"id":"96d14f95","name":"Fulfiller","type":"BusinessRole","layer":"business","documentation":""},{"id":"d9b126b8","name":"Service Agreement","type":"Contract","layer":"business","documentation":""},{"id":"1dca85ea","name":"Service Desk","type":"BusinessInterface","layer":"business","documentation":""},{"id":"cb617a48","name":"IMaaS","type":"BusinessService","layer":"business","documentation":"Incident Management as a Service"},{"id":"7e1dcbf0","name":"Submit Request","type":"BusinessEvent","layer":"business","documentation":""},{"id":"bc02e1bf","name":"Requested ","type":"BusinessProcess","layer":"business","documentation":""},{"id":"60262786","name":"Facknowledged ","type":"BusinessProcess","layer":"business","documentation":""},{"id":"0ecbcd32","name":"Opened ","type":"BusinessProcess","layer":"business","documentation":""},{"id":"7e548be9","name":"Assigned ","type":"BusinessProcess","layer":"business","documentation":""},{"id":"5b059180","name":"GAcknowledged ","type":"BusinessProcess","layer":"business","documentation":""},{"id":"71b44618","name":"Pending ","type":"BusinessProcess","layer":"business","documentation":""},{"id":"c4f17f85","name":"Resolved ","type":"BusinessProcess","layer":"business","documentation":""},{"id":"531870e0","name":"Worked ","type":"BusinessProcess","layer":"business","documentation":""},{"id":"ca629ab4","name":"Canceled ","type":"BusinessProcess","layer":"business","documentation":""},{"id":"1fb660b3","name":"Closed ","type":"BusinessProcess","layer":"business","documentation":""},{"id":"6db30003","name":"Requester","type":"BusinessActor","layer":"business","documentation":""},{"id":"408c9cc2","name":"Smart Agreement Template","type":"BusinessObject","layer":"business","documentation":"The Logical Model for the Smart Agreement between two parties\nThis will be the base (class) for the SmAg between the contracting parties\n"},{"id":"d9f878bd","name":"Implement Agreement","type":"BusinessProcess","layer":"business","documentation":""},{"id":"9f8e9022","name":"Operate Agreement","type":"BusinessProcess","layer":"business","documentation":""},{"id":"c6434aa4","name":"Update Agreement","type":"BusinessProcess","layer":"business","documentation":""},{"id":"25e71bf9","name":"Terminate Agreement","type":"BusinessProcess","layer":"business","documentation":""},{"id":"e9e88d47","name":"Retire Agreement","type":"BusinessProcess","layer":"business","documentation":""},{"id":"1dae7697","name":"3rd Party","type":"BusinessActor","layer":"business","documentation":"Implementer"},{"id":"ae20d337","name":"Demand for new SmartAgreement","type":"BusinessEvent","layer":"business","documentation":""},{"id":"e99414cd","name":"Define SmartAgreement Draft","type":"BusinessProcess","layer":"business","documentation":"Requirements Documentation"},{"id":"d70dd147","name":"SmartAgreement Templates","type":"BusinessService","layer":"business","documentation":""},{"id":"8ab7086b","name":"Issue RFP","type":"BusinessEvent","layer":"business","documentation":""},{"id":"8ebdc79a","name":"Evaluate Proposals","type":"BusinessProcess","layer":"business","documentation":""},{"id":"fbbacaec","name":"Award Proposal","type":"BusinessEvent","layer":"business","documentation":""},{"id":"bfeb7a68","name":"Request for Proposal","type":"BusinessObject","layer":"business","documentation":""},{"id":"e09b940b","name":"Design SmartAgreement Offering","type":"BusinessFunction","layer":"business","documentation":""},{"id":"c4c07ae3","name":"Proposal","type":"BusinessObject","layer":"business","documentation":""},{"id":"e75d2fbb","name":"Negotiate terms and conditions","type":"BusinessCollaboration","layer":"business","documentation":""},{"id":"713fcea4","name":"Procurement","type":"BusinessFunction","layer":"business","documentation":""},{"id":"8788c92a","name":"Solicitation","type":"BusinessInteraction","layer":"business","documentation":""},{"id":"ff0d153e","name":"Selection","type":"BusinessEvent","layer":"business","documentation":""},{"id":"caf068a1","name":"Budgetting","type":"BusinessProcess","layer":"business","documentation":"Budgeting enables an organization to plan future IT expenditures, reducing the risk of over-spending and ensuring the revenues are available to cover the predicted spend. Additionally, budgeting allows an organization to compare actual costs with previously predicted costs in order to improve the reliability of budgeting predictions.\n\nCost types, codes\ncapital/revenue\nfixed & variable\n\n"},{"id":"8ae95a75","name":"Charging","type":"BusinessProcess","layer":"business","documentation":"Charging provides the ability to assign costs of an IT Service proportionally and fairly to the users of that service. It may be used as a first step towards an IT organization operating as an autonomous business. It may also be used to encourage users to move in a strategically important direction - for example by subsidizing newer systems and imposing additional charges for the use of legacy systems. Transparency of charging will encourage users to avoid expensive activities where slightly more inconvenient but far cheaper alternatives are available. For example, a user might browse a dump on screen rather than printing it off.\n\nCharging is arguably the most complex of the three sub-processes, requiring a large investment of resources and a high degree of care to avoid anomalies, where an individual department may benefit from behavior which is detrimental to the company as a whole. Charging policy needs to be simultaneously simple, fair and realistic.\n\nCharging need not necessarily mean money changing hands (full charging). It may take the form of information passed to management on the cost of provision of IT services (no charging), or may detail what would be charged if full charging were in place without transactions actually being applied to the financial ledgers (notional charging). Notional charging may also be used as a way of piloting full charging.\n\nCost, Cost plus, market rate, notional\n\n\n"},{"id":"89239ca6","name":"Accounting","type":"BusinessProcess","layer":"business","documentation":"IT accounting is concerned with the amount of money spent in providing IT services. It allows an organization to perform various financial analyses to gauge the efficiency of the IT service provision and determine areas where cost savings can be made. It will also provide financial transparency to aid management in the decision making process.\n\ndirect/indirect\nunabsorable overheads\nTCO ROI\n"},{"id":"a329fc5a","name":"Service","type":"BusinessObject","layer":"business","documentation":""},{"id":"2006ac2a","name":"Supplier","type":"BusinessObject","layer":"business","documentation":""},{"id":"2fbfd0a8","name":"Clearance","type":"BusinessObject","layer":"business","documentation":""},{"id":"cb999f8f","name":"Duration","type":"BusinessObject","layer":"business","documentation":""},{"id":"8ef3ae4e","name":"Interfaces","type":"BusinessObject","layer":"business","documentation":""},{"id":"6c1f245d","name":"Communication","type":"BusinessObject","layer":"business","documentation":""},{"id":"140eefd6","name":"Service Times","type":"BusinessObject","layer":"business","documentation":""},{"id":"5b3b6eeb","name":"Support Types","type":"BusinessObject","layer":"business","documentation":""},{"id":"2eab7f76","name":"Support Levels","type":"BusinessObject","layer":"business","documentation":""},{"id":"872666bd","name":"CFO","type":"BusinessActor","layer":"business","documentation":""},{"id":"98b01666","name":"Fulfiller","type":"BusinessActor","layer":"business","documentation":""},{"id":"9d410e42","name":"Bill of IT","type":"BusinessObject","layer":"business","documentation":""},{"id":"61df495a","name":"General Ledger","type":"BusinessObject","layer":"business","documentation":""},{"id":"33378635","name":"IT Service Invoice","type":"BusinessObject","layer":"business","documentation":""},{"id":"6e424f1c","name":"Cost Data for Service Provisioning  ","type":"BusinessObject","layer":"business","documentation":"The cost for providing a service, calculated by Financial Management as a basis for calculating the price a customer is expected to pay for a service.\n"},{"id":"19e1fdfd","name":"Service Portfolio Review  ","type":"BusinessProcess","layer":"business","documentation":"Process Objective: To assess the Service Portfolio at regular intervals in order to ensure the service provider offers economically viable services which are aligned with the Service Strategy. This process also keeps the Service Portfolio up to date.\n"},{"id":"9404db4b","name":"Invoice  ","type":"BusinessObject","layer":"business","documentation":"The invoice for the delivery of a service or product.\n"},{"id":"836ff324","name":"Financial Management Support","type":"BusinessProcess","layer":"business","documentation":"Process Objective: To define the necessary structures for the management of financial planning data and costs, as well as for the allocation of costs to services.\n"},{"id":"fcbad65f","name":"IT Budget  ","type":"BusinessObject","layer":"business","documentation":"The IT Budget is an annual financial plan that provides a forecast of expected expenditures and allocates financial resources to the various service management processes and organizational units within the IT organization.\n"},{"id":"2df4d800","name":"Financial Planning  ","type":"BusinessProcess","layer":"business","documentation":"Process Objective: To determine the required financial resources over the next planning period (\"IT Budget\"), and to allocate those resources for optimum benefits.\n"},{"id":"27669129","name":"Service Model  ","type":"BusinessObject","layer":"business","documentation":"A Service Model is a high-level description of a service and the components required to deliver that service. The main purpose of Service Models is to facilitate an understanding of what service components, assets and other resources are necessary to create the service, including their interactions. Service Models are a valuable tool for understanding the impact of proposed new or changed services on other services at an early stage. (Note: New output in ITIL 2011.)\n"},{"id":"1b2201ac","name":"IT Steering Group (ISG)  ","type":"BusinessActor","layer":"business","documentation":"The IT Steering Group (ISG) sets the direction and strategy for IT Services. It includes members of senior management from business and IT. The IT Steering Group reviews the business and IT strategies in order to make sure that they are aligned. It also sets priorities of service development programs/ projects.\n"},{"id":"844d3c5c","name":"Financial Data Categories  ","type":"BusinessObject","layer":"business","documentation":"Various categories are used to structure financial data, as a means to gain insight into the underlying costs of service provisioning and service profitability.\n"},{"id":"2411066d","name":"Service Owner","type":"BusinessActor","layer":"business","documentation":""},{"id":"5fa46d99","name":"Financial Analysis  ","type":"BusinessObject","layer":"business","documentation":"The Financial Analysis is an important input to the Portfolio Management process. It contains information on the costs for providing services and provides insight into the profitability of services and customers (see also: ITIL Checklist Financial Analysis).\n"},{"id":"43327432","name":"Service Portfolio Review Report  ","type":"BusinessObject","layer":"business","documentation":"A document containing the results and findings from a Service Portfolio Review. This report is an important input to the strategic service assessment.\n"},{"id":"7ef131c5","name":"Charging","type":"BusinessProcess","layer":"business","documentation":"is the activity whereby payment is required for services delivered. Charging requires that accounting procedures and systems exist and are set up. It makes a difference whether the organization is an internal service provider, or if it serves external customer as its main business. In the case where an IT organization is an internal service provider (according to ITIL, these are Type I and Type II organizations), it is not necessary to bill for services. Sometimes such IT organizations only allocate costs. If an IT organization sells its services to external customers (Type III organization) they will, certainly, issue bills for their services and generate income which funds that organization.\n\nCharging for services by an organization with external customers is the only way to get funding for the organization, cover costs and generate revenue. But, in the case of an internal service provider it can be seen as bureaucratic procedure, which is true. On the other side, I found that internal charging has several advantages:\n\nIt justifies IT resources needed (increased transparency),\nusers throughout organization use only resources they really need (optimization of usage),\nbusiness can plan their cost of operation (which is, further on, included in price charged to their customers), and\nIT has better control of its business."},{"id":"826eb4ba","name":"Design Agreement","type":"BusinessProcess","layer":"business","documentation":""},{"id":"cb7c283c","name":"Budget Allocation  ","type":"BusinessFunction","layer":"business","documentation":"A budget allocated by the Financial Manager to implement a Change. Budget Allocations are issued in response to Budget Requests originating from any Service Management process in conjunction with Requests for Change.\n"},{"id":"cd9c5819","name":"Bilateral netting","type":"BusinessService","layer":"business","documentation":"an arrangement whereby two parties net their bilateral obligations\n"},{"id":"68b5fe19","name":"Service Invoicing  ","type":"BusinessProcess","layer":"business","documentation":"Process Objective: To issue invoices for the provision of services and transmission of the invoice to the customer.\n"},{"id":"597461b6","name":"Budget Request  ","type":"BusinessObject","layer":"business","documentation":"A request for a budget, typically issued from any of the Service Management processes at the same time when compiling a Request for Change. An approved Budget Request means that the required financial resources for implementing a Change are approved by Financial Management.\n\n"},{"id":"f0ed961f","name":"Financial Analysis and Reporting  ","type":"BusinessProcess","layer":"business","documentation":"Process Objective: To analyze the structure of service provisioning cost and the profitability of services. The resulting financial analysis allows Service Portfolio Management to make informed decisions when deciding about changes to the Service Portfolio.\n"},{"id":"662f83b8","name":"Approve new or changed Services  ","type":"BusinessProcess","layer":"business","documentation":"Process Objective: To submit a formal Change Proposal to Change Management, and to initiate the design stage for the new or changed service if the Change Proposal is authorized.\n"},{"id":"4685baaa","name":"Service Portfolio Manager","type":"BusinessActor","layer":"business","documentation":"The Service Portfolio Manager decides on a strategy to serve customers in cooperation with the IT Steering Group, and develops the service provider's offerings and capabilities.\n"},{"id":"f6856e7c","name":"Service Portfolio  ","type":"BusinessObject","layer":"business","documentation":"The Service Portfolio represents a complete list of the services managed by a service provider; some of these services are visible to the customers, while others are not. It contains present contractual commitments, new service development, and ongoing service improvement plans initiated by Continual Service Improvement. It also includes third-party services which are an integral part of service offerings to customers. The Service Portfolio is divided into three phases: Service Pipeline, Service Catalogue, and Retired Services (see also: ITIL Checklist Service Portfolio).\n"},{"id":"e05d2a7f","name":"Define and Analyze new or changed Services  ","type":"BusinessProcess","layer":"business","documentation":"Process Objective: To define the desired outcomes of a proposed new or changed service, analyze the impacts on existing services in the Service Portfolio, and determine the assets required to offer the service.\n"},{"id":"486578b3","name":"Clearing","type":"BusinessFunction","layer":"business","documentation":""},{"id":"bbd4d740","name":"Service Charter  ","type":"BusinessObject","layer":"business","documentation":"The Service Charter is a high-level description of a new or substantially changed service and the approach to build that service. In particular, the Service Charter outlines the deliverables to be created during the service implementation project, the required resources, and an initial project schedule. Service Charters are passed to Service Design to initiate the detailed design of the new or changed service. (Note: New output in ITIL 2011.)\n"},{"id":"9578befa","name":"Clearing","type":"BusinessProcess","layer":"business","documentation":"transmitting, reconciling and, in some cases, confirming transfer orders prior to settlement, potentially including the netting of orders and the establishment of final positions for settlement. Sometimes this term is also used (imprecisely) to cover settlement. For the clearing of futures and options, this term also refers to the daily balancing of profits and losses and the daily calculation of collateral requirements. "},{"id":"c5f889f7","name":"Change Proposal  ","type":"BusinessObject","layer":"business","documentation":"A Change Proposal describes a proposed major Change, like the introduction of a new service or a substantial change to an existing service. The purpose of Change Proposals is to communicate a proposed major Change and assess its risk, impact and feasibility before design activities begin. Change Proposals are typically created in Service Portfolio Management.\n"},{"id":"b4d08a7e","name":"Access Manager","type":"BusinessActor","layer":"business","documentation":"The Access Manager grants authorized users the right to use a service, while preventing access to non-authorized users., The Access Manager essentially executes policies defined in Information Security Management."},{"id":"a15894e7","name":"Risk Manager","type":"BusinessActor","layer":"business","documentation":"The Risk Manager is responsible for identifying, assessing and controlling risks., This includes analyzing the value of assets to the business, identifying threats to those assets, and evaluating how vulnerable each asset is to those threats."},{"id":"d9eee3a2","name":"Service Catalogue Manager","type":"BusinessActor","layer":"business","documentation":"The Service Catalogue Manager is responsible for maintaining the Service Catalogue, ensuring that all information within the Service Catalogue is accurate and up-to-date."},{"id":"5dc3aa4c","name":"1st Level Support","type":"BusinessActor","layer":"business","documentation":"The responsibility of 1st Level Support is to register and classify received Incidents and to undertake an immediate effort in order to restore a failed IT service as quickly as possible., If no ad-hoc solution can be achieved, 1st Level Support will transfer the Incident to expert technical support groups (2nd Level Support)., 1st Level Support also processes Service Requests and keeps users informed about their Incidents' status at agreed intervals."},{"id":"530c65f7","name":"Incident Manager","type":"BusinessActor","layer":"business","documentation":"The Incident Manager is responsible for the effective implementation of the Incident Management process and carries out the corresponding reporting., He represents the first stage of escalation for Incidents, should these not be resolvable within the agreed Service Levels."},{"id":"8ec4fb68","name":"Knowledge Manager","type":"BusinessActor","layer":"business","documentation":"The Knowledge Manager ensures that the IT organization is able to gather, analyze, store and share knowledge and information., His primary goal is to improve efficiency by reducing the need to rediscover knowledge."},{"id":"e153c2fc","name":"3rd Level Support","type":"BusinessActor","layer":"business","documentation":"3rd Level Support is typically located at hardware or software manufacturers (third-party suppliers)., Its services are requested by 2nd Level Support if required for solving an Incident., The aim is to restore a failed IT Service as quickly as possible."},{"id":"6017bf04","name":"IT Steering Group (ISG)","type":"BusinessActor","layer":"business","documentation":"The IT Steering Group (ISG) sets the direction and strategy for IT Services. It includes members of senior management from business and IT., The ISG reviews the business and IT strategies in order to make sure that they are aligned., It also sets priorities of service development programs/ projects."},{"id":"cb0388d4","name":"Capacity Manager","type":"BusinessActor","layer":"business","documentation":"The Capacity Manager is responsible for ensuring that services and infrastructure are able to deliver the agreed capacity and performance targets in a cost effective and timely manner., He considers all resources required to deliver the service, and plans for short, medium and long term business requirements."},{"id":"1ed4c65d","name":"Configuration Manager","type":"BusinessActor","layer":"business","documentation":"The Configuration Manager is responsible for maintaining information about Configuration Items required to deliver IT services., To this end he maintains a logical model, containing the components of the IT infrastructure (CIs) and their associations., Emergency Change Advisory Board (ECAB), A sub-set of the Change Advisory Board who makes decisions about high impact Emergency Changes., Membership of the ECAB may be decided at the time a meeting is called, and depends on the nature of the Emergency Change."},{"id":"b61c86b2","name":"Release Manager","type":"BusinessActor","layer":"business","documentation":"The Release Manager is responsible for planning and controlling the movement of Releases to test and live environments."},{"id":"766c86a5","name":"Major Incident Team","type":"BusinessActor","layer":"business","documentation":"A dynamically established team of IT managers and technical experts, usually under the leadership of the Incident Manager, formulated to concentrate on the resolution of a Major Incident."},{"id":"cc8556e2","name":"Information Security Manager","type":"BusinessActor","layer":"business","documentation":"The Information Security Manager is responsible for ensuring the confidentiality, integrity and availability of an organization’s assets, information, data and IT services., He is usually involved in an organizational approach to Security Management which has a wider scope than the IT service provider, and includes handling of paper, building access, phone calls etc., for the entire organization."},{"id":"fac3ea99","name":"Service Owner","type":"BusinessActor","layer":"business","documentation":"The Service Owner is responsible for delivering a particular service within the agreed service levels., Typically, he acts as the counterpart of the Service Level Manager when negotiating Operational Level Agreements (OLAs)., Often, the Service Owner will lead a team of technical specialists or an internal support unit."},{"id":"da1f1230","name":"Problem Manager","type":"BusinessActor","layer":"business","documentation":"The Problem Manager is responsible for managing the lifecycle of all Problems., His primary objectives are to prevent Incidents from happening, and to minimize the impact of Incidents that cannot be prevented., To this purpose he maintains information about Known Errors and Workarounds."},{"id":"673573d0","name":"IT Operations Manager","type":"BusinessActor","layer":"business","documentation":"An IT Operations Manager will be needed to take overall responsibility for a number of Service Operation activities., For instance, this role will ensure that all day-to-day operational activities are carried out in a timely and reliable way."},{"id":"7437c0c2","name":"Service User","type":"BusinessActor","layer":"business","documentation":"A person who uses one or several IT services on a day-to-day basis. Service Users are distinct from Customers, as some Customers do not use IT services directly., "},{"id":"b948138c","name":"Project Manager","type":"BusinessActor","layer":"business","documentation":"The Project Manager is responsible for planning and coordinating the resources to deploy a major Release within the predicted cost, time and quality estimates., The Release Manager is responsible for planning and controlling the movement of Releases to test and live environments."},{"id":"3b3ddeb2","name":"Process Architect","type":"BusinessActor","layer":"business","documentation":"The Process Architect is responsible for maintaining the Process Architecture (part of the Enterprise Architecture), coordinating all changes to processes and making sure that all processes cooperate in a seamless way., This role often also supports all parties involved in managing and improving processes, in particular the Process Owners. Some organizations combine this role with the Enterprise Architect role."},{"id":"0f635945","name":"Application Developer","type":"BusinessActor","layer":"business","documentation":"The Application Developer is responsible for making available applications and systems which provide the required functionality for IT services., This includes the development and maintenance of custom applications as well as the customization of products from software vendors."},{"id":"d0f75ceb","name":"Supplier Manager","type":"BusinessActor","layer":"business","documentation":"The Supplier Manager is responsible for ensuring that value for money is obtained from all suppliers., He makes sure that contracts with suppliers support the needs of the business, and that all suppliers meet their contractual commitments."},{"id":"6f74ed73","name":"Technical Analyst","type":"BusinessActor","layer":"business","documentation":"The Technical Analyst is a Technical Management role which provides technical expertise and support for the management of the IT infrastructure., There is typically one Technical Analyst or team of analysts for every key technology area., This role plays an important part in the technical aspects of designing, testing, operating and improving IT services., It is also responsible for developing the skills required to operate the IT infrastructure., ITIL roles and boards - Service Transition"},{"id":"13224895","name":"Compliance Manager","type":"BusinessActor","layer":"business","documentation":"The Compliance Manager's responsibility is to ensure that standards and guidelines is followed, or that proper, consistent accounting or other practices are being employed., This includes to make sure that external legal requirements are fulfilled."},{"id":"65ff89e4","name":"IT Service Continuity Manager","type":"BusinessActor","layer":"business","documentation":"The IT Service Continuity Manager is responsible for managing risks that could seriously impact IT services., He ensures that the IT service provider can provide minimum agreed service levels in cases of disaster, by reducing the risk to an acceptable level and planning for the recovery of IT services."},{"id":"05aa2d99","name":"Customer","type":"BusinessActor","layer":"business","documentation":"Someone who buys IT services., The Customer of an IT service provider is the person or group who defines and agrees the service level targets."},{"id":"c7706792","name":"Service Strategy Manager","type":"BusinessActor","layer":"business","documentation":"The Service Strategy Manager supports the IT Steering Group in producing and maintaining the service provider's strategy., This role is also responsible for communicating and implementing the service strategy., The Service Strategy Manager has been introduced as a new role in ITIL 2011."},{"id":"650606f9","name":"CSI Manager","type":"BusinessActor","layer":"business","documentation":"The Continual Service Improvement (CSI) Manager is responsible for managing improvements to IT Service Management processes and IT services., He will continually measure the performance of the service provider and design improvements to processes, services and infrastructure in order to increase efficiency, effectiveness, and cost effectiveness."},{"id":"0d52ee63","name":"Demand Manager","type":"BusinessActor","layer":"business","documentation":"The role Demand Manager has been introduced in ITIL 2011 to perform the activities in the Demand Management process., The Demand Manager is responsible for understanding, anticipating and influencing customer demand for services., The Demand Manager works with capacity management to ensure that the service provider has sufficient capacity to meet the required demand."},{"id":"50b4f1fc","name":"Process Owner","type":"BusinessActor","layer":"business","documentation":"A role responsible for ensuring that a process is fit for purpose., The Process Owner’s responsibilities include sponsorship, design, and continual improvement of the process and its metrics., In larger organizations there might be separate Process Owner and Process Manager roles, where the Process Manager has responsibility for the operational management of a process., ITIL roles outside the IT organization"},{"id":"fceed450","name":"Service Portfolio Manager","type":"BusinessActor","layer":"business","documentation":"The Service Portfolio Manager decides on a strategy to serve customers in cooperation with the IT Steering Group, and develops the service provider's offerings and capabilities."},{"id":"3792f150","name":"Service Level Manager","type":"BusinessActor","layer":"business","documentation":"The Service Level Manager is responsible for negotiating Service Level Agreements and ensuring that these are met., He makes sure that all IT Service Management processes, Operational Level Agreements and Underpinning Contracts are appropriate for the agreed service level targets., The Service Level Manager also monitors and reports on service levels."},{"id":"1f269918","name":"IT Operator","type":"BusinessActor","layer":"business","documentation":"IT Operators are the staff who perform the day-to-day operational activities., Typical responsibilities include: Performing backups, ensuring that scheduled jobs are performed, installing standard equipment in the data center."},{"id":"e01f1539","name":"Change Advisory Board (CAB)","type":"BusinessActor","layer":"business","documentation":"A group of people that advises the Change Manager in the assessment, prioritization and scheduling of Changes., This board is usually made up of representatives from all areas within the IT organization, the business, and third parties such as suppliers."},{"id":"44d5066e","name":"Change Manager","type":"BusinessActor","layer":"business","documentation":"The Change Manager controls the lifecycle of all Changes., His primary objective is to enable beneficial Changes to be made, with minimum disruption to IT services., For important Changes, the Change Manager will refer the authorization of Changes to the Change Advisory Board (CAB)."},{"id":"b2ba5d2a","name":"Test Manager","type":"BusinessActor","layer":"business","documentation":"The Test Manager ensures that deployed Releases and the resulting services meet customer expectations, and verifies that IT operations is able to support the new service., ITIL roles and boards - Service Operation"},{"id":"75fef400","name":"Applications Analyst","type":"BusinessActor","layer":"business","documentation":"The Applications Analyst is an Application Management role which manages applications throughout their lifecycle., There is typically one Applications Analyst or team of analysts for every key application., This role plays an important part in the application-related aspects of designing, testing, operating and improving IT services., It is also responsible for developing the skills required to operate the applications required to deliver IT services."},{"id":"ad584f18","name":"Service Design Manager","type":"BusinessActor","layer":"business","documentation":"The Service Design Manager is responsible for producing quality, secure and resilient designs for new or improved services., This includes producing and maintaining all design documentation."},{"id":"9d7597c5","name":"Availability Manager","type":"BusinessActor","layer":"business","documentation":"The Availability Manager is responsible for defining, analyzing, planning, measuring and improving all aspects of the availability of IT services., He is responsible for ensuring that all IT infrastructure, processes, tools, roles etc. are appropriate for the agreed service level targets for availability."},{"id":"1fd9a8fa","name":"Service Request Fulfilment Group","type":"BusinessActor","layer":"business","documentation":"Service Request Fulfilment Groups specialize on the fulfillment of certain types of Service Requests., Typically, 1st Level Support will process simpler requests, while others are forwarded to the specialized Fulfilment Groups., ITIL roles - Continual Service Improvement"},{"id":"85b9094d","name":"Enterprise Architect","type":"BusinessActor","layer":"business","documentation":"The Enterprise Architect is responsible for maintaining the Enterprise Architecture (EA), a description of the essential components of a business, including their interrelationships., Bigger organizations may opt to introduce specialist EA roles like Business Architect, Application Architect, Information Architect, or Infrastructure Architect."},{"id":"841d9971","name":"Business Relationship Manager","type":"BusinessActor","layer":"business","documentation":"The Business Relationship Manager is responsible for maintaining a positive relationship with customers, identifying customer needs and ensuring that the service provider is able to meet these needs with an appropriate catalogue of services., The Business Relationship Manager works closely with the Service Level Manager., The Business Relationship Manager has been introduced as a new role in ITIL 2011."},{"id":"e1f46804","name":"2nd Level Support","type":"BusinessActor","layer":"business","documentation":"2nd Level Support takes over Incidents which cannot be solved immediately with the means of 1st Level Support., If necessary, it will request external support, e.g. from software or hardware manufacturers., The aim is to restore a failed IT Service as quickly as possible."},{"id":"0e827a0e","name":"Facilities Manager","type":"BusinessActor","layer":"business","documentation":"The Facilities Manager is responsible for managing the physical environment where the IT infrastructure is located., This includes all aspects of managing the physical environment, for example power and cooling, building access management, and environmental monitoring."},{"id":"74d2ddcd","name":"Financial Manager","type":"BusinessActor","layer":"business","documentation":"The Financial Manager is responsible for managing an IT service provider's budgeting, accounting and charging requirements."},{"id":"3f2ebf53","name":"Showback","type":"BusinessProcess","layer":"business","documentation":""},{"id":"1879ba42","name":"Chargeback","type":"BusinessProcess","layer":"business","documentation":""},{"id":"7209ac7f","name":"Activity based costing","type":"BusinessProcess","layer":"business","documentation":""},{"id":"b2675f32","name":"Performnce Based Charging","type":"BusinessProcess","layer":"business","documentation":""},{"id":"64675337","name":"Cost Analysis","type":"BusinessProcess","layer":"business","documentation":"Cost reports (standard, custom, ad hoc) are generated and the results are analyzed\nOperational and business partner analytics performed on costing results\nCompare actual output values with budgeted values"},{"id":"caddabc9","name":"Cost Assignment","type":"BusinessProcess","layer":"business","documentation":"Costing relationships are developed and required calculations performed Costing relationships are developed and required calculations performed\nDesign and development of IT cost models\nProduction of cost for products, services, applications and business partners."},{"id":"cf29a9c2","name":"Costing Model","type":"BusinessObject","layer":"business","documentation":""},{"id":"17b6b911","name":"Allocation Model","type":"BusinessObject","layer":"business","documentation":""},{"id":"6d929cd9","name":"Data Collection ","type":"BusinessProcess","layer":"business","documentation":"Financial and operational data is collected, loaded and data owners identified\nReview and analysis of the data collection and maintenance process\nDesign and implementation of data integration\nIdentification and selection of operational data used for cost drivers. "},{"id":"966b73d4","name":"Manage Business","type":"BusinessProcess","layer":"business","documentation":"Manage Business \nAnalytics are translated into business decisions\nIntegration of actual cost results into the budgeting and forecasting processes\nReview results with operations and business partners identifying improvement opportunities. "},{"id":"f1d5788e","name":"Planning","type":"BusinessFunction","layer":"business","documentation":""},{"id":"5aa5a6d6","name":"Allocate IT Costs","type":"BusinessFunction","layer":"business","documentation":""},{"id":"2a8704f6","name":"Calculate usage cost (invoice)","type":"BusinessFunction","layer":"business","documentation":""},{"id":"78435270","name":"Variance Analysis","type":"BusinessFunction","layer":"business","documentation":""},{"id":"645a9cba","name":"Forecacsting","type":"BusinessFunction","layer":"business","documentation":""},{"id":"ffb42cb0","name":"IT Financial Management","type":"BusinessProcess","layer":"business","documentation":"Financial Management\n2.4.1 Process Overview\nThe Financial Management process provides the business and IT with the quantification (in financial terms) of the value of IT services, the value of the assets underlying the provisioning of those services, and the qualification of operational forecasting. It includes all function and processes responsible for managing an IT service provider's budgeting, accounting and charging policies and activities.\nKey objectives of Financial Management are:\n• Establishing and enforcing IT financial controls\n• Ensuring compliance with legal, industry, and corporate standards and procedures\nAssisting IT portfolio investment decisions by providing detailed business cases as well as financial input for decision support\n• Effectively predicting and controlling IT budgets\n• Providing the enterprise with operational visibility, insight, and superior decision-making.\nThe overriding goal of Financial Management is to provide cost effective stewardship of the IT assets and the financial resources used in providing IT services. Primarily this is to enable an organization to account fully for the financial resources consumed by the IT service provider and to attribute these costs to the services delivered to the organization’s customers.\nThis is accomplished by the categorization, collection and analysis of accounting, contract and pricing data including the following typical cost elements:\n• Hardware and software license costs\n• Annual maintenance fees for hardware and software\n• Personnel resources used in the support or maintenance of a service\n• Utilities, data centre or other facilities charges\n• Taxes, capital or interest charges\n• Compliance costs\n• Transfer costs and internal charging by other business units/processes.\n"},{"id":"b8c6dd55","name":"Business Impact Analysis ","type":"BusinessProcess","layer":"business","documentation":""},{"id":"59228ca8","name":"Financial Demand Modelling ","type":"BusinessProcess","layer":"business","documentation":""},{"id":"518b9f2e","name":"Funding Models  Evaluation ","type":"BusinessProcess","layer":"business","documentation":""},{"id":"56c32011","name":"Service Provisioning Analysis and Optimization ","type":"BusinessProcess","layer":"business","documentation":""},{"id":"f0d308e6","name":"Service Valuation ","type":"BusinessProcess","layer":"business","documentation":""},{"id":"e88711ae","name":"Variable Cost Dynamics Analysis ","type":"BusinessProcess","layer":"business","documentation":""},{"id":"3456f2e0","name":"Business Process","type":"BusinessProcess","layer":"business","documentation":""},{"id":"95d9a583","name":"Auditing","type":"BusinessProcess","layer":"business","documentation":""},{"id":"8892ccd3","name":"Plan & Control Budgets ","type":"BusinessProcess","layer":"business","documentation":"Establish budgeting framework based on DoD standards. Align budgetary plants to DoD standards and the PPBE process.\n"},{"id":"92ac7abd","name":"Communicate to Stakeholders ","type":"BusinessProcess","layer":"business","documentation":"Publish budget allocations to customer Business Financial Managers (BFMs) to initiate financial management budgeting process.\n"},{"id":"cdf00315","name":"Service Investment Authorized? ","type":"BusinessProcess","layer":"business","documentation":"Determine whether requests for new Service Investments are approved or rejected. The Financial Management Approval Committee (a Government role which is TBD), will allocate financial and workforce resources to approved requests and communicate the authorization to stakeholders. Rejected requests are re-submitted for Service Valuation (Step 2.0).\n"},{"id":"a8167554","name":"Portfolio Investment Analysis ","type":"BusinessProcess","layer":"business","documentation":"Analyze the cost and benefits of the new service(s) under consideration based on impact to the NGEN program, infrastructure, and existing services. Develop business case to support the Service Portfolio Management process.\n"},{"id":"1e1c35c2","name":"Service Valuation ","type":"BusinessProcess","layer":"business","documentation":"Quantify (in financial terms), the value of IT Services and the value of the assets underlying the provisioning of those services.\n"},{"id":"f469f143","name":"Initiation of Financial Analysis ","type":"BusinessProcess","layer":"business","documentation":"Assist financial management with managing IT resources using inputs from Change, Demand, Service Portfolio and Supplier Management processes.\n"},{"id":"da3b1de2","name":"Business Process","type":"BusinessProcess","layer":"business","documentation":""},{"id":"a0305641","name":"Auditing","type":"BusinessProcess","layer":"business","documentation":"Examine financial data and the Financial Management process to determine level of conformance to NGEN standards and practices. This activity also identifies irregularities and improvement opportunities."},{"id":"be0c8a04","name":"Administer Charging ","type":"BusinessProcess","layer":"business","documentation":"Recover cost of IT services by charging customers for services rendered. Deliver bills to customers for payment based on an established pricing model as defined in NGEN’s chargeback framework.\n"},{"id":"4dd3f651","name":"Service Accounting ","type":"BusinessProcess","layer":"business","documentation":"Track and record all costs incurred in the NGEN program and attribute those costs to NGEN customers. Perform this activity continuously\n"},{"id":"7b56b4d5","name":"Service Ordering/ Invoices ","type":"BusinessProcess","layer":"business","documentation":"Initiate procurement by selecting the appropriate supplier(s) and placing the order. Attribute actual usage data to customers and apply the NGEN pricing model to support invoicing.\n"},{"id":"765eb22d","name":"Budget Execution","type":"BusinessProcess","layer":"business","documentation":""},{"id":"69de26fb","name":"Financial Analyst","type":"BusinessActor","layer":"business","documentation":""},{"id":"81e07203","name":"Billing Admin","type":"BusinessActor","layer":"business","documentation":""},{"id":"9c876846","name":"Asset Manager","type":"BusinessActor","layer":"business","documentation":""},{"id":"09b84769","name":"Cost Planning","type":"BusinessProcess","layer":"business","documentation":""},{"id":"df1e6561","name":"Determine / Revise mode of costing","type":"BusinessProcess","layer":"business","documentation":""},{"id":"480c5c90","name":"Determine / Revise budget","type":"BusinessProcess","layer":"business","documentation":""},{"id":"36749963","name":"Define / Revise Standard cost units and chargable items","type":"BusinessProcess","layer":"business","documentation":""},{"id":"e2abe3c0","name":"Determine / Revise sources for resource usage","type":"BusinessProcess","layer":"business","documentation":""},{"id":"5550a40d","name":"Determine / Revise charging policies, charging calculations, and pricing methodologies","type":"BusinessProcess","layer":"business","documentation":""},{"id":"81c15228","name":"Analyze usage and cost reporting","type":"BusinessProcess","layer":"business","documentation":""},{"id":"b0ecd627","name":"Calculate Total Cost of Ownership","type":"BusinessProcess","layer":"business","documentation":""},{"id":"935691a0","name":"Calculate invoice and bill customer","type":"BusinessProcess","layer":"business","documentation":""},{"id":"92290fe3","name":"Recieve Payment","type":"BusinessProcess","layer":"business","documentation":""},{"id":"f155ce14","name":"Track financial assets","type":"BusinessProcess","layer":"business","documentation":""},{"id":"aff33767","name":"Business Unit","type":"BusinessActor","layer":"business","documentation":""},{"id":"8c9c5e6a","name":"Employee","type":"BusinessActor","layer":"business","documentation":""},{"id":"7678e9cf","name":"Manager","type":"BusinessActor","layer":"business","documentation":""},{"id":"8f74c7b3","name":"Supervisor","type":"BusinessActor","layer":"business","documentation":""},{"id":"29d98cfa","name":"User","type":"BusinessActor","layer":"business","documentation":""},{"id":"11ec4976","name":"financial management administrator","type":"BusinessActor","layer":"business","documentation":"[financial_mgmt_admin]\n\nSets up and administers the entire cost model, which includes the general ledger and the items used in the allocation process, like rules, methods, metrics, and so on. Creates, modifies, and deletes allocation lines, fiscal periods, and reports.\n\n"},{"id":"11fcbaff","name":"financial management user ","type":"BusinessActor","layer":"business","documentation":"[financial_mgmt_user]\n\nViews general ledger records and allocation records for reporting purposes."},{"id":"5b4b7e02","name":"financial analyst ","type":"BusinessActor","layer":"business","documentation":"[financial_analyst]\n\nUses the workbench to allocate expenses. Modifies the cost model. Creates, edits, and deletes financial reports."},{"id":"db5be646","name":"data mart administrator ","type":"BusinessActor","layer":"business","documentation":"[data_mart_admin]\n\nCreates, modifies, and deletes records in the data mart. Creates dimension tables that can be used as a segment, so that financial management administrators and analysts can add the segments to the IT chart of accounts."},{"id":"5fd49dc4","name":"Budget Owner","type":"BusinessActor","layer":"business","documentation":"Budget owners can view all items that budget keys are associated with, such as budget plans and forecasts.\n\nBudget owners are users in the instance that you can associate with a budget plan. Create a budget owner record to give a user the budget_owner role, which grants access to budget plans and forecasts."},{"id":"b6774223","name":"Budget Key Owner","type":"BusinessActor","layer":"business","documentation":"Budget key owners are also users in the instance that you can associated with a budget key, and thereby budget plans as well. Budget key ownership can be full or limited:\n\nFull access allows the owner to access everything associated with the budget key, including budget plans and forecasts, targets, and budget key expenses.\nLimited access allows the owner to see only the budget plans they own and the items in those plans.\nBudget key owners also have the same level of access to the items associated with child budget keys."},{"id":"2579f205","name":"Budget Analyst","type":"BusinessActor","layer":"business","documentation":""},{"id":"f1cea098","name":"budget Admin","type":"BusinessActor","layer":"business","documentation":""},{"id":"64186310","name":"End User","type":"BusinessActor","layer":"business","documentation":""},{"id":"5054a846","name":"Stages","type":"DataObject","layer":"application","documentation":"{in_progress, canceled, paused, completed, breached}"},{"id":"f43a5a75","name":"States","type":"DataObject","layer":"application","documentation":"{open, assigned, in_progress, resolved, closed}"},{"id":"cff50ff1","name":"SMAG Contract","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"124cd2f7","name":"SMAG Snow App","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"395f4fae","name":"Web Frontend","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"541a9e2b","name":"API Frontend","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"f4d2edfb","name":"Budgeting","type":"ApplicationFunction","layer":"application","documentation":""},{"id":"b2d9e5d5","name":"Usage Record","type":"DataObject","layer":"application","documentation":""},{"id":"94d77be2","name":"Accounting","type":"ApplicationFunction","layer":"application","documentation":""},{"id":"ec94f979","name":"Chargeback/Showback FC","type":"ApplicationFunction","layer":"application","documentation":"7.4.8 Chargeback/Showback Functional Component\nPurpose\n•  Provide chargeback or showback for internal and external services taking into account service Subscription and Usage information.\n•  Break down chargeback or showback based on charge types such as CapEx/OpEx, direct/indirect, fixed/variable, and labor/non-labor, as well as by consumer or consumer groups.\n•  Charge for IT services rendered based on the pricing model associated with the catalog item, this may also be implemented via showback (no actual billing or cross-charging), which helps the consumer become more IT cost-aware.\n•  Trace chargeback or showback line items to individual cost drivers based on the cost model.\n•  Consolidate IT service Subscription (right to use) and actual Usage as the usage may differ from the right to use.\n\nThe Chargeback/Showback functional component:\n•  Shall provide the price of consuming/subscribing to a service.\n•  Can take actual usage into consideration when calculating the price of consuming a service.\nIf an IT Financial Management component exists, the Chargeback/Showback functional component:\n•  Can provide the necessary information in order for the IT Financial Management supporting function to produce invoices or bills for services rendered."},{"id":"824f83e3","name":"ServiceNow","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"cefcbf8e","name":"Users Controler","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"78ec8045","name":"User Wallt","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"d6ba30ec","name":"Groups Controler","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"cacbe3bd","name":"Service Catalog","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"131ac6bb","name":"Website","type":"ApplicationInterface","layer":"application","documentation":""},{"id":"4c522f1a","name":"API","type":"ApplicationInterface","layer":"application","documentation":""},{"id":"617e2a37","name":"Webservice","type":"ApplicationService","layer":"application","documentation":""},{"id":"44a69c05","name":"Web Frontend","type":"ApplicationService","layer":"application","documentation":""},{"id":"09c78617","name":"Task Record","type":"DataObject","layer":"application","documentation":""},{"id":"d7f9fe52","name":"Wallet","type":"DataObject","layer":"application","documentation":""},{"id":"1729b388","name":"Budget","type":"DataObject","layer":"application","documentation":""},{"id":"de1ffa53","name":"Offer Record","type":"DataObject","layer":"application","documentation":""},{"id":"1c11a754","name":"Fulfillment Request","type":"DataObject","layer":"application","documentation":""},{"id":"b735f926","name":"Subscription","type":"DataObject","layer":"application","documentation":""},{"id":"edee5551","name":"Data Object","type":"DataObject","layer":"application","documentation":""},{"id":"a3560c3b","name":"Mist","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"6ad71be9","name":"Web3 API","type":"ApplicationInterface","layer":"application","documentation":""},{"id":"58889dce","name":"RPC","type":"ApplicationInterface","layer":"application","documentation":""},{"id":"215d2e14","name":"Invoice","type":"DataObject","layer":"application","documentation":""},{"id":"e715674f","name":"Bill","type":"DataObject","layer":"application","documentation":""},{"id":"8e91bfb7","name":"Chargeback Contract","type":"DataObject","layer":"application","documentation":"Details the financial obligations between the service consumer and provider(s). The Chargeback Contract typically defines the unit of measure (price) for a given service and is often tightly linked to Usage.\nKey Attributes\n\nThe Chargeback Contract data object shall have the following key data attributes:\n•  ChargebackContractID: Unique identifier for the Service Contract.\n•  SubscriptionID: Link to the Subscription for which this Service Contract is instantiated (from Subscription).\nKey Data Object Relationships\n\nThe Chargeback Contract data object shall maintain the following relationships:\n•  Chargeback Contract to Subscription (n:1): This relationship provides the traceability between the service rendered (represented by the Subscription) and the expected charges for those services (described in the Chargeback Contract)."},{"id":"ae8414d6","name":"Pricing","type":"ApplicationComponent","layer":"application","documentation":"•Shall provide the price of consuming/subscribing to a service"},{"id":"fa1d2739","name":"Usage","type":"ApplicationComponent","layer":"application","documentation":"Can take actual usage into consideration when calculating the price of consuming a service."},{"id":"301749f7","name":"Produce invoices","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"cc03ada9","name":"Produce bills","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"fb5c1198","name":"Check Balance","type":"ApplicationFunction","layer":"application","documentation":""},{"id":"5ddd05ce","name":"Fund Wallet","type":"ApplicationFunction","layer":"application","documentation":""},{"id":"2e9b00db","name":"Update Balance","type":"ApplicationFunction","layer":"application","documentation":""},{"id":"01cf09cd","name":"Calculate Task Deposit","type":"ApplicationFunction","layer":"application","documentation":""},{"id":"62831510","name":"Calculate Task Invoice","type":"ApplicationFunction","layer":"application","documentation":""},{"id":"738b4602","name":"Settle Task","type":"ApplicationFunction","layer":"application","documentation":""},{"id":"9e25ae3e","name":"Calculate Invoice","type":"ApplicationFunction","layer":"application","documentation":""},{"id":"6dd1482b","name":"Calculate Bill","type":"ApplicationFunction","layer":"application","documentation":""},{"id":"d46341d1","name":"Terms and Conditions","type":"DataObject","layer":"application","documentation":""},{"id":"9d4a7175","name":"RTGS system","type":"ApplicationComponent","layer":"application","documentation":"A system where ensuing monetary obligations are settled"},{"id":"582f21cc","name":"Accounting Rules","type":"DataObject","layer":"application","documentation":""},{"id":"9f685f15","name":"Service Definition","type":"DataObject","layer":"application","documentation":""},{"id":"88abd8d8","name":"Clearing system","type":"ApplicationComponent","layer":"application","documentation":" a set of rules and procedures whereby financial institutions present and exchange data and/or documents relating to transfers of funds or securities to other fi nancial institutions at a single location (e.g. a clearing house). These procedures often include a mechanism for calculating participants’ mutual positions, potentially on a net basis, with a view to facilitating the settlement of their obligations in a settlement system."},{"id":"135c224c","name":"Deferred net settlement system","type":"ApplicationComponent","layer":"application","documentation":"a system which settles on a net basis at the end of a predefi ned\nsettlement cycle (typically at the end of – but sometimes during – the business day)."},{"id":"ed1108ee","name":"Users","type":"DataObject","layer":"application","documentation":""},{"id":"019a1ec5","name":"Service Level Definition","type":"DataObject","layer":"application","documentation":""},{"id":"4035a755","name":"Conflict Resolution Rules","type":"DataObject","layer":"application","documentation":""},{"id":"05b27ce8","name":"Ancillary system","type":"ApplicationComponent","layer":"application","documentation":"a system in which payments or securities are exchanged and/or cleared. Meanwhile,\nthe ensuing monetary obligations are settled in another system, typically an RTGS system"},{"id":"49af0e79","name":"Bilateral net settlement system","type":"ApplicationComponent","layer":"application","documentation":"a settlement system in which every individual bilateral\ncombination of participants settles its net settlement position on a bilateral basis."},{"id":"bdeccf8c","name":"Indirect Cost Allocation Table  ","type":"DataObject","layer":"application","documentation":"A table used to allocate indirect costs that are shared among multiple services, defining the rules how those costs are spread among the services.\n"},{"id":"07ae79b9","name":"Get Price","type":"ApplicationFunction","layer":"application","documentation":""},{"id":"f11ff7da","name":"Calculate Estimate","type":"ApplicationFunction","layer":"application","documentation":""},{"id":"35d517ed","name":"Budeting","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"31f8173d","name":"Accounting","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"5c4130f0","name":"Charging","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"6457f10b","name":"Submit service request","type":"ApplicationInteraction","layer":"application","documentation":""},{"id":"6b214708","name":"Offer","type":"DataObject","layer":"application","documentation":""},{"id":"00434e51","name":"Service Objectivs","type":"DataObject","layer":"application","documentation":""},{"id":"2b40a4a3","name":"IT Service Continuity Plan","type":"DataObject","layer":"application","documentation":"is input for"},{"id":"eb57e440","name":"Cost of Non-Availability","type":"DataObject","layer":"application","documentation":"is input for"},{"id":"a4954124","name":"Charging Models","type":"DataObject","layer":"application","documentation":"is input for"},{"id":"bd4fa161","name":"Strategic requirements for new services","type":"DataObject","layer":"application","documentation":"is input for"},{"id":"009b5453","name":"Availability Plan","type":"DataObject","layer":"application","documentation":"is input for"},{"id":"dbceed9d","name":"Business impact analysis","type":"DataObject","layer":"application","documentation":"has as output"},{"id":"2b6ae0cf","name":"Capacity Plan","type":"DataObject","layer":"application","documentation":"is input for"},{"id":"4c5b6aef","name":"Configuration Item","type":"DataObject","layer":"application","documentation":"is input for"},{"id":"bfc71618","name":"Value proposition","type":"DataObject","layer":"application","documentation":"has as output"},{"id":"29ce3ad0","name":"Service Provisioning Cost Assessment","type":"DataObject","layer":"application","documentation":"has as output"},{"id":"9fd3311e","name":"Charging Models","type":"DataObject","layer":"application","documentation":"has as output"},{"id":"289a41b1","name":"Policies","type":"DataObject","layer":"application","documentation":"is input for"},{"id":"c48f720e","name":"Cost Data","type":"DataObject","layer":"application","documentation":"has as output"},{"id":"4cfe47bc","name":"Reports on investment","type":"DataObject","layer":"application","documentation":"is input for"},{"id":"73113041","name":"CMDB","type":"DataObject","layer":"application","documentation":"is input for"},{"id":"c9256c8f","name":"Supplier Contract","type":"DataObject","layer":"application","documentation":"is input for"},{"id":"1f50c6ca","name":"Actual Patterns","type":"DataObject","layer":"application","documentation":"is input for"},{"id":"ec2ac6e2","name":"Core Service","type":"DataObject","layer":"application","documentation":"is input for"},{"id":"b8c4974b","name":"Service investment analysis","type":"DataObject","layer":"application","documentation":"has as output"},{"id":"3c9960d2","name":"Provisioning Value","type":"DataObject","layer":"application","documentation":"has as output"},{"id":"ca83c9d7","name":"SLA","type":"DataObject","layer":"application","documentation":"is input for"},{"id":"aedf8973","name":"Financial information","type":"DataObject","layer":"application","documentation":"has as output"},{"id":"8e7a7dfd","name":"IT Budget","type":"DataObject","layer":"application","documentation":"has as output"},{"id":"a22c9d73","name":"State Enum","type":"DataObject","layer":"application","documentation":"{open, assigned, in_progress, resolved, closed}"},{"id":"5520fb6f","name":"Stages (copy)","type":"DataObject","layer":"application","documentation":"{in_progress, canceled, paused, completed, breached}"},{"id":"48f5ef2e","name":"Enterprise Architecture Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"774b264f","name":"Service Architecture","type":"DataObject","layer":"application","documentation":""},{"id":"69d8ac53","name":"Policy Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"d7389082","name":"Policy","type":"DataObject","layer":"application","documentation":""},{"id":"3de0d198","name":"Portfolio Demand Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"b62c4a15","name":"Portfolio Backlog Item","type":"DataObject","layer":"application","documentation":""},{"id":"67073bff","name":"Service Portfolio Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"d5cebb36","name":"Conceptual Service","type":"DataObject","layer":"application","documentation":""},{"id":"8ec6c4fe","name":"Conceptual Service Blueprint","type":"DataObject","layer":"application","documentation":""},{"id":"ef45dc57","name":"Proposal Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"8d0b110d","name":"Scope Agreement","type":"DataObject","layer":"application","documentation":""},{"id":"536e1f4c","name":"Requirement Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"3b6e16bd","name":"Requirement","type":"DataObject","layer":"application","documentation":""},{"id":"b628317f","name":"Project Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"a1a68f70","name":"IT Initiative","type":"DataObject","layer":"application","documentation":""},{"id":"094764ca","name":"Service Design Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"f0ade417","name":"Logical Service Blueprint","type":"DataObject","layer":"application","documentation":""},{"id":"3df53fec","name":"Conceptual Service Blueprint (copy)","type":"DataObject","layer":"application","documentation":""},{"id":"db2a76f8","name":"Source Control Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"04325b5e","name":"Source","type":"DataObject","layer":"application","documentation":""},{"id":"fecea935","name":"Defect Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"584b481e","name":"Defect","type":"DataObject","layer":"application","documentation":""},{"id":"29cbfa7d","name":"Test Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"f0a1ff47","name":"Test Case","type":"DataObject","layer":"application","documentation":""},{"id":"e47a834f","name":"Build Package Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"36ba6435","name":"Build Package","type":"DataObject","layer":"application","documentation":""},{"id":"8486c686","name":"Release Composition Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"7a5d912f","name":"Service Release","type":"DataObject","layer":"application","documentation":""},{"id":"00ad60f6","name":"Service Release Blueprint","type":"DataObject","layer":"application","documentation":""},{"id":"6bee1d97","name":"Build Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"b48ff17c","name":"Build","type":"DataObject","layer":"application","documentation":""},{"id":"805af5a7","name":"Catalog Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"50e7b1b3","name":"Service Catalog Entry","type":"DataObject","layer":"application","documentation":""},{"id":"268a8d02","name":"Conceptual Service (copy) (copy)","type":"DataObject","layer":"application","documentation":""},{"id":"66692bd5","name":"Conceptual Service Blueprint (copy) (copy)","type":"DataObject","layer":"application","documentation":""},{"id":"abecccdc","name":"Offer Management Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"9dc6687a","name":"Offer","type":"DataObject","layer":"application","documentation":""},{"id":"c22960df","name":"Offer Consumption Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"6ea49a80","name":"Shopping Cart","type":"DataObject","layer":"application","documentation":""},{"id":"841a3f9a","name":"Fulfillment Execution Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"6f3744ec","name":"Conceptual Service (copy) (copy)","type":"DataObject","layer":"application","documentation":""},{"id":"4cc09c58","name":"Demand Service Model","type":"DataObject","layer":"application","documentation":""},{"id":"cf7f98aa","name":"Proposal Component (copy) (copy)","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"d8b2e420","name":"Request","type":"DataObject","layer":"application","documentation":""},{"id":"1673d18b","name":"Usage Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"66060a84","name":"Usage Record","type":"DataObject","layer":"application","documentation":""},{"id":"0ae1946f","name":"Conceptual Service (copy) (copy) (copy)","type":"DataObject","layer":"application","documentation":""},{"id":"a1b84356","name":"Conceptual Service Blueprint (copy) (copy) (copy)","type":"DataObject","layer":"application","documentation":""},{"id":"2415d3e9","name":"Chargeback/Showback Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"866ccd80","name":"Chargeback Contract","type":"DataObject","layer":"application","documentation":""},{"id":"76f3865c","name":"Problem Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"ce789cdc","name":"Problem / Known Error","type":"DataObject","layer":"application","documentation":""},{"id":"d059a127","name":"Diagnostics & Remediation Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"85cf0376","name":"Run Book","type":"DataObject","layer":"application","documentation":""},{"id":"dc8d2819","name":"Change Control Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"0a6a0b90","name":"Conceptual Service (copy) (copy)","type":"DataObject","layer":"application","documentation":""},{"id":"d3821e5e","name":"Conceptual Service Blueprint (copy) (copy)","type":"DataObject","layer":"application","documentation":""},{"id":"ad22e314","name":"Service Level Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"336d6aeb","name":"Service Contract","type":"DataObject","layer":"application","documentation":""},{"id":"8346990c","name":"Enterprise Architecture Component (copy) (copy)","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"3c9b4b57","name":"Service Architecture (copy) (copy)","type":"DataObject","layer":"application","documentation":""},{"id":"8ee07bd0","name":"Incident Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"713fd26d","name":"Incident","type":"DataObject","layer":"application","documentation":""},{"id":"e65b3302","name":"Service Monitoring Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"1eb426ff","name":"Service Monitor","type":"DataObject","layer":"application","documentation":""},{"id":"296fe9d8","name":"Configuration Management Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"f4ef71df","name":"Actual Service CIs","type":"DataObject","layer":"application","documentation":""},{"id":"6dc280a9","name":"Conceptual Service Blueprint (copy) (copy)","type":"DataObject","layer":"application","documentation":""},{"id":"036937f2","name":"Event Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"6620abeb","name":"Event","type":"DataObject","layer":"application","documentation":""},{"id":"afec3d5b","name":"Fulfillment Request","type":"DataObject","layer":"application","documentation":""},{"id":"ff08f776","name":"RFC","type":"DataObject","layer":"application","documentation":""},{"id":"13c942ac","name":"Subscription","type":"DataObject","layer":"application","documentation":""},{"id":"94b3d383","name":"User","type":"DataObject","layer":"application","documentation":""},{"id":"f3f6afdc","name":"Group","type":"DataObject","layer":"application","documentation":""},{"id":"e3ffda44","name":"User (copy)","type":"DataObject","layer":"application","documentation":""},{"id":"18a3770b","name":"Roles module","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"94980924","name":"Roles","type":"DataObject","layer":"application","documentation":""},{"id":"16225a24","name":"Users View","type":"ApplicationInterface","layer":"application","documentation":""},{"id":"fa3a957c","name":"Groups View","type":"ApplicationInterface","layer":"application","documentation":""},{"id":"d8347408","name":"Departments Controler","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"69e7077c","name":"Department","type":"DataObject","layer":"application","documentation":""},{"id":"39e734f7","name":"Departments View","type":"ApplicationInterface","layer":"application","documentation":""},{"id":"844f859d","name":"Wallet view","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"13c433b9","name":"SMAG SN App","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"0565c1b3","name":"Wallet","type":"DataObject","layer":"application","documentation":""},{"id":"1faa96f6","name":"View Wallet Balance","type":"ApplicationInterface","layer":"application","documentation":""},{"id":"3a4c19d5","name":"Fund Wallet Balance","type":"ApplicationService","layer":"application","documentation":""},{"id":"1a956123","name":"Fund User Wallet","type":"ApplicationInteraction","layer":"application","documentation":""},{"id":"112e6f81","name":"Mange User Wallet","type":"ApplicationFunction","layer":"application","documentation":""},{"id":"7c0f0879","name":"Pay Deposit for request","type":"ApplicationFunction","layer":"application","documentation":""},{"id":"6a32a270","name":"Pay for Request","type":"ApplicationFunction","layer":"application","documentation":""},{"id":"5fd67cef","name":"Calculate Depoist","type":"ApplicationService","layer":"application","documentation":""},{"id":"20223a7d","name":"Pay Invoice","type":"ApplicationService","layer":"application","documentation":""},{"id":"02b8e817","name":"Pay Deposit","type":"ApplicationService","layer":"application","documentation":""},{"id":"3a15c1ff","name":"Calculate Invoice","type":"ApplicationService","layer":"application","documentation":""},{"id":"16591c95","name":"IT Finance ","type":"ApplicationComponent","layer":"application","documentation":"http://wiki.servicenow.com/index.php?title=IT_Finance#gsc.tab=0\nServiceNow Financial Management applications"},{"id":"69e3c2aa","name":"General ledger","type":"ApplicationComponent","layer":"application","documentation":"List of IT organization's expenses\n"},{"id":"7b4ed766","name":"Fiscal period","type":"ApplicationComponent","layer":"application","documentation":"Timeframe during which expenses were incurred. You can work with only one fiscal period at a time."},{"id":"063ebff5","name":"Cost model","type":"ApplicationComponent","layer":"application","documentation":"Rules, methods, and metrics that tell the application how to allocate expenses to the accounts in the IT chart of accounts.\nThe allocation engine: the core of the application that uses your cost model to calculate expenses and determine how to allocate expenses.\nFinancial reports and dashboards: graphical representations of the expense allocations that show you where your expenses are coming from.\nWith the workbench, you can manage your general ledger, choose the fiscal period, build your cost model, and run the allocation engin"},{"id":"e5af84de","name":"Allocation engine","type":"ApplicationComponent","layer":"application","documentation":"Core of the application that uses your cost model to calculate expenses and determine how to allocate expenses.\nFinancial reports and dashboards: graphical representations of the expense allocations that show you where your expenses are coming from.\nWith the workbench, you can manage your general ledger, choose the fiscal period, build your cost model, and run the allocation engin"},{"id":"67f9c412","name":"Workbench","type":"ApplicationComponent","layer":"application","documentation":"With the workbench, you can manage your general ledger, choose the fiscal period, build your cost model, and run the allocation engin"},{"id":"4cf9f901","name":"Financial reports and dashboards","type":"ApplicationComponent","layer":"application","documentation":"Graphical representations of the expense allocations that show you where your expenses are coming from.\n"},{"id":"cf2caad0","name":"SNITFM_Allocation Groups","type":"ApplicationComponent","layer":"application","documentation":"Access the groups you can use to classify allocations."},{"id":"cce766e3","name":"SNITFM_Segment Hierarchy","type":"ApplicationComponent","layer":"application","documentation":"Access the records that control the hierarchy of segments in the IT chart of accounts."},{"id":"b6488368","name":"SNITFM_CIO Dashboard","type":"ApplicationComponent","layer":"application","documentation":"View a report that gives CIOs a quick summary of finances operations, and projects."},{"id":"3a7d15a3","name":"SNITFM_Financial Overview","type":"ApplicationComponent","layer":"application","documentation":"View reports that show costs per fiscal period for each segment in the IT chart of accounts."},{"id":"e168ff94","name":"SNITFM_General Ledger","type":"ApplicationComponent","layer":"application","documentation":"General Ledger"},{"id":"9c383c2e","name":"SNITFM_Dashboards","type":"ApplicationComponent","layer":"application","documentation":"Dashboards"},{"id":"424175f5","name":"SNITFM_Account Overview","type":"ApplicationComponent","layer":"application","documentation":"View reports that show allocations for the accounts in all segments."},{"id":"09551af0","name":"SNITFM_Allocation Methods","type":"ApplicationComponent","layer":"application","documentation":"Access the methods that cost allocation rules use to allocate expenses."},{"id":"4ce031f2","name":"SNITFM_Create Weighted Metric","type":"ApplicationComponent","layer":"application","documentation":"Create a new weighted metric."},{"id":"b27f573e","name":"SNITFM_Allocation Rules","type":"ApplicationComponent","layer":"application","documentation":"Access all cost allocation rules used to allocate expenses."},{"id":"15e4788f","name":"SNITFM_Staged Expenses","type":"ApplicationComponent","layer":"application","documentation":"Access the list of the expenses that you imported into the application."},{"id":"52dc7820","name":"SNITFM_Groomed Expenses","type":"ApplicationComponent","layer":"application","documentation":"Access the expenses that are already groomed, assigned to buckets, and ready for allocation."},{"id":"5e63ca6d","name":"SNITFM_Allocation Lines","type":"ApplicationComponent","layer":"application","documentation":"Access the expense lines that have been allocated from expenses in the general ledger."},{"id":"ade43f6d","name":"SNITFM_Business Service Overview","type":"ApplicationComponent","layer":"application","documentation":"View reports that show allocations for business services."},{"id":"cf6d7043","name":"SNITFM_Cost Model","type":"ApplicationComponent","layer":"application","documentation":"Cost Model"},{"id":"803d0eb7","name":"SNITFM_IT Chart of Accounts","type":"ApplicationComponent","layer":"application","documentation":"Access the definitions that specify the segments used by your cost allocation method."},{"id":"35447e38","name":"SNITFM_Dimensions","type":"ApplicationComponent","layer":"application","documentation":"Opens a list of dimension table definitions."},{"id":"a8dbf897","name":"SNITFM_Business Units","type":"ApplicationComponent","layer":"application","documentation":"Access the business units that are associated with companies. By default, the business unit is the first segment in the IT chart of accounts."},{"id":"710b2f6f","name":"SNITFM_Account Buckets","type":"ApplicationComponent","layer":"application","documentation":"Access the buckets that you can use in the workbench to group expenses."},{"id":"f0af6413","name":"SNITFM_Facts","type":"ApplicationComponent","layer":"application","documentation":"Opens a list of fact definitions."},{"id":"9dd6db62","name":"SNITFM_Last Run","type":"ApplicationComponent","layer":"application","documentation":"Opens the records showing the most recent time that the application created dimension tables."},{"id":"d6e0400c","name":"SNITFM_Business Unit Overview","type":"ApplicationComponent","layer":"application","documentation":"View reports that show allocations for business units."},{"id":"f173eacf","name":"SNITFM_IT Shared Services","type":"ApplicationComponent","layer":"application","documentation":"Access the services that are shared across your IT infrastructure."},{"id":"92114cc2","name":"SNITFM_Trending Dashboard","type":"ApplicationComponent","layer":"application","documentation":"View reports that shows allocation data for each segment over time."},{"id":"286cc505","name":"SNITFM_Grooming Conditions","type":"ApplicationComponent","layer":"application","documentation":"Access advanced query conditions that the workbench uses during the Bucketing stage."},{"id":"c87f1654","name":"SNITFM_Chart of Accounts","type":"ApplicationComponent","layer":"application","documentation":"Chart of Accounts"},{"id":"c2102767","name":"SNITFM_Overviews","type":"ApplicationComponent","layer":"application","documentation":"Overviews"},{"id":"a46b9359","name":"SNITFM_IT Data Mart","type":"ApplicationComponent","layer":"application","documentation":"IT Data Mart"},{"id":"1f515b0c","name":"SNITFM_Cleansed Expenses","type":"ApplicationComponent","layer":"application","documentation":"Access the expenses that you already cleansed in the workbench."},{"id":"12fea0c9","name":"SNITFM_Allocation Metrics","type":"ApplicationComponent","layer":"application","documentation":"Access the metrics that rules and methods use to allocate expenses."},{"id":"c636be02","name":"SNITFM_Filter Conditions","type":"ApplicationComponent","layer":"application","documentation":"Access records that allocations rules use to filter the expenses that can match allocation rules."},{"id":"b7876f5a","name":"SNITFM_Financial Dashboard","type":"ApplicationComponent","layer":"application","documentation":"View the main financial management dashboard that shows allocations for selected segments."},{"id":"19d5477f","name":"SNITFM_Workbench","type":"ApplicationComponent","layer":"application","documentation":"Open the workbench, which is a user-friendly interface that you can use to manage expense data in the general ledger, set up the cost model, and perform allocations."},{"id":"4912b0bb","name":"SNITFM_Getting Started","type":"ApplicationComponent","layer":"application","documentation":"Access the documentation to help you get started with the application."},{"id":"f88e04bc","name":"SNITFM_Cost","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"7a8a1218","name":"SNITFM_Budget Segment Map [itfm_budget_segment_map]","type":"DataObject","layer":"application","documentation":"A relationship between segments that budgets use and a budget key."},{"id":"9d550ef9","name":"SNITFM_Cost Allocation Aggregate [itfm_allocation_aggregate]","type":"DataObject","layer":"application","documentation":"A more brief set of allocation line data than is saved in the Cost Allocation [itfm_allocation] table."},{"id":"968c8f2a","name":"SNITFM_Bucket [itfm_bucket]","type":"DataObject","layer":"application","documentation":"Buckets used in the allocation workbench to group similar expenses."},{"id":"ab8a2401","name":"SNITFM_Budget Asset Depreciation [itfm_bi_asset]","type":"DataObject","layer":"application","documentation":"Budget items of type Asset Depreciation."},{"id":"d46547d7","name":"SNITFM_Budget Forecast [itfm_budget_forecast]","type":"DataObject","layer":"application","documentation":"All budget forecasts."},{"id":"765b434b","name":"SNITFM_ITFM Session [itfm_session]","type":"DataObject","layer":"application","documentation":"Saves session information for the workbench."},{"id":"cc7f4f71","name":"SNITFM_Budget Hardware [itfm_bi_hardware]","type":"DataObject","layer":"application","documentation":"Budget items of type Hardware."},{"id":"036e3783","name":"SNITFM_Cost Allocation Rollup [itfm_rollup]","type":"DataObject","layer":"application","documentation":"Rollups that the application creates when you use the workbench."},{"id":"6b2d30ee","name":"SNITFM_Cleansing Condition [itfm_cleansing_condition]","type":"DataObject","layer":"application","documentation":"Conditions that the application automatically generates when you clean data in the workbench."},{"id":"15e1af1c","name":"SNITFM_Segment Relationship [itfm_itcoa_hierarchy]","type":"DataObject","layer":"application","documentation":"Relationships between segments in the segment hierarchy as defined in the Data Definition stage of the workbench. Also captures the segment hierarchy for budget models."},{"id":"743c0507","name":"SNITFM_FM Report [itfm_report]","type":"DataObject","layer":"application","documentation":"Finance reports."},{"id":"75809356","name":"SNITFM_Segment Definition [itfmCasegment_map]","type":"DataObject","layer":"application","documentation":""},{"id":"790b653c","name":"SNITFM_Budget Owner [itfm_budget_owner]","type":"DataObject","layer":"application","documentation":"Owners of budgets."},{"id":"8676a43a","name":"SNITFM_Financial Data Source [itfm_data_source]","type":"DataObject","layer":"application","documentation":"The source of the financial data: the staged general ledger or the cost plan breakdown."},{"id":"ff0b92fc","name":"SNITFM_General Ledger Log [itfm_gl_log]","type":"DataObject","layer":"application","documentation":"Log records that are created when expenses are added to the general ledger for a fiscal period."},{"id":"aea03ca7","name":"SNITFM_Budget Item Breakdown [itfm_bi_breakdown]","type":"DataObject","layer":"application","documentation":"Breakdowns of budget costs for a given budget item."},{"id":"d465181d","name":"SNITFM_Cost Allocation [itfm_allocation]","type":"DataObject","layer":"application","documentation":"All allocation lines that are processed from allocations. This table holds a more detailed level of allocation lines as compared to the Cost Allocation Aggregate table."},{"id":"cf500950","name":"SNITFM_Budget Forecast Items [itfm_bf_item]","type":"DataObject","layer":"application","documentation":"All items on the budget forecast."},{"id":"90aab051","name":"SNITFM_Budget Item [itfm_budget_item]","type":"DataObject","layer":"application","documentation":"All budget items."},{"id":"e8ddcb09","name":"SNITFM_Budget Contract [itfm_bi_contract]","type":"DataObject","layer":"application","documentation":"Budget items of type Contract."},{"id":"f0c65aca","name":"SNITFM_Bucket Allocation Rule [itfm_bucket_allocation_rule]","type":"DataObject","layer":"application","documentation":"Allocates expenses to buckets."},{"id":"e6254461","name":"SNITFM_Budget Plan [itfm_budget_plan]","type":"DataObject","layer":"application","documentation":"Budget plans specify expenses for assets, contracts, labor, and certain configuration items (CIs) for a fiscal period, particularly one in the future. Use budget plans as the basis to compare your actual versus planned expenses.\n\nBudget plans are associated with a budget key and a fiscal period. If you have financial data over several financial periods, make a separate plan for each period.\n\nThere are several types of items you can add to the budget plan. The costs of these items are broken down over the fiscal period that you specify for the plan. See Budget items and Budget item breakdowns for more information.\n\nBudget plan expense amount types\n\nBudget plans show these types of expense amounts:\n\nTarget amounts: An amount that you set as a goal to reach or a limit not to exceed. A target amount is created for a specific fiscal period and account code combination. When you select the account code and fiscal period for the budget plan, the target amount is automatically populated in the read-only target fields. There are targets for both operating and capital expenses.\nBudgeted amounts: A rollup of all the budget plan items, which appear as related lists on the Budget Plan form. Only items marked as capital expenses do not roll up to the amount fields. There are budgeted amounts for both operating and capital expenses.\nBudget plan ownership\n\nBudget plans have a single owner, who must have the budget_owner role. Whoever you chose as the budget owner must also be associated with the budget plan's budget key as an owner.\n\nBudget plan parent-child relationships\n\nBudget plans can have one or more sub-plans, which roll up their actual budget amounts to the parent budget plan. You cannot promote child plans individually. Only the top-level plan in a hierarchy can be promoted.\n\nThe same account codes can be used for parent and any or all child plans, if necessary. Child plans can also have account codes that are lower in the hierarchy. For example, if the parent's account code is IT finance, the child plan's account code could be IT finance > Auditing Service, or similar. If you have multiple sub-plans with the same account codes, the amounts roll up from all subplans to the forecast.\n\nChanging the fiscal period parent plan cascades the change down to all sub-plans. See Budget owners and budget key owners for more information.\n\nBudget plan promotion\n\nYou can promote a budget plan to a budget forecast, based on the plan's account code and fiscal period. The forecast helps you predict the expenses your organization will incur. See Budget forecasts for more information.\n\nCreate a budget plan\nAfter you have configured your budget target and account codes, create a budget plan.\n\nCopy a budget plan\nYou can use any plan as a basis for creating a new plan.\n\nBudget items\nThe items that comprise a budget plan come from several other applications in an instance, including Asset Management, Project Management, and Configuration Management. This enables you to budget your expenses for items across your IT infrastructure."},{"id":"e5f41868","name":"SNITFM_Budget Labor [itfm_bi_labor]","type":"DataObject","layer":"application","documentation":"Budget labor records for budget plans."},{"id":"b27a323d","name":"SNITFM_Financial Model [itfm_cost_model]","type":"DataObject","layer":"application","documentation":"Financial cost models and budget models."},{"id":"943a1691","name":"SNITFM_Grooming Condition [itfm_grooming_condition]","type":"DataObject","layer":"application","documentation":"Conditions that the application creates during the financial grooming process in the workbench."},{"id":"4a707cf3","name":"SNITFM_Budget Reference Rates [itfm_fx_rate]","type":"DataObject","layer":"application","documentation":"The exchange rates that budgets use."},{"id":"d744c29a","name":"SNITFM_IT Shared Service Type [itfm_shared_service_type]","type":"DataObject","layer":"application","documentation":"Categories that are associated with IT shared services."},{"id":"a1ab7b16","name":"SNITFM_Budget Reference Rate Configuration [itfm_fx_config]","type":"DataObject","layer":"application","documentation":"Exchange rate / fiscal period relationships."},{"id":"d6ba3c2c","name":"SNITFM_General Ledger Accounts","type":"DataObject","layer":"application","documentation":"Accounts and associated account numbers."},{"id":"fbb90919","name":"SNITFM_Weight Maps [itfm_weight_map]","type":"DataObject","layer":"application","documentation":"Weight relationships that the application uses to calculate weighted metrics."},{"id":"48f31534","name":"SNITFM_IT Shared Service [itfm_shared_service]","type":"DataObject","layer":"application","documentation":"Services shared across the IT infrastructure."},{"id":"2e21a201","name":"SNITFM_Budget Targets [itfm_budget_target]","type":"DataObject","layer":"application","documentation":"All budget target values."},{"id":"7f005f37","name":"SNITFM_General Ledger Cleansed Data [itfm_gl_data_cleansed]","type":"DataObject","layer":"application","documentation":"Expenses in the general ledger that is cleansed."},{"id":"ef565687","name":"SNITFM_Groomed General Ledger Data [itfm_gl_data_groomed]","type":"DataObject","layer":"application","documentation":"Expenses in the general ledger that have been groomed."},{"id":"1a3dbabb","name":"SNITFM_Budget Software [itfm_bi_software]","type":"DataObject","layer":"application","documentation":"Budget items of type Software."},{"id":"8626644c","name":"SNITFM_Cost Allocation Group [itfm_cost_allocation_group]","type":"DataObject","layer":"application","documentation":"Groups that can be associated with allocations."},{"id":"7057f83e","name":"SNITFM_Cost Allocation Rollup Override [itfm_rollup_override]","type":"DataObject","layer":"application","documentation":"Values that you can use to override allocation rollups."},{"id":"9416551c","name":"SNITFM_Budget [itfm_budget]","type":"DataObject","layer":"application","documentation":"Final budgets."},{"id":"675f9db6","name":"SNITFM_Cost Allocation Runs Log [itfm_ca_run_log]","type":"DataObject","layer":"application","documentation":"A log of all allocations that have been run."},{"id":"024d5afb","name":"SNITFM_Account Code Expense [itfm_gl_actuals]","type":"DataObject","layer":"application","documentation":"Aggregation of expenses grouped by Account Code."},{"id":"2292cb7b","name":"SNITFM_Budget External Labor [ itfm_bi_external_labor]","type":"DataObject","layer":"application","documentation":"Budget items of type External Labor."},{"id":"1c910289","name":"SNITFM_Cost Allocation Segment Map [itfm_ca_segment_map]","type":"DataObject","layer":"application","documentation":"Segments specified in the hierarchy of segments."},{"id":"bae0e513","name":"SNITFM_Budget Key [itfm_budget_key]","type":"DataObject","layer":"application","documentation":"The key used to identify budget forecasts and budget plans\nA budget key is a unique combination of values that the application uses to identify budget forecasts and budget plans.\n\n"},{"id":"b17ca3b6","name":"SNITFM_Budget Key Owner [itfm_budget_key_owner]","type":"DataObject","layer":"application","documentation":"Owners of budget keys."},{"id":"cdf64bc0","name":"SNITFM_General Ledger Staged Data [itfm_gl_data_staged]","type":"DataObject","layer":"application","documentation":"Imported expenses that have not been cleansed or groomed."},{"id":"67fa66ab","name":"SNITFM_Main Report Configuration [itfm_ca_main_config]","type":"DataObject","layer":"application","documentation":"Configuration settings for the main Financial Management report."},{"id":"be19291f","name":"SNITFM_Budget Notes [itfm_budget_note]","type":"DataObject","layer":"application","documentation":"Notes for budgets that you enter in the budget variance report."},{"id":"b99a9877","name":"SNITFM_Bucket Allocation Account [itfm_bucket_allocation_account]","type":"DataObject","layer":"application","documentation":"A reference link between buckets, accounts, and cost models."},{"id":"d8a06af3","name":"SNITFM_Budget Forecast Breakdown [itfm_bf_breakdown]","type":"DataObject","layer":"application","documentation":"Breakdowns of budget costs for a given budget item on the budget forecast."},{"id":"6fbfbb62","name":"SNITFM_Cost Allocation Metric [itfm_cost_allocation_metric]","type":"DataObject","layer":"application","documentation":"Metrics that weighted and custom allocation methods use."},{"id":"7b7cecf4","name":"SNITFM_Budget Override Categories [itfm_budget_override_categories]","type":"DataObject","layer":"application","documentation":"Categories that you use to classify budget overrides."},{"id":"49129dbd","name":"SNITFM_Business Unit [business_unit]","type":"DataObject","layer":"application","documentation":"All business units."},{"id":"6d575b01","name":"budget_owner role","type":"DataObject","layer":"application","documentation":""},{"id":"60fd02d9","name":"budget_owner role (copy)","type":"DataObject","layer":"application","documentation":""},{"id":"30d2d866","name":"Budget forecasts","type":"DataObject","layer":"application","documentation":""},{"id":"dda09d55","name":"Budget Key Expenses","type":"DataObject","layer":"application","documentation":""},{"id":"5ad70b7d","name":"Budget Model","type":"DataObject","layer":"application","documentation":"A budget model (Definition) is the foundation of your budget, it is necessary for each budget key. Create as many budget models as necessary to classify budgeted expenses based on the segments that you can specify through their relationships.\n\nBudget analysts and budget admins can see any budget model. Budget owners can see only the budget models associated with budget keys that the budget owner has access to.\n\nDefault budget models\n\nBy default, these budget models are installed with the application:\n\nDefault budget model: A default budget model that you can customize. If you upgrade to Helsinki, the budget definition you had in Geneva is converted to the default budget model.\nProject Financials Budget Model: used to integration with the Project Portfolio Suite (requires the Project Portfolio Suite with Financials (com.snc.financial_planning_pmo) plugin)."},{"id":"81191772","name":"Cost Management","type":"ApplicationComponent","layer":"application","documentation":"IT cost tracks configuration item costs. The costs can be allocated to business units and used in reports. Specifically, IT cost enables these features:\n\nUsing rate cards.\nDefining configuration item (CI) costs.\nTracking one-time costs for CIs.\nProcessing recurring CI costs to generate expense lines.\nDistributing bulk costs to multiple expense line sources.\nTracking costs related to tasks and projects.\nAggregating configuration item costs and charging the total cost to a business service or application\nAllocating expense lines to business units with flexible allocation rules.\nTracking planned and actual budget costs by cost center.\n"},{"id":"d9ff8808","name":"Create rate cards","type":"ApplicationService","layer":"application","documentation":"To properly track configuration item, contract, task, and labor costs."},{"id":"f2ee41c3","name":"Create expense allocation rules","type":"ApplicationService","layer":"application","documentation":""},{"id":"e4e1e875","name":"Create expense lines","type":"ApplicationService","layer":"application","documentation":"Create expense lines and expense allocation rules."},{"id":"f301269a","name":"Aggregate CI costs","type":"ApplicationService","layer":"application","documentation":"Aggregate configuration item costs and apply the total cost to a business service or application using relationship paths"},{"id":"6d436066","name":"Create distribution costs","type":"ApplicationService","layer":"application","documentation":" and distribution cost rules to divide costs between a group of records. "},{"id":"83945d30","name":"Rate Card Cost","type":"DataObject","layer":"application","documentation":"Rate Card Cost (fm_ci_rate_card_cost) table\n"},{"id":"8aebc9fb","name":"CI rate card costs","type":"ApplicationComponent","layer":"application","documentation":"CI rate card costs generate expense lines for configuration items on the associated rate card. Costs associated with rate cards are stored in the Rate Card Cost (fm_ci_rate_card_cost) table. Each cost is applied to every configuration item associated with the rate card when the costs are processed."},{"id":"4afcfeef","name":"Start date","type":"DataObject","layer":"application","documentation":"The date the cost should start being processed."},{"id":"4614a6ed","name":"Base cost","type":"DataObject","layer":"application","documentation":"The amount that must be paid before taxes."},{"id":"7a67bb3b","name":"Short description","type":"DataObject","layer":"application","documentation":"A brief description of the rate card cost. The description is used to identify the processed cost on an expense line record."},{"id":"3854cbf5","name":"End date","type":"DataObject","layer":"application","documentation":"The date the cost should stop being processed."},{"id":"300b77ef","name":"Active","type":"DataObject","layer":"application","documentation":"Check box that indicates whether to enable cost processing for this cost."},{"id":"2a764e64","name":"Sales tax","type":"DataObject","layer":"application","documentation":"Check box that indicates whether to apply sales tax to the cost. (This field is available in Calgary and later releases.)"},{"id":"c93fe4ad","name":"Tax cost","type":"DataObject","layer":"application","documentation":"Total cost of the tax."},{"id":"e2e3e577","name":"Number","type":"DataObject","layer":"application","documentation":"[Read-only] The rate card cost identification number. Automatically assigned."},{"id":"c0a8da45","name":"Last processed","type":"DataObject","layer":"application","documentation":"[Read-only] The date and time this cost was last processed."},{"id":"b43e7644","name":"Next process","type":"DataObject","layer":"application","documentation":"The next date on which new expenses will be processed based on the Process FM Costs scheduled job."},{"id":"56f4152b","name":"Total cost","type":"DataObject","layer":"application","documentation":"Total rate card cost, including taxes."},{"id":"b8b6f329","name":"Recurring","type":"DataObject","layer":"application","documentation":"Check box that indicates whether the cost is a repeating cost. Also sets generated expense lines to show as recurring. If this check box is cleared, no further expenses are generated automatically."},{"id":"7d767887","name":"Name","type":"DataObject","layer":"application","documentation":"The rate card cost name."},{"id":"52a96e48","name":"Description","type":"DataObject","layer":"application","documentation":"Detailed description of the rate card cost."},{"id":"dc67aa60","name":"","type":"DataObject","layer":"application","documentation":""},{"id":"1f3abccc","name":"Rate card","type":"DataObject","layer":"application","documentation":"The identification number of the rate card to which this rate card cost is associated."},{"id":"50efc343","name":"Interval","type":"DataObject","layer":"application","documentation":"The frequency at which the rate card cost recurs."},{"id":"e480cb58","name":"Tax rate","type":"DataObject","layer":"application","documentation":"The tax rate to apply to the cost."},{"id":"5522cdc7","name":"Order","type":"DataObject","layer":"application","documentation":"Used by task rate cards."},{"id":"79cd003f","name":"Process FM Costs","type":"ApplicationComponent","layer":"application","documentation":"Expense lines are automatically generated for costs incurred between the rate card Start date and End date by a scheduled job, Process FM Costs, which runs on the Contract [ast_contract] table once per day. Expense lines are only generated from contracts with the Active or Expired state, starting with the Dublin release. You may want to generate expense lines for expired contracts to track previous expenses."},{"id":"e8cdbe3d","name":"Contract","type":"DataObject","layer":"application","documentation":"Contract [ast_contract] table"},{"id":"2e900c89","name":"DistExpenseLine API","type":"ApplicationInterface","layer":"application","documentation":"Create expense line records using the DistExpenseLine API\ndistCost - GlideRecord for the distribution cost, allowing access to all fields.\ndistCostAmount - cost amount in the system currency.\n/* Available variables:\n *   distCost - GlideRecord for the distribution cost\n *   distCostAmount - cost amount in system currency\n * \n * To create an expense line record use the DistExpenseLine API\n *   var DistExpense = new DistExpenseLine(distCost);\n *   DistExpense.createExpense(expenseSourceGlideRecord, amount, description);\n *     createExpense returns true if expense was inserted;\n */\n \n/*\n * Sample Script to distribute a cost to departments based on number of\tactive users in each department\n */\n//get the total cost from the distCost\nvar deptUsers = new GlideRecord(\"sys_user\");\ndeptUsers.addActiveQuery();\ndeptUsers.addQuery(\"department\", \"!=\", \"\");\ndeptUsers.query();\nvar totalUsers = deptUsers.getRowCount();\n \n//get the count of users for each department\nvar deptUsers = new GlideAggregate(\"sys_user\");\ndeptUsers.addActiveQuery();\ndeptUsers.addQuery(\"department\", \"!=\", \"\");\ndeptUsers.groupBy(\"department\");\ndeptUsers.addAggregate(\"COUNT\");\ndeptUsers.query();\n \n//for each department calc amount and create expense line\nwhile(deptUsers.next()) {\n   var dept = deptUsers.department.getRefRecord();\n   var deptCount = deptUsers.getAggregate(\"COUNT\");\n   var deptAmount = distCostAmount / deptCount;\n \n   //create expense line\n   var DistExpense = new DistExpenseLine(distCost);\n   DistExpense.createExpense(dept, deptAmount, distCost.name + \"-\" +\n   distCost.distribution_rule.getDisplayValue());\n}"},{"id":"2ce7498b","name":"Task Rate Card","type":"DataObject","layer":"application","documentation":"In Cost Management, task rate cards and labor rate cards capture operating costs by generating expense lines representing the cost of performing a task.\n\nTask rate cards are templates used to define the type of task and the method of calculating the associated costs.\nLabor rate cards are templates used to define worker's labor rates when calculating task cost based on time worked.\n\nName\tString field summarizing the purpose of the rate card.\nTable\tWhich type of tasks the rate card applies to.\nOrder\tIf more than one task rate card apply to the same task, the one with the lowest order is used.\nActive\tCheck box which determines if the rate card will be actively used.\nSummary type\tHigh-level type of expense for easier summary reports. This value will be used to set the expense line summary type field.\nCondition\tFilter to run on the table selected to determine whether this rate card applies to a given task. This field uses the Condition Count Widget to preview what records would be returned by the conditions.\nTask rate\tRate of the task, with a currency drop-down. To add a new currency, use the Edit link.\nUse time worked\tBy default a flat rate per task is defined in the rate card. Selecting the check box will force the rule to calculate the task cost based on the related task time worked entries.\nDefault labor rate\tDefines the default hourly rate to apply to the time worked entries if the worker does not have a labor rate card. Displayed when Use time worked is selected.\n"},{"id":"b9aedb77","name":"Labor Rate Card","type":"DataObject","layer":"application","documentation":"In Cost Management, task rate cards and labor rate cards capture operating costs by generating expense lines representing the cost of performing a task.\n\nTask rate cards are templates used to define the type of task and the method of calculating the associated costs.\nLabor rate cards are templates used to define worker's labor rates when calculating task cost based on time worked.\n\nField\tInput Value\nName\tString field summarizing the purpose of the rate card.\nRate code\tFor reference use only, if you want to align rates with an external system.\nActive\tCheck box which determines if the rate card will be actively used.\nHourly rate\tIdentifies the hourly rate to be applied to task time worked entries if the worker meets the condition defined.\nCondition\tDefines a filter on the user table to determine whether the task time worked user applies to this rate card. This field uses the Condition Count Widget to preview what records would be returned by the conditions."},{"id":"19ea383c","name":"Process Task Rate Cards","type":"ApplicationFunction","layer":"application","documentation":"The business rule Process Task Rate Cards runs when tasks close and checks to see if any task rate cards apply. If they do, an expense line is created according to the rate card.\n\nThe process flow of the \"Process Task Rate Cards\" business rule is:\n\nTask closes.\nBusiness rule runs.\nQuery active task rate cards in order looking for a matching condition.\nQualifying rate card not using time worked.\nGenerate expense line linked to the task using the task rate value.\nQualifying rate card using time worked.\nGet task time worked entries for the task grouped by user (worker).\nFor each user, check to see if they match conditions in any of the labor rate cards.\nLabor rate card found, generate expense line using the time worked and labor rate.\nLabor rate card not found, generate expense line using the default labor rate from the task rate card.\n"},{"id":"a72d19e9","name":"Expense Line","type":"DataObject","layer":"application","documentation":"Expense lines enable you to track costs and represent a point-in-time expense incurred. Expense lines can be created manually or generated by the scheduled processing of recurring costs. ServiceNow generates expense lines automatically when you create an asset, and updates expense lines automatically when you revise the Cost or Quantity field on an asset record."},{"id":"f9de913a","name":"Allocation Units","type":"DataObject","layer":"application","documentation":"Allocation unit records define the capacity and usage of a business service.\n\nField\tDescription\nConfiguration Item\tSelect the Business Service to define allocation units for.\nTotal Units\tThe total number of units of expense available to allocate. A unit is a generic measurement which can represent anything. Should match the cost center relationship unit. What units represent can be recorded in the Unit Type field. Note that using the Total units option may result in unallocated expenses if there are unallocated business service units. Using the Allocated unit option always results in 100% expense allocations.\nAllocated Units\tHow many of the total units are allocated. Populated by script.\nAvailable Units\tHow many of the total units are unallocated. Populated by script.\nUpdated\tWhen the units were last updated.\nFields which can be added by configuring the form:\nUnit Type\tUsed to record what the units represent (e.g. seats, licenses, Gigabytes, etc.)."},{"id":"242b20e8","name":"Cost centers","type":"DataObject","layer":"application","documentation":"Cost centers are a commonly used reference between financial systems and IT. Cost center records represent business entities, and have a related list of CI Cost Center Relationships that measure the cost center's consumption of business services.\n\nField\tDescription\nName\tA unique name for the cost center.\nAccount Number\tAn account number associated with the cost center, if one exists.\nCode\tA code associated with the cost center, if one exists.\nLocation\tA reference to the location of the cost center.\nManager\tA reference to the user who manages the cost center.\nValid from\tThe date that the cost center is valid from.\nValid to\tThe date that the cost center is valid to.\nRelated List: CI Cost Center Relationships\nService\tA reference to a Business Service.\nCost Center\tThe cost center to apply the relationship to. If reached through the related list, it should already be related to the appropriate cost center.\nAllocation Percentage\tFeature not yet implemented.\nAllocation Type\tA choice list. Should be Units.\nAllocation Units\tThe number of units that the cost center is using. This is measured using the same type of unit used to define the total capacity of the business service in the allocation unit record. This number will be used to update the number of allocated units in the allocation unit record. It will also be used to determine the amount of expenses to allocate to the cost center based on the percentage of business service used versus the total capacity.\n"},{"id":"22718c7f","name":"Default Allocation Rule","type":"DataObject","layer":"application","documentation":"For every expense line generated for a business service, the default allocation rule Process Svc-CC Relationships will attempt to process the expense and create allocations for each cost center that is consuming the service.\n\nThe amount of the expense allocation is calculated by dividing the number of units the cost center is consuming by the total number of units for the business service. This calculation method is refereed to as \"all unit\" allocation as it uses the total unit capacity to determine the allocation percentage."},{"id":"0b948015","name":"GL Staged Data","type":"DataObject","layer":"application","documentation":"General Ledger Staged Data [itfm_gl_data_staged] table"},{"id":"e0e6d601","name":"Fiscal Period","type":"DataObject","layer":"application","documentation":"Field\tDescription\nName\tThe name of the fiscal period.\nStart date time\tThe date the fiscal period starts.\nEnd date time\tThe date the fiscal period ends.\nFiscal Type\t[Read-Only] The type of period, either Year or Quarter.\nOpen\tIf the fiscal period is active and can be used. Only open fiscal periods can be referred to by other records."},{"id":"632c8cda","name":"REST API","type":"ApplicationInterface","layer":"application","documentation":""},{"id":"32f489ed","name":"geth Node","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"987c9bf3","name":"Browser","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"f5f521b3","name":"ServiceNow Instance","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"2e3a27a1","name":"ECC Queue","type":"ApplicationComponent","layer":"application","documentation":"The External Communication Channel (ECC) Queue is simply a database table, just like any other database table in the system (see the example record below). However, unlike the other tables in the system, the ECC Queue is normally queried, updated, and inserted into by other systems. Each record in the ECC Queue is a message, either from the ServiceNow instance to some other system (an output message), or from some other system to the ServiceNow instance (an input message) The ECC Queue is the normal connection point (though not the only possible one) between a ServiceNow instance and other systems that integrate with it. It's also the point in the ServiceNow instance to which the MID Server, used in Discovery, Orchestration, and some integrations connect. The following record displays the payload of a Discovery probe."},{"id":"276c162e","name":"opened_at","type":"Artifact","layer":"technology","documentation":"DateTime\n"},{"id":"84b7368f","name":"opened_by","type":"Artifact","layer":"technology","documentation":"Address\n"},{"id":"b4ee3376","name":"state","type":"Artifact","layer":"technology","documentation":"Address\n"},{"id":"2debd40b","name":"current state","type":"Artifact","layer":"technology","documentation":""},{"id":"1ac4b359","name":"latest change","type":"Artifact","layer":"technology","documentation":""},{"id":"e9ec9136","name":"state changes","type":"Artifact","layer":"technology","documentation":"array of all state changes with timestamps\nmap[DateTime => States] stateChanges; ??"},{"id":"4091b4d5","name":"CPP Node","type":"Node","layer":"technology","documentation":""},{"id":"9fd71b99","name":"MID Server","type":"Device","layer":"technology","documentation":""},{"id":"7a4b0930","name":"Ethereum Node","type":"Node","layer":"technology","documentation":""},{"id":"24f7857e","name":"Privete Ethereum Network","type":"CommunicationNetwork","layer":"technology","documentation":""},{"id":"9aad06d8","name":"Internet","type":"CommunicationNetwork","layer":"technology","documentation":""},{"id":"e48222c4","name":" Ethereum Network","type":"CommunicationNetwork","layer":"technology","documentation":""},{"id":"acb4d757","name":"Virtualization Service","type":"TechnologyService","layer":"technology","documentation":""},{"id":"11595938","name":"Host","type":"Device","layer":"technology","documentation":""},{"id":"e8ad8644","name":"ChargebackContractID","type":"Artifact","layer":"technology","documentation":"ChargebackContractID: Unique identifier for the Service Contract."},{"id":"21c14d3a","name":"SubscriptionID","type":"Artifact","layer":"technology","documentation":"SubscriptionID: Link to the Subscription for which this Service Contract is instantiated (from Subscription).\n"},{"id":"f8dd0433","name":"Current Balance","type":"Artifact","layer":"technology","documentation":""},{"id":"f316b4fc","name":"Starting Balance","type":"Artifact","layer":"technology","documentation":""},{"id":"b442b05f","name":"Budgetted Amount","type":"Artifact","layer":"technology","documentation":""},{"id":"5d1a09e5","name":"TaskID","type":"Artifact","layer":"technology","documentation":"TaskID: Link to the Task for which this Service Contract is instantiated (from Task).\n"},{"id":"9a5ff4b7","name":"Incident instance","type":"Artifact","layer":"technology","documentation":""},{"id":"a8e23a78","name":"opened_at (copy)","type":"Artifact","layer":"technology","documentation":"DateTime\n"},{"id":"9c5262be","name":"opened_by (copy)","type":"Artifact","layer":"technology","documentation":"Address\n"},{"id":"fe1076d3","name":"state (copy)","type":"Artifact","layer":"technology","documentation":"Address\n"},{"id":"46b5ad00","name":"current state (copy)","type":"Artifact","layer":"technology","documentation":""},{"id":"1c0abc41","name":"latest change (copy)","type":"Artifact","layer":"technology","documentation":""},{"id":"8178cd9e","name":"state changes (copy)","type":"Artifact","layer":"technology","documentation":"array of all state changes with timestamps\nmap[DateTime => States] stateChanges; ??"},{"id":"78b8070c","name":"GUID","type":"Artifact","layer":"technology","documentation":"String\n"},{"id":"4ce70394","name":"State","type":"Artifact","layer":"technology","documentation":"stateEnum\n"},{"id":"731249e5","name":"current state (copy)","type":"Artifact","layer":"technology","documentation":""},{"id":"1fe558ea","name":"latest change (copy)","type":"Artifact","layer":"technology","documentation":""},{"id":"b8a77116","name":"state changes (copy)","type":"Artifact","layer":"technology","documentation":"array of all state changes with timestamps\nmap[DateTime => States] stateChanges; ??"},{"id":"6f2fec1c","name":"Name","type":"Artifact","layer":"technology","documentation":"String"},{"id":"0ddb5226","name":"opened_at","type":"Artifact","layer":"technology","documentation":"DateTime\n"},{"id":"39a4729e","name":"opened_by","type":"Artifact","layer":"technology","documentation":"Address\n"},{"id":"e96daa6c","name":"budget_owner role","type":"Artifact","layer":"technology","documentation":""},{"id":"7771759b","name":"Software","type":"Artifact","layer":"technology","documentation":"This includes software licenses and support contracts, usually with a set price for a fixed term."},{"id":"1dbec9a1","name":"Services","type":"Artifact","layer":"technology","documentation":"In this group are advisers, consultants, service providers, auditors and legal counsel. This item covers direct and indirect cost of services needed to support IT operations and initiatives.\n"},{"id":"0ed3291a","name":"Hardware","type":"Artifact","layer":"technology","documentation":"This encompasses equipment and other fixed assets, installation costs, maintenance contracts, warranties, etc. This is any expenditure that results in ownership of a physical asset or is associated with the continued use and maintenance of such an asset."},{"id":"d73f09c6","name":"Subscriptions","type":"Artifact","layer":"technology","documentation":"These could be associated with hardware, software, training, cloud computing and managed-service providers. Subscriptions can have a fixed or variable price and a fixed or variable term."},{"id":"fb50b836","name":"Capital","type":"Artifact","layer":"technology","documentation":"These expenditures need to be considered as part of the organization’s capital budget; usually, this means that the spending will need to be capitalized. These expenditures include purchases of hardware and large software licenses, significant repairs, parts replacements and major software upgrades. "},{"id":"a10a2f3b","name":"Operating","type":"Artifact","layer":"technology","documentation":"These expenditures are related to operations and usually include subscriptions, maintenance and support for hardware and software\n"},{"id":"33cca1b3","name":"Project","type":"Artifact","layer":"technology","documentation":"Usually, project expenditures are tied to a discrete effort. These may or may not need to be capitalized and may be required or discretionary. Project expenditures often are a flexible part of the IT budget; they usually can be accelerated or pushed back depending on cash flow or other events"},{"id":"bf525103","name":"LAN","type":"CommunicationNetwork","layer":"technology","documentation":""},{"id":"f9b3686e","name":"VLAN","type":"CommunicationNetwork","layer":"technology","documentation":""},{"id":"ccc9c2c5","name":"Network","type":"CommunicationNetwork","layer":"technology","documentation":""},{"id":"257b52a3","name":"VPN","type":"Path","layer":"technology","documentation":""},{"id":"0057a4cb","name":"ETH Servr","type":"Device","layer":"technology","documentation":""},{"id":"178c6360","name":"IPC","type":"Path","layer":"technology","documentation":""},{"id":"7b783468","name":"HTTPS","type":"Path","layer":"technology","documentation":""},{"id":"956bf01b","name":"Artifact","type":"Artifact","layer":"technology","documentation":""},{"id":"5deaab78","name":"SSH","type":"Path","layer":"technology","documentation":""},{"id":"96378f26","name":"TCP/IP","type":"Path","layer":"technology","documentation":""},{"id":"7be2d851","name":"And Junction","type":"AndJunction","layer":"other","documentation":""}],"relationships":[{"id":"8c587d4c","sourceId":"b4ee3376","targetId":"2debd40b","type":"CompositionRelationship","name":"","documentation":""},{"id":"c33538fa","sourceId":"b4ee3376","targetId":"1ac4b359","type":"CompositionRelationship","name":"","documentation":""},{"id":"a0044e82","sourceId":"b4ee3376","targetId":"e9ec9136","type":"CompositionRelationship","name":"","documentation":""},{"id":"7adce686","sourceId":"6db30003","targetId":"7e1dcbf0","type":"TriggeringRelationship","name":"","documentation":""},{"id":"6391cae7","sourceId":"7e1dcbf0","targetId":"bc02e1bf","type":"TriggeringRelationship","name":"","documentation":""},{"id":"45417fff","sourceId":"bc02e1bf","targetId":"0ecbcd32","type":"FlowRelationship","name":"Assign to group","documentation":""},{"id":"b0a2e30f","sourceId":"0ecbcd32","targetId":"5b059180","type":"FlowRelationship","name":"Group Acknowledge","documentation":""},{"id":"553d4827","sourceId":"60262786","targetId":"7e548be9","type":"FlowRelationship","name":"Assign to user","documentation":""},{"id":"5f182381","sourceId":"60262786","targetId":"531870e0","type":"FlowRelationship","name":"Work in progress","documentation":""},{"id":"7ea78134","sourceId":"531870e0","targetId":"71b44618","type":"FlowRelationship","name":"Wait","documentation":""},{"id":"07d65b51","sourceId":"531870e0","targetId":"c4f17f85","type":"FlowRelationship","name":"Resolve","documentation":""},{"id":"005746b7","sourceId":"c4f17f85","targetId":"1fb660b3","type":"FlowRelationship","name":"Close","documentation":""},{"id":"1b9007d8","sourceId":"c4f17f85","targetId":"ca629ab4","type":"FlowRelationship","name":"Cancel","documentation":""},{"id":"89bafdcf","sourceId":"531870e0","targetId":"ca629ab4","type":"FlowRelationship","name":"Cancel","documentation":""},{"id":"64616c09","sourceId":"71b44618","targetId":"ca629ab4","type":"FlowRelationship","name":"","documentation":""},{"id":"6e1e152e","sourceId":"60262786","targetId":"ca629ab4","type":"FlowRelationship","name":"Fulfiller Acknowledge","documentation":""},{"id":"656c79a5","sourceId":"5b059180","targetId":"ca629ab4","type":"FlowRelationship","name":"Cancel","documentation":""},{"id":"a545cbf7","sourceId":"0ecbcd32","targetId":"ca629ab4","type":"FlowRelationship","name":"","documentation":""},{"id":"ae11cabf","sourceId":"7e548be9","targetId":"ca629ab4","type":"FlowRelationship","name":"Cancel","documentation":""},{"id":"6021757e","sourceId":"bc02e1bf","targetId":"ca629ab4","type":"FlowRelationship","name":"Cancel","documentation":""},{"id":"fa1e9f80","sourceId":"d9b126b8","targetId":"408c9cc2","type":"SpecialisationRelationship","name":"","documentation":""},{"id":"4c5e30dd","sourceId":"75d26025","targetId":"7430b38a","type":"AssociationRelationship","name":"Contracted with","documentation":""},{"id":"f759b801","sourceId":"7430b38a","targetId":"d9b126b8","type":"AccessRelationship","name":"Party of","documentation":""},{"id":"bb478097","sourceId":"75d26025","targetId":"d9b126b8","type":"AccessRelationship","name":"Party of","documentation":""},{"id":"4560e151","sourceId":"d9f878bd","targetId":"9f8e9022","type":"FlowRelationship","name":"","documentation":""},{"id":"cf500ded","sourceId":"9f8e9022","targetId":"e9e88d47","type":"FlowRelationship","name":"","documentation":""},{"id":"5f2996b4","sourceId":"9f8e9022","targetId":"c6434aa4","type":"TriggeringRelationship","name":"","documentation":""},{"id":"0722fc62","sourceId":"9f8e9022","targetId":"25e71bf9","type":"TriggeringRelationship","name":"","documentation":""},{"id":"440e619e","sourceId":"7430b38a","targetId":"ae20d337","type":"TriggeringRelationship","name":"","documentation":""},{"id":"c0349cfd","sourceId":"ae20d337","targetId":"e99414cd","type":"TriggeringRelationship","name":"","documentation":""},{"id":"226ccb8a","sourceId":"d70dd147","targetId":"e99414cd","type":"UsedByRelationship","name":"","documentation":""},{"id":"753473fa","sourceId":"75d26025","targetId":"e09b940b","type":"AssignmentRelationship","name":"","documentation":""},{"id":"aaa83080","sourceId":"e09b940b","targetId":"bfeb7a68","type":"AccessRelationship","name":"","documentation":""},{"id":"affcfee6","sourceId":"e09b940b","targetId":"c4c07ae3","type":"AssociationRelationship","name":"","documentation":""},{"id":"99716a1e","sourceId":"8ab7086b","targetId":"bfeb7a68","type":"AssociationRelationship","name":"","documentation":""},{"id":"033e360a","sourceId":"e99414cd","targetId":"8ab7086b","type":"TriggeringRelationship","name":"","documentation":""},{"id":"86ef75e8","sourceId":"1dae7697","targetId":"d70dd147","type":"AssociationRelationship","name":"","documentation":""},{"id":"201c5607","sourceId":"8ebdc79a","targetId":"c4c07ae3","type":"AccessRelationship","name":"","documentation":""},{"id":"233ab560","sourceId":"8ebdc79a","targetId":"e75d2fbb","type":"TriggeringRelationship","name":"","documentation":""},{"id":"56526494","sourceId":"e75d2fbb","targetId":"ff0d153e","type":"TriggeringRelationship","name":"","documentation":""},{"id":"0d1df3ef","sourceId":"fbbacaec","targetId":"d9f878bd","type":"TriggeringRelationship","name":"","documentation":""},{"id":"a7f89ea2","sourceId":"c6434aa4","targetId":"9f8e9022","type":"FlowRelationship","name":"","documentation":""},{"id":"cbaa3395","sourceId":"1dae7697","targetId":"d9f878bd","type":"AssignmentRelationship","name":"","documentation":""},{"id":"0db546c0","sourceId":"ff0d153e","targetId":"fbbacaec","type":"TriggeringRelationship","name":"","documentation":""},{"id":"ac552a7a","sourceId":"8ab7086b","targetId":"8788c92a","type":"TriggeringRelationship","name":"","documentation":""},{"id":"77543277","sourceId":"caf068a1","targetId":"89239ca6","type":"FlowRelationship","name":"","documentation":""},{"id":"089f01b5","sourceId":"89239ca6","targetId":"8ae95a75","type":"FlowRelationship","name":"","documentation":""},{"id":"bb7e4dc3","sourceId":"9f8e9022","targetId":"89239ca6","type":"CompositionRelationship","name":"","documentation":""},{"id":"93aefd24","sourceId":"9f8e9022","targetId":"caf068a1","type":"CompositionRelationship","name":"","documentation":""},{"id":"37ee774d","sourceId":"9f8e9022","targetId":"8ae95a75","type":"CompositionRelationship","name":"","documentation":""},{"id":"fab9e463","sourceId":"9f8e9022","targetId":"e9e88d47","type":"CompositionRelationship","name":"","documentation":""},{"id":"c881ac95","sourceId":"124cd2f7","targetId":"824f83e3","type":"CompositionRelationship","name":"","documentation":""},{"id":"18c42693","sourceId":"124cd2f7","targetId":"824f83e3","type":"CompositionRelationship","name":"","documentation":""},{"id":"99157a9e","sourceId":"824f83e3","targetId":"124cd2f7","type":"CompositionRelationship","name":"","documentation":""},{"id":"02d83530","sourceId":"124cd2f7","targetId":"824f83e3","type":"AssociationRelationship","name":"","documentation":""},{"id":"546694df","sourceId":"824f83e3","targetId":"cefcbf8e","type":"SpecialisationRelationship","name":"","documentation":""},{"id":"f7a53a6a","sourceId":"78ec8045","targetId":"124cd2f7","type":"CompositionRelationship","name":"","documentation":""},{"id":"98672035","sourceId":"124cd2f7","targetId":"78ec8045","type":"CompositionRelationship","name":"","documentation":""},{"id":"086b994c","sourceId":"824f83e3","targetId":"d6ba30ec","type":"SpecialisationRelationship","name":"","documentation":""},{"id":"1aea5a30","sourceId":"824f83e3","targetId":"cefcbf8e","type":"CompositionRelationship","name":"","documentation":""},{"id":"4fb9e6b2","sourceId":"824f83e3","targetId":"cacbe3bd","type":"CompositionRelationship","name":"","documentation":""},{"id":"43888418","sourceId":"824f83e3","targetId":"d6ba30ec","type":"CompositionRelationship","name":"","documentation":""},{"id":"af956566","sourceId":"9aad06d8","targetId":"24f7857e","type":"CompositionRelationship","name":"","documentation":""},{"id":"33d91d38","sourceId":"b735f926","targetId":"8e91bfb7","type":"AssociationRelationship","name":"","documentation":""},{"id":"4199315e","sourceId":"21c14d3a","targetId":"b735f926","type":"AccessRelationship","name":"","documentation":""},{"id":"fce5ac31","sourceId":"f4d2edfb","targetId":"fb5c1198","type":"CompositionRelationship","name":"","documentation":""},{"id":"0a38cd97","sourceId":"f4d2edfb","targetId":"2e9b00db","type":"CompositionRelationship","name":"","documentation":""},{"id":"4cd00e18","sourceId":"94d77be2","targetId":"01cf09cd","type":"CompositionRelationship","name":"","documentation":""},{"id":"a6ac04f4","sourceId":"94d77be2","targetId":"62831510","type":"CompositionRelationship","name":"","documentation":""},{"id":"efc88e2b","sourceId":"ec94f979","targetId":"738b4602","type":"CompositionRelationship","name":"","documentation":""},{"id":"055abf4f","sourceId":"ec94f979","targetId":"9e25ae3e","type":"CompositionRelationship","name":"","documentation":""},{"id":"f76a011f","sourceId":"ec94f979","targetId":"6dd1482b","type":"CompositionRelationship","name":"","documentation":""},{"id":"4097aa4f","sourceId":"5d1a09e5","targetId":"09c78617","type":"AccessRelationship","name":"","documentation":""},{"id":"758ca057","sourceId":"8e91bfb7","targetId":"09c78617","type":"AssociationRelationship","name":"","documentation":""},{"id":"6134889d","sourceId":"c6434aa4","targetId":"25e71bf9","type":"TriggeringRelationship","name":"","documentation":""},{"id":"6877c8be","sourceId":"826eb4ba","targetId":"d9f878bd","type":"FlowRelationship","name":"","documentation":""},{"id":"066d2f46","sourceId":"9f8e9022","targetId":"c6434aa4","type":"FlowRelationship","name":"","documentation":""},{"id":"5b7e3bb8","sourceId":"cff50ff1","targetId":"ec94f979","type":"AssignmentRelationship","name":"","documentation":""},{"id":"ea0b9284","sourceId":"cff50ff1","targetId":"94d77be2","type":"AssignmentRelationship","name":"","documentation":""},{"id":"a2367fc5","sourceId":"b2d9e5d5","targetId":"b735f926","type":"CompositionRelationship","name":"","documentation":""},{"id":"62e2097b","sourceId":"b2d9e5d5","targetId":"09c78617","type":"CompositionRelationship","name":"","documentation":""},{"id":"c73fddba","sourceId":"738b4602","targetId":"6dd1482b","type":"CompositionRelationship","name":"","documentation":""},{"id":"bf4f8dba","sourceId":"738b4602","targetId":"9e25ae3e","type":"CompositionRelationship","name":"","documentation":""},{"id":"0cb5cb16","sourceId":"ae8414d6","targetId":"07ae79b9","type":"AssignmentRelationship","name":"","documentation":""},{"id":"cae30264","sourceId":"ae8414d6","targetId":"f11ff7da","type":"AssignmentRelationship","name":"","documentation":""},{"id":"acd3407b","sourceId":"cff50ff1","targetId":"35d517ed","type":"CompositionRelationship","name":"","documentation":""},{"id":"b5303522","sourceId":"cff50ff1","targetId":"31f8173d","type":"CompositionRelationship","name":"","documentation":""},{"id":"8dbec357","sourceId":"cff50ff1","targetId":"5c4130f0","type":"CompositionRelationship","name":"","documentation":""},{"id":"3f068849","sourceId":"35d517ed","targetId":"f4d2edfb","type":"AssignmentRelationship","name":"","documentation":""},{"id":"62ed0adc","sourceId":"35d517ed","targetId":"fb5c1198","type":"AssignmentRelationship","name":"","documentation":""},{"id":"223f9c01","sourceId":"35d517ed","targetId":"5ddd05ce","type":"AssignmentRelationship","name":"","documentation":""},{"id":"644fc9e0","sourceId":"35d517ed","targetId":"2e9b00db","type":"AssignmentRelationship","name":"","documentation":""},{"id":"f97185e4","sourceId":"31f8173d","targetId":"01cf09cd","type":"AssignmentRelationship","name":"","documentation":""},{"id":"05a7bb25","sourceId":"31f8173d","targetId":"62831510","type":"AssignmentRelationship","name":"","documentation":""},{"id":"2c63c9f7","sourceId":"cefcbf8e","targetId":"78ec8045","type":"UsedByRelationship","name":"","documentation":""},{"id":"88195a53","sourceId":"d6ba30ec","targetId":"78ec8045","type":"UsedByRelationship","name":"","documentation":""},{"id":"9623b463","sourceId":"824f83e3","targetId":"cacbe3bd","type":"SpecialisationRelationship","name":"","documentation":""},{"id":"6dbd01b8","sourceId":"6457f10b","targetId":"cacbe3bd","type":"UsedByRelationship","name":"","documentation":""},{"id":"15113e8a","sourceId":"6db30003","targetId":"6457f10b","type":"TriggeringRelationship","name":"","documentation":""},{"id":"e8098401","sourceId":"019a1ec5","targetId":"00434e51","type":"AggregationRelationship","name":"","documentation":""},{"id":"a8b352c8","sourceId":"8ae95a75","targetId":"3f2ebf53","type":"CompositionRelationship","name":"","documentation":""},{"id":"c16ddae8","sourceId":"8ae95a75","targetId":"1879ba42","type":"CompositionRelationship","name":"","documentation":""},{"id":"9e6ebfd2","sourceId":"89239ca6","targetId":"64675337","type":"CompositionRelationship","name":"","documentation":""},{"id":"8ea7fa68","sourceId":"89239ca6","targetId":"caddabc9","type":"CompositionRelationship","name":"","documentation":""},{"id":"fde6c202","sourceId":"64675337","targetId":"7209ac7f","type":"CompositionRelationship","name":"","documentation":""},{"id":"c8b647f4","sourceId":"64675337","targetId":"b2675f32","type":"CompositionRelationship","name":"","documentation":""},{"id":"bdcd615c","sourceId":"8ae95a75","targetId":"b2675f32","type":"CompositionRelationship","name":"","documentation":""},{"id":"af591f4b","sourceId":"caf068a1","targetId":"f1d5788e","type":"CompositionRelationship","name":"","documentation":""},{"id":"4b74465f","sourceId":"caf068a1","targetId":"5aa5a6d6","type":"CompositionRelationship","name":"","documentation":""},{"id":"e07b2fd5","sourceId":"89239ca6","targetId":"2a8704f6","type":"CompositionRelationship","name":"","documentation":""},{"id":"cb72a792","sourceId":"caf068a1","targetId":"78435270","type":"CompositionRelationship","name":"","documentation":""},{"id":"71642c0b","sourceId":"caf068a1","targetId":"645a9cba","type":"CompositionRelationship","name":"","documentation":""},{"id":"c97d0b76","sourceId":"ffb42cb0","targetId":"89239ca6","type":"CompositionRelationship","name":"","documentation":""},{"id":"2b8364e8","sourceId":"ffb42cb0","targetId":"8ae95a75","type":"CompositionRelationship","name":"","documentation":""},{"id":"1cdd847a","sourceId":"ffb42cb0","targetId":"caf068a1","type":"CompositionRelationship","name":"","documentation":""},{"id":"ad0d62f6","sourceId":"ffb42cb0","targetId":"b8c6dd55","type":"CompositionRelationship","name":"","documentation":""},{"id":"dda2f844","sourceId":"ffb42cb0","targetId":"59228ca8","type":"CompositionRelationship","name":"","documentation":""},{"id":"9e3cb6dc","sourceId":"ffb42cb0","targetId":"518b9f2e","type":"CompositionRelationship","name":"","documentation":""},{"id":"0783dcbf","sourceId":"ffb42cb0","targetId":"56c32011","type":"CompositionRelationship","name":"","documentation":""},{"id":"6c1d1b12","sourceId":"ffb42cb0","targetId":"f0d308e6","type":"CompositionRelationship","name":"","documentation":""},{"id":"7c5f88e1","sourceId":"ffb42cb0","targetId":"e88711ae","type":"CompositionRelationship","name":"","documentation":""},{"id":"889cfe9b","sourceId":"ffb42cb0","targetId":"95d9a583","type":"CompositionRelationship","name":"","documentation":""},{"id":"b603430e","sourceId":"f469f143","targetId":"1e1c35c2","type":"FlowRelationship","name":"","documentation":""},{"id":"0d7e26d3","sourceId":"1e1c35c2","targetId":"a8167554","type":"FlowRelationship","name":"","documentation":""},{"id":"3877af28","sourceId":"a8167554","targetId":"7be2d851","type":"FlowRelationship","name":"","documentation":""},{"id":"69b0abe2","sourceId":"cdf00315","targetId":"92ac7abd","type":"FlowRelationship","name":"","documentation":""},{"id":"78698e52","sourceId":"92ac7abd","targetId":"8892ccd3","type":"FlowRelationship","name":"","documentation":""},{"id":"0580740c","sourceId":"8892ccd3","targetId":"7b56b4d5","type":"FlowRelationship","name":"","documentation":""},{"id":"648c6dbb","sourceId":"7b56b4d5","targetId":"4dd3f651","type":"FlowRelationship","name":"","documentation":""},{"id":"3fc94e6a","sourceId":"a8167554","targetId":"92ac7abd","type":"FlowRelationship","name":"","documentation":""},{"id":"b2b3fcda","sourceId":"8892ccd3","targetId":"765eb22d","type":"AssociationRelationship","name":"","documentation":""},{"id":"eb7058b1","sourceId":"4dd3f651","targetId":"be0c8a04","type":"FlowRelationship","name":"","documentation":""},{"id":"ac7346cb","sourceId":"be0c8a04","targetId":"a0305641","type":"FlowRelationship","name":"","documentation":""},{"id":"c1eb9ff5","sourceId":"74d2ddcd","targetId":"09b84769","type":"AssignmentRelationship","name":"","documentation":""},{"id":"dfe0ceaf","sourceId":"74d2ddcd","targetId":"df1e6561","type":"AssignmentRelationship","name":"","documentation":""},{"id":"02b766a1","sourceId":"74d2ddcd","targetId":"480c5c90","type":"AssignmentRelationship","name":"","documentation":""},{"id":"1a8bc193","sourceId":"09b84769","targetId":"69de26fb","type":"UsedByRelationship","name":"","documentation":""},{"id":"5390db2b","sourceId":"480c5c90","targetId":"69de26fb","type":"UsedByRelationship","name":"","documentation":""},{"id":"85ae7c77","sourceId":"09b84769","targetId":"df1e6561","type":"FlowRelationship","name":"","documentation":""},{"id":"9faaff8d","sourceId":"df1e6561","targetId":"480c5c90","type":"FlowRelationship","name":"","documentation":""},{"id":"beb174f0","sourceId":"74d2ddcd","targetId":"36749963","type":"AssignmentRelationship","name":"","documentation":""},{"id":"0846724c","sourceId":"69de26fb","targetId":"e2abe3c0","type":"AssignmentRelationship","name":"","documentation":""},{"id":"2e47dfd0","sourceId":"74d2ddcd","targetId":"5550a40d","type":"AssignmentRelationship","name":"","documentation":""},{"id":"c3d91ea8","sourceId":"74d2ddcd","targetId":"81c15228","type":"AssignmentRelationship","name":"","documentation":""},{"id":"cac00cd4","sourceId":"74d2ddcd","targetId":"b0ecd627","type":"AssignmentRelationship","name":"","documentation":""},{"id":"65ec7a98","sourceId":"480c5c90","targetId":"36749963","type":"FlowRelationship","name":"","documentation":""},{"id":"8634dcf6","sourceId":"36749963","targetId":"5550a40d","type":"FlowRelationship","name":"","documentation":""},{"id":"41f0f3d9","sourceId":"5550a40d","targetId":"e2abe3c0","type":"FlowRelationship","name":"","documentation":""},{"id":"d7bfe586","sourceId":"e2abe3c0","targetId":"81c15228","type":"FlowRelationship","name":"","documentation":""},{"id":"ebeb6cf9","sourceId":"81e07203","targetId":"935691a0","type":"AssignmentRelationship","name":"","documentation":""},{"id":"71204b52","sourceId":"81e07203","targetId":"92290fe3","type":"AssignmentRelationship","name":"","documentation":""},{"id":"319b9a54","sourceId":"81c15228","targetId":"935691a0","type":"FlowRelationship","name":"","documentation":""},{"id":"ccae0b84","sourceId":"935691a0","targetId":"92290fe3","type":"FlowRelationship","name":"","documentation":""},{"id":"02ad3f70","sourceId":"9c876846","targetId":"f155ce14","type":"AssignmentRelationship","name":"","documentation":""},{"id":"c4c08ce1","sourceId":"92290fe3","targetId":"f155ce14","type":"FlowRelationship","name":"","documentation":""},{"id":"4f2d699c","sourceId":"81c15228","targetId":"b0ecd627","type":"FlowRelationship","name":"","documentation":""},{"id":"97c17463","sourceId":"774b264f","targetId":"d5cebb36","type":"AssociationRelationship","name":"","documentation":""},{"id":"24d591ac","sourceId":"d7389082","targetId":"d5cebb36","type":"AssociationRelationship","name":"","documentation":""},{"id":"6a0542b8","sourceId":"8d0b110d","targetId":"b62c4a15","type":"AssociationRelationship","name":"","documentation":""},{"id":"56449968","sourceId":"b62c4a15","targetId":"d5cebb36","type":"AssociationRelationship","name":"","documentation":""},{"id":"ff0cd601","sourceId":"d7389082","targetId":"3b6e16bd","type":"AssociationRelationship","name":"","documentation":""},{"id":"89f8e91a","sourceId":"d5cebb36","targetId":"8ec6c4fe","type":"AssociationRelationship","name":"","documentation":""},{"id":"41da0d25","sourceId":"8ec6c4fe","targetId":"f0ade417","type":"AssociationRelationship","name":"","documentation":""},{"id":"c63921d5","sourceId":"f0ade417","targetId":"7a5d912f","type":"AssociationRelationship","name":"","documentation":""},{"id":"6f9a27ca","sourceId":"7a5d912f","targetId":"00ad60f6","type":"AssociationRelationship","name":"","documentation":""},{"id":"01264df8","sourceId":"b62c4a15","targetId":"a1a68f70","type":"AssociationRelationship","name":"","documentation":""},{"id":"9799acd4","sourceId":"3b6e16bd","targetId":"04325b5e","type":"AssociationRelationship","name":"","documentation":""},{"id":"6aa5bfd3","sourceId":"04325b5e","targetId":"b48ff17c","type":"AssociationRelationship","name":"","documentation":""},{"id":"57eba760","sourceId":"8d0b110d","targetId":"a1a68f70","type":"AssociationRelationship","name":"","documentation":""},{"id":"8ce502f9","sourceId":"b62c4a15","targetId":"3b6e16bd","type":"AssociationRelationship","name":"","documentation":""},{"id":"aece8b1a","sourceId":"3b6e16bd","targetId":"f0ade417","type":"AssociationRelationship","name":"","documentation":""},{"id":"92225041","sourceId":"a1a68f70","targetId":"7a5d912f","type":"AssociationRelationship","name":"","documentation":""},{"id":"e0ef2d26","sourceId":"3b6e16bd","targetId":"f0a1ff47","type":"AssociationRelationship","name":"","documentation":""},{"id":"0c429a26","sourceId":"3b6e16bd","targetId":"7a5d912f","type":"AssociationRelationship","name":"","documentation":""},{"id":"4c94cce4","sourceId":"f0a1ff47","targetId":"7a5d912f","type":"AssociationRelationship","name":"","documentation":""},{"id":"b309390f","sourceId":"f0a1ff47","targetId":"b48ff17c","type":"AssociationRelationship","name":"","documentation":""},{"id":"8724bb40","sourceId":"b48ff17c","targetId":"36ba6435","type":"AssociationRelationship","name":"","documentation":""},{"id":"2574bc52","sourceId":"36ba6435","targetId":"00ad60f6","type":"AssociationRelationship","name":"","documentation":""},{"id":"1a43f195","sourceId":"584b481e","targetId":"f0a1ff47","type":"AssociationRelationship","name":"","documentation":""},{"id":"63f8465d","sourceId":"584b481e","targetId":"00ad60f6","type":"AssociationRelationship","name":"","documentation":""},{"id":"688d7a60","sourceId":"6ea49a80","targetId":"9dc6687a","type":"AssociationRelationship","name":"","documentation":""},{"id":"a416bf07","sourceId":"6ea49a80","targetId":"d8b2e420","type":"AssociationRelationship","name":"","documentation":""},{"id":"73fae729","sourceId":"d8b2e420","targetId":"afec3d5b","type":"AssociationRelationship","name":"","documentation":""},{"id":"1e630fe2","sourceId":"13c942ac","targetId":"4cc09c58","type":"AssociationRelationship","name":"","documentation":""},{"id":"c79a2b0c","sourceId":"9dc6687a","targetId":"13c942ac","type":"AssociationRelationship","name":"","documentation":""},{"id":"23f8bd8d","sourceId":"d8b2e420","targetId":"13c942ac","type":"AssociationRelationship","name":"","documentation":""},{"id":"cfa54461","sourceId":"13c942ac","targetId":"866ccd80","type":"AssociationRelationship","name":"","documentation":""},{"id":"b0e11c2b","sourceId":"866ccd80","targetId":"66060a84","type":"AssociationRelationship","name":"","documentation":""},{"id":"580a72da","sourceId":"afec3d5b","targetId":"4cc09c58","type":"AssociationRelationship","name":"","documentation":""},{"id":"3f9490c9","sourceId":"afec3d5b","targetId":"ff08f776","type":"AssociationRelationship","name":"","documentation":""},{"id":"4d275a88","sourceId":"13c942ac","targetId":"336d6aeb","type":"AssociationRelationship","name":"","documentation":""},{"id":"db85c61e","sourceId":"ce789cdc","targetId":"713fd26d","type":"AssociationRelationship","name":"","documentation":""},{"id":"1026a348","sourceId":"713fd26d","targetId":"6620abeb","type":"AssociationRelationship","name":"","documentation":""},{"id":"d91384f0","sourceId":"6620abeb","targetId":"1eb426ff","type":"AssociationRelationship","name":"","documentation":""},{"id":"f04d5df6","sourceId":"1eb426ff","targetId":"f4ef71df","type":"AssociationRelationship","name":"","documentation":""},{"id":"92d54e97","sourceId":"713fd26d","targetId":"f4ef71df","type":"AssociationRelationship","name":"","documentation":""},{"id":"4f86fdc9","sourceId":"6620abeb","targetId":"f4ef71df","type":"AssociationRelationship","name":"","documentation":""},{"id":"7cbe868e","sourceId":"824f83e3","targetId":"18a3770b","type":"CompositionRelationship","name":"","documentation":""},{"id":"0d08ec45","sourceId":"824f83e3","targetId":"16225a24","type":"CompositionRelationship","name":"","documentation":""},{"id":"0720608a","sourceId":"824f83e3","targetId":"fa3a957c","type":"CompositionRelationship","name":"","documentation":""},{"id":"117fab66","sourceId":"824f83e3","targetId":"39e734f7","type":"CompositionRelationship","name":"","documentation":""},{"id":"3ac328cb","sourceId":"824f83e3","targetId":"d8347408","type":"CompositionRelationship","name":"","documentation":""},{"id":"d9a27d60","sourceId":"69e7077c","targetId":"f3f6afdc","type":"SpecialisationRelationship","name":"","documentation":""},{"id":"7d73fa9e","sourceId":"f3f6afdc","targetId":"94b3d383","type":"CompositionRelationship","name":"","documentation":""},{"id":"0b0c1075","sourceId":"d8347408","targetId":"69e7077c","type":"AccessRelationship","name":"","documentation":""},{"id":"95553d70","sourceId":"39e734f7","targetId":"d8347408","type":"UsedByRelationship","name":"","documentation":""},{"id":"2aa28327","sourceId":"d6ba30ec","targetId":"f3f6afdc","type":"AccessRelationship","name":"","documentation":""},{"id":"423f2d9d","sourceId":"fa3a957c","targetId":"d6ba30ec","type":"UsedByRelationship","name":"","documentation":""},{"id":"3cff5304","sourceId":"16225a24","targetId":"cefcbf8e","type":"UsedByRelationship","name":"","documentation":""},{"id":"c0c0ed77","sourceId":"cefcbf8e","targetId":"94b3d383","type":"AccessRelationship","name":"","documentation":""},{"id":"14cbd4cc","sourceId":"aff33767","targetId":"69e7077c","type":"AssociationRelationship","name":"Is","documentation":""},{"id":"55b55955","sourceId":"8c9c5e6a","targetId":"f3f6afdc","type":"AssociationRelationship","name":"","documentation":""},{"id":"9c68ccd3","sourceId":"aff33767","targetId":"8c9c5e6a","type":"CompositionRelationship","name":"","documentation":""},{"id":"e3a59231","sourceId":"94b3d383","targetId":"94980924","type":"AssociationRelationship","name":"","documentation":""},{"id":"66069dfc","sourceId":"aff33767","targetId":"f3f6afdc","type":"AssociationRelationship","name":"Contains","documentation":""},{"id":"7d0a2cbd","sourceId":"8c9c5e6a","targetId":"94b3d383","type":"AssociationRelationship","name":"Is","documentation":""},{"id":"cb0530d9","sourceId":"824f83e3","targetId":"844f859d","type":"CompositionRelationship","name":"","documentation":""},{"id":"3d7ea510","sourceId":"13c433b9","targetId":"1faa96f6","type":"CompositionRelationship","name":"","documentation":""},{"id":"aa0b3dd7","sourceId":"13c433b9","targetId":"3a4c19d5","type":"AssignmentRelationship","name":"","documentation":""},{"id":"d8ab2e1a","sourceId":"8c9c5e6a","targetId":"0565c1b3","type":"AssociationRelationship","name":"","documentation":""},{"id":"37d3ac8a","sourceId":"29d98cfa","targetId":"0565c1b3","type":"AssociationRelationship","name":"Uses","documentation":""},{"id":"ed242e44","sourceId":"7678e9cf","targetId":"94b3d383","type":"AssociationRelationship","name":"","documentation":""},{"id":"a120146e","sourceId":"8c9c5e6a","targetId":"7678e9cf","type":"SpecialisationRelationship","name":"Is","documentation":""},{"id":"fbcbd667","sourceId":"94b3d383","targetId":"0565c1b3","type":"AssociationRelationship","name":"","documentation":""},{"id":"057400c8","sourceId":"8c9c5e6a","targetId":"94980924","type":"AssociationRelationship","name":"","documentation":""},{"id":"75a74940","sourceId":"3a4c19d5","targetId":"0565c1b3","type":"AccessRelationship","name":"","documentation":""},{"id":"1691b261","sourceId":"3a4c19d5","targetId":"1faa96f6","type":"UsedByRelationship","name":"","documentation":""},{"id":"7352d206","sourceId":"1faa96f6","targetId":"29d98cfa","type":"UsedByRelationship","name":"","documentation":""},{"id":"62a42768","sourceId":"8f74c7b3","targetId":"f3f6afdc","type":"AssociationRelationship","name":"Manages","documentation":""},{"id":"64f115e5","sourceId":"aff33767","targetId":"8f74c7b3","type":"AssociationRelationship","name":"","documentation":""},{"id":"00f7525f","sourceId":"8f74c7b3","targetId":"8c9c5e6a","type":"SpecialisationRelationship","name":"Approves for","documentation":""},{"id":"6632bad7","sourceId":"aff33767","targetId":"8c9c5e6a","type":"AssociationRelationship","name":"","documentation":""},{"id":"97761919","sourceId":"8f74c7b3","targetId":"94b3d383","type":"AssociationRelationship","name":"Is","documentation":""},{"id":"2e453b27","sourceId":"8f74c7b3","targetId":"7678e9cf","type":"SpecialisationRelationship","name":"Is","documentation":""},{"id":"ae70a3b6","sourceId":"7678e9cf","targetId":"1a956123","type":"AssociationRelationship","name":"Funds","documentation":""},{"id":"28616633","sourceId":"13c433b9","targetId":"1a956123","type":"AssignmentRelationship","name":"","documentation":""},{"id":"80a9e5a9","sourceId":"7678e9cf","targetId":"1a956123","type":"TriggeringRelationship","name":"","documentation":""},{"id":"843b467c","sourceId":"1a956123","targetId":"0565c1b3","type":"AccessRelationship","name":"","documentation":""},{"id":"86ec8fe5","sourceId":"1a956123","targetId":"3a4c19d5","type":"UsedByRelationship","name":"","documentation":""},{"id":"bc912611","sourceId":"13c433b9","targetId":"112e6f81","type":"AssignmentRelationship","name":"","documentation":""},{"id":"2e24fcb0","sourceId":"112e6f81","targetId":"7678e9cf","type":"UsedByRelationship","name":"","documentation":""},{"id":"99dd7410","sourceId":"112e6f81","targetId":"3a4c19d5","type":"RealisationRelationship","name":"","documentation":""},{"id":"3e36b3ae","sourceId":"1faa96f6","targetId":"0565c1b3","type":"AccessRelationship","name":"","documentation":""},{"id":"f789ccee","sourceId":"112e6f81","targetId":"1faa96f6","type":"UsedByRelationship","name":"","documentation":""},{"id":"fced442b","sourceId":"13c433b9","targetId":"7c0f0879","type":"AssignmentRelationship","name":"","documentation":""},{"id":"73806f06","sourceId":"13c433b9","targetId":"6a32a270","type":"AssignmentRelationship","name":"","documentation":""},{"id":"fb635880","sourceId":"29d98cfa","targetId":"7c0f0879","type":"TriggeringRelationship","name":"","documentation":""},{"id":"794d09c2","sourceId":"29d98cfa","targetId":"6a32a270","type":"TriggeringRelationship","name":"","documentation":""},{"id":"de55bd0e","sourceId":"6a32a270","targetId":"29d98cfa","type":"UsedByRelationship","name":"","documentation":""},{"id":"590a4102","sourceId":"7c0f0879","targetId":"29d98cfa","type":"UsedByRelationship","name":"","documentation":""},{"id":"3f092f73","sourceId":"13c433b9","targetId":"5fd67cef","type":"AssignmentRelationship","name":"","documentation":""},{"id":"8f0cad2e","sourceId":"13c433b9","targetId":"20223a7d","type":"AssignmentRelationship","name":"","documentation":""},{"id":"2e2f329f","sourceId":"13c433b9","targetId":"02b8e817","type":"AssignmentRelationship","name":"","documentation":""},{"id":"f6621f47","sourceId":"13c433b9","targetId":"3a15c1ff","type":"AssignmentRelationship","name":"","documentation":""},{"id":"150b2875","sourceId":"7c0f0879","targetId":"5fd67cef","type":"RealisationRelationship","name":"","documentation":""},{"id":"c884f239","sourceId":"7c0f0879","targetId":"02b8e817","type":"RealisationRelationship","name":"","documentation":""},{"id":"149b5354","sourceId":"6a32a270","targetId":"3a15c1ff","type":"RealisationRelationship","name":"","documentation":""},{"id":"a86810dc","sourceId":"6a32a270","targetId":"20223a7d","type":"RealisationRelationship","name":"","documentation":""},{"id":"cf869bcb","sourceId":"5fd67cef","targetId":"02b8e817","type":"FlowRelationship","name":"","documentation":""},{"id":"f0d9050f","sourceId":"7c0f0879","targetId":"6a32a270","type":"FlowRelationship","name":"","documentation":""},{"id":"3dafbff4","sourceId":"02b8e817","targetId":"5fd67cef","type":"TriggeringRelationship","name":"","documentation":""},{"id":"95e78172","sourceId":"20223a7d","targetId":"3a15c1ff","type":"TriggeringRelationship","name":"","documentation":""},{"id":"38699e2f","sourceId":"e4e1e875","targetId":"8aebc9fb","type":"UsedByRelationship","name":"","documentation":""},{"id":"71fecbde","sourceId":"83945d30","targetId":"300b77ef","type":"CompositionRelationship","name":"","documentation":""},{"id":"2d9bb539","sourceId":"83945d30","targetId":"4614a6ed","type":"CompositionRelationship","name":"","documentation":""},{"id":"b8a3592a","sourceId":"83945d30","targetId":"52a96e48","type":"CompositionRelationship","name":"","documentation":""},{"id":"66d0de28","sourceId":"83945d30","targetId":"3854cbf5","type":"CompositionRelationship","name":"","documentation":""},{"id":"88ff0850","sourceId":"83945d30","targetId":"50efc343","type":"CompositionRelationship","name":"","documentation":""},{"id":"f99e292c","sourceId":"83945d30","targetId":"c0a8da45","type":"CompositionRelationship","name":"","documentation":""},{"id":"235ca3eb","sourceId":"83945d30","targetId":"7d767887","type":"CompositionRelationship","name":"","documentation":""},{"id":"e2f07282","sourceId":"83945d30","targetId":"b43e7644","type":"CompositionRelationship","name":"","documentation":""},{"id":"523adcae","sourceId":"83945d30","targetId":"e2e3e577","type":"CompositionRelationship","name":"","documentation":""},{"id":"ea77fca3","sourceId":"83945d30","targetId":"5522cdc7","type":"CompositionRelationship","name":"","documentation":""},{"id":"a2b02a11","sourceId":"83945d30","targetId":"1f3abccc","type":"CompositionRelationship","name":"","documentation":""},{"id":"e5b6a4f7","sourceId":"83945d30","targetId":"b8b6f329","type":"CompositionRelationship","name":"","documentation":""},{"id":"10007187","sourceId":"83945d30","targetId":"2a764e64","type":"CompositionRelationship","name":"","documentation":""},{"id":"2dacf037","sourceId":"83945d30","targetId":"7a67bb3b","type":"CompositionRelationship","name":"","documentation":""},{"id":"bf3dbfbc","sourceId":"83945d30","targetId":"4afcfeef","type":"CompositionRelationship","name":"","documentation":""},{"id":"0ebc8828","sourceId":"83945d30","targetId":"c93fe4ad","type":"CompositionRelationship","name":"","documentation":""},{"id":"eea3a8b3","sourceId":"83945d30","targetId":"e480cb58","type":"CompositionRelationship","name":"","documentation":""},{"id":"84944871","sourceId":"83945d30","targetId":"56f4152b","type":"CompositionRelationship","name":"","documentation":""},{"id":"5288dfb9","sourceId":"79cd003f","targetId":"e8cdbe3d","type":"AccessRelationship","name":"","documentation":""},{"id":"3f3fb3cd","sourceId":"2e900c89","targetId":"e4e1e875","type":"UsedByRelationship","name":"","documentation":""},{"id":"6a9318ff","sourceId":"9aad06d8","targetId":"e48222c4","type":"CompositionRelationship","name":"","documentation":""},{"id":"9d9bcb37","sourceId":"11595938","targetId":"9fd71b99","type":"CompositionRelationship","name":"","documentation":""},{"id":"021d9bd3","sourceId":"11595938","targetId":"0057a4cb","type":"CompositionRelationship","name":"","documentation":""},{"id":"586c77f0","sourceId":"11595938","targetId":"0057a4cb","type":"AggregationRelationship","name":"","documentation":""},{"id":"e79542de","sourceId":"9fd71b99","targetId":"11595938","type":"AssociationRelationship","name":"","documentation":""},{"id":"249129eb","sourceId":"7a4b0930","targetId":"32f489ed","type":"RealisationRelationship","name":"","documentation":""},{"id":"00f474dd","sourceId":"a3560c3b","targetId":"32f489ed","type":"CompositionRelationship","name":"","documentation":""},{"id":"4aaeac71","sourceId":"a3560c3b","targetId":"178c6360","type":"AssociationRelationship","name":"","documentation":""},{"id":"2b099627","sourceId":"178c6360","targetId":"32f489ed","type":"AssociationRelationship","name":"","documentation":""},{"id":"be3e6ca7","sourceId":"58889dce","targetId":"32f489ed","type":"UsedByRelationship","name":"","documentation":""},{"id":"2f34d8d7","sourceId":"6ad71be9","targetId":"32f489ed","type":"UsedByRelationship","name":"","documentation":""},{"id":"16bd7b71","sourceId":"632c8cda","targetId":"f5f521b3","type":"UsedByRelationship","name":"","documentation":""},{"id":"82a3bd1a","sourceId":"a3560c3b","targetId":"64186310","type":"AssociationRelationship","name":"","documentation":""},{"id":"0229a87c","sourceId":"987c9bf3","targetId":"f5f521b3","type":"AssociationRelationship","name":"","documentation":""},{"id":"eebbd4d7","sourceId":"987c9bf3","targetId":"64186310","type":"UsedByRelationship","name":"","documentation":""},{"id":"bace8855","sourceId":"64186310","targetId":"987c9bf3","type":"AssociationRelationship","name":"","documentation":""},{"id":"f733bc8b","sourceId":"2e3a27a1","targetId":"9fd71b99","type":"AssociationRelationship","name":"","documentation":""},{"id":"fa7a36ff","sourceId":"0057a4cb","targetId":"7a4b0930","type":"SpecialisationRelationship","name":"","documentation":""},{"id":"fcbc63eb","sourceId":"64186310","targetId":"5deaab78","type":"AssociationRelationship","name":"","documentation":""},{"id":"5621fee0","sourceId":"5deaab78","targetId":"58889dce","type":"AssociationRelationship","name":"","documentation":""},{"id":"785ef222","sourceId":"2e3a27a1","targetId":"f5f521b3","type":"UsedByRelationship","name":"","documentation":""},{"id":"cd43b85e","sourceId":"32f489ed","targetId":"96378f26","type":"AssociationRelationship","name":"","documentation":""},{"id":"48b6161e","sourceId":"96378f26","targetId":"24f7857e","type":"AssociationRelationship","name":"","documentation":""},{"id":"08052a66","sourceId":"7a4b0930","targetId":"24f7857e","type":"AssociationRelationship","name":"","documentation":""},{"id":"874e7ef3","sourceId":"0057a4cb","targetId":"257b52a3","type":"AssociationRelationship","name":"","documentation":""}],"views":[{"id":"644e050e","name":"Highlevel","viewpoint":"","documentation":""},{"id":"a675293b","name":"Task States Model","viewpoint":"","documentation":""},{"id":"a1b0a18a","name":"01-Business Arch","viewpoint":"","documentation":""},{"id":"40fc0436","name":"SmartAgreement Highlevel Process","viewpoint":"8","documentation":""},{"id":"5b5c1214","name":"SmartAgreement Template","viewpoint":"11","documentation":""},{"id":"620fda00","name":"Task request sceanrio","viewpoint":"","documentation":""},{"id":"54a4de42","name":"Operate Agreement","viewpoint":"8","documentation":""},{"id":"cf7b444a","name":"02-Application Arch","viewpoint":"","documentation":""},{"id":"9c3c2eda","name":"03-Tech Arch","viewpoint":"","documentation":""},{"id":"a8b52140","name":"ITFM L1 Process","viewpoint":"8","documentation":"Financial Management\n2.4.1 Process Overview\nThe Financial Management process provides the business and IT with the quantification (in financial terms) of the value of IT services, the value of the assets underlying the provisioning of those services, and the qualification of operational forecasting. It includes all function and processes responsible for managing an IT service provider's budgeting, accounting and charging policies and activities.\nKey objectives of Financial Management are:\n• Establishing and enforcing IT financial controls\n• Ensuring compliance with legal, industry, and corporate standards and procedures\nAssisting IT portfolio investment decisions by providing detailed business cases as well as financial input for decision support\n• Effectively predicting and controlling IT budgets\n• Providing the enterprise with operational visibility, insight, and superior decision-making.\nThe overriding goal of Financial Management is to provide cost effective stewardship of the IT assets and the financial resources used in providing IT services. Primarily this is to enable an organization to account fully for the financial resources consumed by the IT service provider and to attribute these costs to the services delivered to the organization’s customers.\nThis is accomplished by the categorization, collection and analysis of accounting, contract and pricing data including the following typical cost elements:\n• Hardware and software license costs\n• Annual maintenance fees for hardware and software\n• Personnel resources used in the support or maintenance of a service\n• Utilities, data centre or other facilities charges\n• Taxes, capital or interest charges\n• Compliance costs\n• Transfer costs and internal charging by other business units/processes.\nAccounting\nBudgeting\nBusiness Impact Analysis\nCharging\nFinancial Demand Modelling\nFunding Models  Evaluation\nService Provisioning Analysis and Optimization\nService Valuation\nVariable Cost Dynamics Analysis\n"},{"id":"10b79449","name":"ITIL Roles 2","viewpoint":"1","documentation":""},{"id":"0ce2c758","name":"ServiceNow Users and Groups","viewpoint":"","documentation":""},{"id":"1ab165ac","name":"Chargeback/Showback FC","viewpoint":"","documentation":""},{"id":"ba0c6e6f","name":"Budgeting App Arch","viewpoint":"","documentation":""},{"id":"992b6526","name":"Accounting","viewpoint":"","documentation":""},{"id":"07c6e5fe","name":"SMAG Contract","viewpoint":"","documentation":""},{"id":"8f92b990","name":"Accounting Process L2","viewpoint":"","documentation":""},{"id":"e0a96c2a","name":"Charging Process L2","viewpoint":"","documentation":""},{"id":"f1557bac","name":"ITFM L2 Process","viewpoint":"8","documentation":""},{"id":"3caa77db","name":"ITFM Process Interface","viewpoint":"8","documentation":"Inputs\n• Service Level Agreements\n• Service valuation\n• Demand modeling\n• Service investment analysis\n• Estimated costs and cost types\n• Depreciation schedules\n• Service Catalog and CIs.\n\nOutputs\n• Budsget for governance of expenses\n• Actual costs of services\n• Management reporting to assist decision-making\n• Service value potential\n• Authorization\n• Service Portfolio\n• Costing model\n• Charging rates and policies per service\n• Return on Investment, Return on Capital Employed, and Total Cost of Ownership.\n\n\n\n\nSeam Management Authority Matrix\nThe term seam refers to a connection or interaction between one or more organizations. It could be an interaction between business units, business units to IT Service Provider, or IT Service Provider to IT Service Provider. The seam analysis helps to identify the processes, people and technology required to coordinate end to end management of IT Services.\n\nThe following table provides key seam descriptions.\nThe following tables identify key process activities and where possible, associate activity with process seams and key roles.\nThe authority matrix below identifies process activities that can be associated with key roles and/or process seams. These relationships are documented in terms of RACI (Responsible, Accountable, Consulted, and Informed). This table does NOT represent a RACI mapping to the organization or sub-processes.\n     Seam\n  Seam Descriptions\n   TBD\n       Seam\n  Required ITSM Process Specification\n   will determine a “unit price” (e.g. budget allocation, chargeback, etc.) for each Service.\n       Seam\nRequired ITSM Process Specification\n Process Owner\n  Process Manager\n Service Provider Lead\n  Financial Management Approval Committee\n  Determine the colors of money and how these can be used to fund Services (e.g.)\n• Operations & Maintenance\n  CI\n  AR\n  R\n  R\n \n  ITSM Process Interface Document\n    (O&M) - 1 year cycle\n• Research & Development (R&D) - 2 year cycle\n• Procurement - 3 year cycle\n        Define, calculate and monitor the unit costs of provisioning each Service.\n CI\n  AR\n R\n R\n  Quantify, in financial terms, the value of IT Services and the value of the assets underlying the provisioning of those services.\n CI\n  AR\n R\n R\n  Review requests for new investments and approve or reject the allocation of the budget and resources.\n CI\n  AR\n R\n R\n  Perform periodic and ad- hoc audits to ensure compliance with the NGEN IT Financial Management strategy and adherence to published procedures and policies.\n CI\n  AR\n R\n R\n  Determine the appropriate pricing for IT Services.\n CI\n  AR\n R\n R\n  Update the Government’s Asset Management tool upon the procurement or update of a service.\n CI\n  AR\n R\n R\n  Monitor and report costs against the budget, review the financial forecasts, and manage costs accordingly.\n  CI\n  AR\n  R\n  R\n             2.4.5 Process Interfaces\nAny process is triggered by an event or activity and associated artifact(s), and produces an output which typically feeds into another process.\nInterfaces\nThis process has a key relationship or dependency with the following ITSM processes:\n• Strategy Generation\n• Service Portfolio Management\n• Demand Management\n• Service Level Management\n• Supplier Management\nPage 24\n • Capacity Management\n• Service Asset and Configuration Management. Inputs\n2.4.6 Roles\nThe following roles have been identified with the process.\nNGEN ITSM Process Interface Document\n         Roles\n  Description\n  Financial Management Process Owner\n The strategic role accountable for the Process.\n  Financial Management Process Manager ( NGEN BFM)\n The tactical role that performs cross segment coordination of the quantification, in financial terms, of the value of IT Services and the value of assets underlying the provisioning of those services.\n   Page 25\n NGEN ITSM Process Interface Document\n    Financial Management Approval Committee\n  Reviews requests for new investments and approves or rejects the allocation of budget and resources.\n 2.4.7 Performance Metrics\nThe effectiveness and performance of the process are measured using metrics-based Key Performance Indicators (KPIs) which support high level Critical Success Factors (CSFs). The CSFs and KPIs below are examples which may or may not reflect actual Key Performance Parameters (KPPs).\n     CSF #\nCritical Success Factors\n  KPI #\n  Key Performance Indicators\n  1\n                    Provide Effective Stewardship of IT Finances\n  1\n Unplanned Cost Variance. NGEN must provide the Navy and Marine Corps with improved cost planning to inform DON Program Objective decisions and to effectively use allocated budget. = Total to-date planned budget costs minus Total IT budget\n  2\n Cost Performance Index. NGEN will employ financial resources fully and not exceed planned and authorized budget. = Total to-date planned budget costs divided by Total to-date actual budget costs.\n  3\n Estimated Year-End Costs. Determine how much will actually be spent at the end of the fiscal year. = Total IT budget multiplied by the Cost Performance Index KPI.\n  4\n Variance at Budget Year-End. Determine how much will the NGEN program be over or under its fiscal IT budget. = Estimated Year- End Costs KPI minus the Total IT budget.\n  6\n Financial Management Process Maturity. NGEN will execute financial management to a high-level of process maturity. Evaluated as a COBIT maturity process level.\n  8\n Number of Financial Reports/Forecasts Delivered Late. The NGEN financial management process will ensure financial reports are delivered on time.\n  2\n    Maintain Overall Effectiveness of the IT Financial Management Process\n   5\n Financial Management Tooling Support Level. NGEN toolsets that support financial management activities will facilitate the high level of process maturity. Evaluated as a COBIT maturity process level.\n  6\n  Financial Management Process Maturity.\n             Page 26\n NGEN ITSM Process Interface Document\n \nNGEN will execute financial management to a high-level of process maturity. Evaluated as a COBIT maturity process level.\n8\nNumber of Financial Reports/Forecasts Delivered Late. The NGEN financial management process will ensure financial reports are delivered on time.\n3\nRecapture IT Costs Through Chargeback for Delivery of IT Services\n5\nFinancial Management Tooling Support Level. NGEN toolsets that support financial management activities will facilitate the high level of process maturity. Evaluated as a COBIT maturity process level.\n7\nIT Invoicing/Payment Variance. Determine how much of obligated funds were not actually paid out. = Total obligated funds minus Total paid funds.\n4\nEnsure Customers are Satisfied with Costs and Charges for Services\n9\n Number of Changes to Charging Algorithms. Changes to algorithms used to formulate payment for IT Services is an indicator of customer satisfaction. If no changes and customers are satisfied, no changes were needed. If no changes and customers are dissatisfied, changes should’ve been made. If changes were made and customers are still dissatisfied, changes were inadequate or incorrect.\n \n \n  2.4.8 Tools Interface Requirements\nThe following known tool interfaces requirements should be considered during further development of the process:\n• Financial System (ERP, etc.)\n• Service Knowledge Management System (SKMS)"},{"id":"eb78cc1e","name":"ITFM Swimlane Process","viewpoint":"","documentation":""},{"id":"96ae9b2d","name":"Task Record Data model","viewpoint":"","documentation":"essential attributes"},{"id":"0f558158","name":"IT4IT RA L1","viewpoint":"","documentation":""},{"id":"f621d58c","name":"IT4IT R2D RA","viewpoint":"","documentation":""},{"id":"6776286a","name":"ServiceNow App","viewpoint":"","documentation":""},{"id":"b92d2b11","name":"ServiceNow L1","viewpoint":"","documentation":""},{"id":"18b3972b","name":"ServiceNow IT Finance","viewpoint":"","documentation":""},{"id":"2a2b701c","name":"ServiceNow FM Data Model","viewpoint":"11","documentation":""},{"id":"1410aec2","name":"ServiceNow ITFM Budgeting","viewpoint":"","documentation":"Budgeting is the setting of expenditure levels for each of an organization’s functions. It is the estimation and allocation of available capital used to achieve the designated targets of a firm.\n\nBudget line items should align with accounting (financial statement) line items, and the structure of the full operating budget should match the chart of accounts (the structure of the accounting system), to ensure effective comparisons between budget and actuals.  A mismatch between budget items and accounting items creates extra work for administrative staff or key volunteers who must translate between the two and risks inconsistencies that undermine the usefulness of financial reports.  Especially for expenses, when accounting/financial statement line items exist without corresponding budget line items, it can result in budget overages or erroneously reported line item balances.  "},{"id":"5204cbd7","name":"IT Expenduture Types","viewpoint":"","documentation":""},{"id":"10b4c694","name":"Rate Card Cost Data Model","viewpoint":"","documentation":""}]}