{"id":"e87126e7","name":"ArchiMate template","documentation":"Contains all ArchiMate Viewpoints.","file":"../../raw-data/github/archimate/ArchiMate Template.archimate","format":"ARCHIMATE","source":"","timestamp":"15-06-2023 04:10:54","tags":[],"archiVersion":"3.1.1","language":"","elements":[{"id":"73af879c","name":"Meaning","type":"Meaning","layer":"motivation","documentation":""},{"id":"84acb4a4","name":"Business Object","type":"BusinessObject","layer":"business","documentation":""},{"id":"ea0e8bad","name":"Business Process","type":"BusinessProcess","layer":"business","documentation":""},{"id":"d7adedb9","name":"Business Service","type":"BusinessService","layer":"business","documentation":""},{"id":"50e68c70","name":"Business Event","type":"BusinessEvent","layer":"business","documentation":""},{"id":"96ede6ac","name":"Value","type":"Value","layer":"motivation","documentation":""},{"id":"ac04ff49","name":"Business Interface","type":"BusinessInterface","layer":"business","documentation":""},{"id":"99f862af","name":"Business Role","type":"BusinessRole","layer":"business","documentation":""},{"id":"e4afc5e6","name":"Business Actor","type":"BusinessActor","layer":"business","documentation":""},{"id":"efd5059d","name":"Data Object","type":"DataObject","layer":"application","documentation":""},{"id":"7c5a6f6f","name":"Application Service","type":"ApplicationService","layer":"application","documentation":""},{"id":"1b80e28b","name":"Application Interface","type":"ApplicationInterface","layer":"application","documentation":""},{"id":"c64411e3","name":"Application Function","type":"ApplicationFunction","layer":"application","documentation":""},{"id":"5a85ac42","name":"Application Component","type":"ApplicationComponent","layer":"application","documentation":""},{"id":"ca81f780","name":"Artifact","type":"Artifact","layer":"technology","documentation":""},{"id":"dfbde591","name":"Infrastructure Service","type":"TechnologyService","layer":"technology","documentation":""},{"id":"b27449c6","name":"System Software","type":"SystemSoftware","layer":"technology","documentation":""},{"id":"277b4c20","name":"Device","type":"Device","layer":"technology","documentation":""},{"id":"ffd20d33","name":"Network","type":"CommunicationNetwork","layer":"technology","documentation":""},{"id":"ee4917e0","name":"Infrastructure Interface","type":"TechnologyInterface","layer":"technology","documentation":""},{"id":"b975bcd0","name":"Plateau","type":"Plateau","layer":"implementation_migration","documentation":""}],"relationships":[{"id":"68ed00c4","sourceId":"84acb4a4","targetId":"73af879c","type":"AssociationRelationship","name":"association","documentation":""},{"id":"309b2ed7","sourceId":"efd5059d","targetId":"84acb4a4","type":"RealisationRelationship","name":"","documentation":""},{"id":"4dae70de","sourceId":"ca81f780","targetId":"efd5059d","type":"RealisationRelationship","name":"realization","documentation":""},{"id":"215ea0fb","sourceId":"ea0e8bad","targetId":"84acb4a4","type":"AccessRelationship","name":"access","documentation":""},{"id":"f7dfcfa7","sourceId":"ea0e8bad","targetId":"d7adedb9","type":"RealisationRelationship","name":"","documentation":""},{"id":"5e550fc5","sourceId":"50e68c70","targetId":"ea0e8bad","type":"TriggeringRelationship","name":"triggers","documentation":""},{"id":"4f5edb1c","sourceId":"d7adedb9","targetId":"96ede6ac","type":"AssociationRelationship","name":"","documentation":""},{"id":"6a317d64","sourceId":"ac04ff49","targetId":"d7adedb9","type":"AssignmentRelationship","name":"assignment","documentation":""},{"id":"50f00f92","sourceId":"99f862af","targetId":"ac04ff49","type":"AssociationRelationship","name":"","documentation":""},{"id":"6dee007e","sourceId":"99f862af","targetId":"ea0e8bad","type":"AssignmentRelationship","name":"","documentation":""},{"id":"616a20de","sourceId":"e4afc5e6","targetId":"99f862af","type":"AssignmentRelationship","name":"","documentation":""},{"id":"db5a34c5","sourceId":"7c5a6f6f","targetId":"ea0e8bad","type":"UsedByRelationship","name":"","documentation":""},{"id":"35a6a497","sourceId":"1b80e28b","targetId":"99f862af","type":"UsedByRelationship","name":"","documentation":""},{"id":"b333bd12","sourceId":"1b80e28b","targetId":"7c5a6f6f","type":"AssignmentRelationship","name":"","documentation":""},{"id":"58b803ca","sourceId":"c64411e3","targetId":"7c5a6f6f","type":"RealisationRelationship","name":"","documentation":""},{"id":"22b40893","sourceId":"5a85ac42","targetId":"1b80e28b","type":"AssociationRelationship","name":"","documentation":""},{"id":"59a6b26b","sourceId":"5a85ac42","targetId":"c64411e3","type":"AssignmentRelationship","name":"","documentation":""},{"id":"68123c86","sourceId":"c64411e3","targetId":"efd5059d","type":"AccessRelationship","name":"","documentation":""},{"id":"f81f7adc","sourceId":"dfbde591","targetId":"c64411e3","type":"UsedByRelationship","name":"","documentation":""},{"id":"35f7dc11","sourceId":"b27449c6","targetId":"dfbde591","type":"RealisationRelationship","name":"","documentation":""},{"id":"0eaddc0f","sourceId":"b27449c6","targetId":"ca81f780","type":"AssignmentRelationship","name":"","documentation":""},{"id":"0fee44ca","sourceId":"277b4c20","targetId":"b27449c6","type":"AssignmentRelationship","name":"","documentation":""},{"id":"22cc910d","sourceId":"277b4c20","targetId":"ffd20d33","type":"AssociationRelationship","name":"","documentation":""},{"id":"5d340644","sourceId":"277b4c20","targetId":"ee4917e0","type":"AssociationRelationship","name":"","documentation":""},{"id":"8280526a","sourceId":"ee4917e0","targetId":"5a85ac42","type":"UsedByRelationship","name":"","documentation":""},{"id":"1cc5bddc","sourceId":"ee4917e0","targetId":"dfbde591","type":"AssignmentRelationship","name":"","documentation":""}],"views":[{"id":"5f78b078","name":"__Views","viewpoint":"","documentation":""},{"id":"36ddb1fb","name":"Domain: Product","viewpoint":"","documentation":""},{"id":"69aa2bf0","name":"Domain: Information","viewpoint":"","documentation":""},{"id":"fe16ddc3","name":"Domain: Process","viewpoint":"","documentation":""},{"id":"7e78233d","name":"Domain: Organization","viewpoint":"","documentation":""},{"id":"7b619e8a","name":"Domain: Data","viewpoint":"","documentation":""},{"id":"5f76e7d4","name":"Domain: Application","viewpoint":"","documentation":""},{"id":"0edf3624","name":"Domain: Infrastructure","viewpoint":"","documentation":""},{"id":"8a6d8951","name":"_Archimate Domains","viewpoint":"","documentation":""},{"id":"00000001","name":"Viewpoint: Introductory","viewpoint":"","documentation":"The Introductory viewpoint forms a subset of the full ArchiMate language using a simplified notation. It is typically used at the start of a design trajectory, when not everything needs to be detailed yet, or to explain the essence of an architecture model to non-architects that require a simpler, more intuitive notation. Another use of this basic, less formal viewpoint is that it tries to avoid the impression that the architectural design is already fixed, an idea that may easily arise when using a more formal, highly structured or detailed visualization.\r\n\r\nWe use a simplified notation for the concepts (e.g., a cloud to represent a network, as is common in informal diagrams of the technical infrastructure), and for the relationships. All relationships except “triggering” and “realization” are denoted by simple lines; “realization” has an arrow in the direction of the realized service; “triggering” is also represented by an arrow."},{"id":"00000003","name":"Viewpoint: Organization","viewpoint":"","documentation":"The Organization viewpoint focuses on the (internal) organization of a company, a department, a network of companies, or of another organizational entity. It is possible to present models in this viewpoint as nested block diagrams, but also in a more traditional way, such as organizational charts. The Organization viewpoint is very useful in identifying competencies, authority, and responsibilities in an organization."},{"id":"00000005","name":"Viewpoint: Actor Co-operation","viewpoint":"","documentation":"The Actor Co-operation viewpoint focuses on the relationships of actors with each other and their environment. A common example of this is the “context diagram”, which puts an organization into its environment, consisting of external parties such as customers, suppliers, and other business partners. It is very useful in determining external dependencies and collaborations and shows the value chain or network in which the actor operates.\r\n\r\nAnother important use of the Actor Co-operation viewpoint is in showing how a number of co-operating business actors and/or application components together realize a business process. Hence, in this view, both business actors or roles and application components may occur."},{"id":"00000007","name":"Viewpoint: Business Function","viewpoint":"","documentation":"The Business Function viewpoint shows the main business functions of an organization and their relationships in terms of the flows of information, value, or goods between them. Business functions are used to represent the most stable aspects of a company in terms of the primary activities it performs, regardless of organizational changes or technological developments. Therefore, the business function architecture of companies that operate in the same market often exhibit close similarities. The business function viewpoint thus provides high-level insight in the general operations of the company, and can be used to identify necessary competencies, or to structure an organization according to its main activities."},{"id":"00000009","name":"Viewpoint: Business Process","viewpoint":"","documentation":"The Business Process viewpoint is used to show the high-level structure and composition of one or more business processes. Next to the processes themselves, this viewpoint contains other directly related concepts, such as:\r\n\r\n-. The services that a business process offers to the outside world, showing how a process contribute to the realization of the company's products.\r\n-. The assignment of business processes to roles, which gives insight into the responsibilities of the associated actors.\r\n-. The information used by the business process."},{"id":"00000011","name":"Viewpoint: Business Process Co-operation","viewpoint":"","documentation":"The Business Process Co-operation viewpoint is used to show the relationships of one or more business processes with each other and/or with their environment. It can both be used to create a high-level design of business processes within their context and to provide an operational manager responsible for one or more such processes with insight into their dependencies. Important aspects of business process co-operation are:\r\n\r\n• Causal relationships between the main business processes of the enterprise\r\n• Mapping of business processes onto business functions\r\n• Realization of services by business processes\r\n• Use of shared data"},{"id":"00000013","name":"Viewpoint: Product","viewpoint":"","documentation":"The Product viewpoint depicts the value that these products offer to the customers or other external parties involved and shows the composition of one or more products in terms of the constituting (business or application) services, and the associated contract(s) or other agreements. It may also be used to show the interfaces (channels) through which this product is offered, and the events associated with the product. A Product viewpoint is typically used in product development to design a product by composing existing services or by identifying which new services have to be created for this product, given the value a customer expects from it. It may then serve as input for business process architects and others that need to design the processes and ICT realizing these products."},{"id":"00000015","name":"Viewpoint: Application Behavior","viewpoint":"","documentation":"The Application Behavior viewpoint describes the internal behavior of an application; e.g., as it realizes one or more application services. This viewpoint is useful in designing the main behavior of applications, or in identifying functional overlap between different applications."},{"id":"00000017","name":"Viewpoint: Application Co-operation","viewpoint":"","documentation":"The Application Co-operation viewpoint describes the relationships between applications components in terms of the information flows between them, or in terms of the services they offer and use. This viewpoint is typically used to create an overview of the application landscape of an organization. This viewpoint is also used to express the (internal) co-operation or orchestration of services that together support the execution of a business process."},{"id":"00000019","name":"Viewpoint: Application Structure","viewpoint":"","documentation":"The Application Structure viewpoint shows the structure of one or more applications or components. This viewpoint is useful in designing or understanding the main structure of applications or components and the associated data; e.g., to break down the structure of the system under construction, or to identify legacy application components that are suitable for migration/integration."},{"id":"00000021","name":"Viewpoint: Application Usage","viewpoint":"","documentation":"The Application Usage viewpoint describes how applications are used to support one or more business processes, and how they are used by other applications. It can be used in designing an application by identifying the services needed by business processes and other applications, or in designing business processes by describing the services that are available. Furthermore, since it identifies the dependencies of business processes upon applications, it may be useful to operational managers responsible for these processes."},{"id":"00000023","name":"Viewpoint: Infrastructure","viewpoint":"","documentation":"The Infrastructure viewpoint contains the software and hardware infrastructure elements supporting the application layer, such as physical devices, networks, or system software (e.g., operating systems, databases, and middleware)."},{"id":"00000025","name":"Viewpoint: Infrastructure Usage","viewpoint":"","documentation":"The Infrastructure Usage viewpoint shows how applications are supported by the software and hardware infrastructure: the infrastructure services are delivered by the devices; system software and networks are provided to the applications. This viewpoint plays an important role in the analysis of performance and scalability, since it relates the physical infrastructure to the logical world of applications. It is very useful in determining the performance and quality requirements on the infrastructure based on the demands of the various applications that use it."},{"id":"00000027","name":"Viewpoint: Implementation and Deployment","viewpoint":"","documentation":"The Implementation and Deployment viewpoint shows how one or more applications are realized on the infrastructure. This comprises the mapping of (logical) applications and components onto (physical) artifacts, such as Enterprise Java Beans, and the mapping of the information used by these applications and components onto the underlying storage infrastructure; e.g., database tables or other files. Deployment views play an important role in the analysis of performance and scalability, since they relate the physical infrastructure to the logical world of applications. In security and risk analysis, deployment views are used to identify, for example, critical dependencies and risks."},{"id":"00000029","name":"Viewpoint: Information Structure","viewpoint":"","documentation":"The Information Structure viewpoint is comparable to the traditional information models created in the development of almost any information system. It shows the structure of the information used in the enterprise or in a specific business process or application, in terms of data types or (object-oriented) class structures. Furthermore, it may show how the information at the business level is represented at the application level in the form of the data structures used there, and how these are then mapped onto the underlying infrastructure; e.g., by means of a database schema."},{"id":"00000031","name":"Viewpoint: Service Realization","viewpoint":"","documentation":"The Service Realization viewpoint is used to show how one or more business services are realized by the underlying processes (and sometimes by application components). Thus, it forms the bridge between the business products viewpoint and the business process view. It provides a “view from the outside” on one or more business processes."},{"id":"00000033","name":"Viewpoint: Layered","viewpoint":"","documentation":"The Layered viewpoint pictures several layers and aspects of an enterprise architecture in one diagram. There are two categories of layers, namely dedicated layers and service layers. The layers are the result of the use of the “grouping” relationship for a natural partitioning of the entire set of objects and relationships that belong to a model. The infrastructure, the application, the process, and the actors/roles layers belong to the first category. The structural principle behind a fully layered viewpoint is that each dedicated layer exposes, by means of the “realization” relationship, a layer of services, which are further on “used by” the next dedicated layer. Thus, we can easily separate the internal structure and organization of a dedicated layer from its externally observable behavior expressed as the service layer that the dedicated layer realizes. The order, number, or nature of these layers are not fixed, but in general a (more or less) complete and natural layering of an ArchiMate model should contain the succession of layers depicted in the example given below. However, this example is by no means intended to be prescriptive. The main goal of the Layered viewpoint is to provide overview in one diagram. Furthermore, this viewpoint can be used as support for impact of change analysis and performance analysis or for extending the service portfolio."},{"id":"00000035","name":"Viewpoint: Landscape Map","viewpoint":"","documentation":"A landscape map is a matrix that represents a three-dimensional co-ordinate system that represents architectural relationships. The dimensions of the landscape maps can be freely chosen from the architecture that is being modeled. In practice, often dimensions are chosen from different architectural domains; for instance, business functions, application components, and products. Note that a landscape map uses the ArchiMate concepts, but not the standard notation of these concepts.\r\n\r\nIn most cases, the vertical axis represents behavior like business processes or functions; the horizontal axis represents “cases” for which those functions or processes must be executed, such as different products, services market segments, or scenarios; the third dimension represented by the cells of the matrix is used for assigning resources like information systems, infrastructure, or human resources. The value of cells can be visualized by means of colored rectangles with text labels. Obviously, landscape maps are a more powerful and expressive representation of relationships than traditional cross tables. They provide a practical manner for the generation and publication of overview tables for managers, process, and system owners. Furthermore, architects may use landscape maps as a resource allocation instrument and as an analysis tool for the detection of patterns and changes in this allocation."},{"id":"6c573bb1","name":"_Archimate Views","viewpoint":"","documentation":""},{"id":"dd16db14","name":"_Systematic Views","viewpoint":"","documentation":""},{"id":"461e77c8","name":"ArchiMate Concepts","viewpoint":"","documentation":""}]}